[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "aside_text",
                "bbox": [
                    67,
                    110,
                    144,
                    1594
                ],
                "angle": 270,
                "content": "arXiv:2005.12872v3 [cs.CV] 28 May 2020"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    146,
                    130,
                    1578,
                    194
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    212,
                    289,
                    1512,
                    389
                ],
                "angle": 0,
                "content": "Nicolas Carion*, Francisco Massa*, Gabriel Synnaeve, Nicolas Usunier, Alexander Kirillov, and Sergey Zagoruyko"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    750,
                    430,
                    971,
                    471
                ],
                "angle": 0,
                "content": "Facebook AI"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    257,
                    617,
                    1467,
                    1486
                ],
                "angle": 0,
                "content": "Abstract. We present a new method that views object detection as a direct set prediction problem. Our approach streamlines the detection pipeline, effectively removing the need for many hand-designed components like a non-maximum suppression procedure or anchor generation that explicitly encode our prior knowledge about the task. The main ingredients of the new framework, called DEetection Transformer or DETR, are a set-based global loss that forces unique predictions via bipartite matching, and a transformer encoder-decoder architecture. Given a fixed small set of learned object queries, DETR reasons about the relations of the objects and the global image context to directly output the final set of predictions in parallel. The new model is conceptually simple and does not require a specialized library, unlike many other modern detectors. DETR demonstrates accuracy and run-time performance on par with the well-established and highly-optimized Faster R-CNN baseline on the challenging COCO object detection dataset. Moreover, DETR can be easily generalized to produce panoptic segmentation in a unified manner. We show that it significantly outperforms competitive baselines. Training code and pretrained models are available at https://github.com/facebookresearch/detr."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    139,
                    1583,
                    534,
                    1632
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    136,
                    1699,
                    1587,
                    2347
                ],
                "angle": 0,
                "content": "The goal of object detection is to predict a set of bounding boxes and category labels for each object of interest. Modern detectors address this set prediction task in an indirect way, by defining surrogate regression and classification problems on a large set of proposals [37,5], anchors [23], or window centers [53,46]. Their performances are significantly influenced by postprocessing steps to collapse near-duplicate predictions, by the design of the anchor sets and by the heuristics that assign target boxes to anchors [52]. To simplify these pipelines, we propose a direct set prediction approach to bypass the surrogate tasks. This end-to-end philosophy has led to significant advances in complex structured prediction tasks such as machine translation or speech recognition, but not yet in object detection: previous attempts [43,16,4,39] either add other forms of prior knowledge, or have not proven to be competitive with strong baselines on challenging benchmarks. This paper aims to bridge this gap."
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    148,
                    2386,
                    500,
                    2429
                ],
                "angle": 0,
                "content": "\\* Equal contribution"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    136,
                    43,
                    165,
                    79
                ],
                "angle": 0,
                "content": "2"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    136,
                    148,
                    1581,
                    410
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 1: DETR directly predicts (in parallel) the final set of detections by combining a common CNN with a transformer architecture. During training, bipartite matching uniquely assigns predictions with ground truth boxes. Prediction with no match should yield a \"no object\" \\((\\varnothing)\\) class prediction."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    127,
                    740,
                    1588,
                    1038
                ],
                "angle": 0,
                "content": "We streamline the training pipeline by viewing object detection as a direct set prediction problem. We adopt an encoder-decoder architecture based on transformers [47], a popular architecture for sequence prediction. The self-attention mechanisms of transformers, which explicitly model all pairwise interactions between elements in a sequence, make these architectures particularly suitable for specific constraints of set prediction such as removing duplicate predictions."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    127,
                    1043,
                    1588,
                    1435
                ],
                "angle": 0,
                "content": "Our DETection TRansformer (DETR, see Figure 1) predicts all objects at once, and is trained end-to-end with a set loss function which performs bipartite matching between predicted and ground-truth objects. DETR simplifies the detection pipeline by dropping multiple hand-designed components that encode prior knowledge, like spatial anchors or non-maximal suppression. Unlike most existing detection methods, DETR doesn't require any customized layers, and thus can be reproduced easily in any framework that contains standard CNN and transformer classes.\\(^{1}\\)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    129,
                    1445,
                    1590,
                    1742
                ],
                "angle": 0,
                "content": "Compared to most previous work on direct set prediction, the main features of DETR are the conjunction of the bipartite matching loss and transformers with (non-autoregressive) parallel decoding [29,12,10,8]. In contrast, previous work focused on autoregressive decoding with RNNs [43,41,30,36,42]. Our matching loss function uniquely assigns a prediction to a ground truth object, and is invariant to a permutation of predicted objects, so we can emit them in parallel."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    129,
                    1745,
                    1587,
                    2193
                ],
                "angle": 0,
                "content": "We evaluate DETR on one of the most popular object detection datasets, COCO [24], against a very competitive Faster R-CNN baseline [37]. Faster R-CNN has undergone many design iterations and its performance was greatly improved since the original publication. Our experiments show that our new model achieves comparable performances. More precisely, DETR demonstrates significantly better performance on large objects, a result likely enabled by the non-local computations of the transformer. It obtains, however, lower performances on small objects. We expect that future work will improve this aspect in the same way the development of FPN [22] did for Faster R-CNN."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    131,
                    2196,
                    1587,
                    2301
                ],
                "angle": 0,
                "content": "Training settings for DETR differ from standard object detectors in multiple ways. The new model requires extra-long training schedule and benefits"
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    138,
                    2337,
                    1590,
                    2434
                ],
                "angle": 0,
                "content": "<sup>1</sup> In our work we use standard implementations of Transformers [47] and ResNet [15] backbones from standard deep learning libraries."
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    38,
                    1449,
                    89
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1559,
                    43,
                    1588,
                    82
                ],
                "angle": 0,
                "content": "3"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    136,
                    143,
                    1583,
                    246
                ],
                "angle": 0,
                "content": "from auxiliary decoding losses in the transformer. We thoroughly explore what components are crucial for the demonstrated performance."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    136,
                    248,
                    1583,
                    445
                ],
                "angle": 0,
                "content": "The design ethos of DETR easily extend to more complex tasks. In our experiments, we show that a simple segmentation head trained on top of a pretrained DETR outperforms competitive baselines on Panoptic Segmentation [19], a challenging pixel-level recognition task that has recently gained popularity."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    138,
                    527,
                    552,
                    581
                ],
                "angle": 0,
                "content": "2 Related work"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    138,
                    640,
                    1583,
                    789
                ],
                "angle": 0,
                "content": "Our work build on prior work in several domains: bipartite matching losses for set prediction, encoder-decoder architectures based on the transformer, parallel decoding, and object detection methods."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    138,
                    871,
                    552,
                    920
                ],
                "angle": 0,
                "content": "2.1 Set Prediction"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    138,
                    966,
                    1583,
                    1860
                ],
                "angle": 0,
                "content": "There is no canonical deep learning model to directly predict sets. The basic set prediction task is multilabel classification (see e.g., [40,33] for references in the context of computer vision) for which the baseline approach, one-vs-rest, does not apply to problems such as detection where there is an underlying structure between elements (i.e., near-identical boxes). The first difficulty in these tasks is to avoid near-duplicates. Most current detectors use postprocessings such as non-maximal suppression to address this issue, but direct set prediction are postprocessing-free. They need global inference schemes that model interactions between all predicted elements to avoid redundancy. For constant-size set prediction, dense fully connected networks [9] are sufficient but costly. A general approach is to use auto-regressive sequence models such as recurrent neural networks [48]. In all cases, the loss function should be invariant by a permutation of the predictions. The usual solution is to design a loss based on the Hungarian algorithm [20], to find a bipartite matching between ground-truth and prediction. This enforces permutation-invariance, and guarantees that each target element has a unique match. We follow the bipartite matching loss approach. In contrast to most prior work however, we step away from autoregressive models and use transformers with parallel decoding, which we describe below."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    138,
                    1940,
                    1003,
                    1994
                ],
                "angle": 0,
                "content": "2.2 Transformers and Parallel Decoding"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    138,
                    2032,
                    1583,
                    2429
                ],
                "angle": 0,
                "content": "Transformers were introduced by Vaswani et al. [47] as a new attention-based building block for machine translation. Attention mechanisms [2] are neural network layers that aggregate information from the entire input sequence. Transformers introduced self-attention layers, which, similarly to Non-Local Neural Networks [49], scan through each element of a sequence and update it by aggregating information from the whole sequence. One of the main advantages of attention-based models is their global computations and perfect memory, which makes them more suitable than RNNs on long sequences. Transformers are now"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    46,
                    163,
                    76
                ],
                "angle": 0,
                "content": "4"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    276,
                    43,
                    489,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    138,
                    146,
                    1583,
                    240
                ],
                "angle": 0,
                "content": "replacing RNNs in many problems in natural language processing, speech processing and computer vision [8,27,45,34,31]."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    138,
                    246,
                    1624,
                    643
                ],
                "angle": 0,
                "content": "Transformers were first used in auto-regressive models, following early sequence-to-sequence models [44], generating output tokens one by one. However, the prohibitive inference cost (proportional to output length, and hard to batch) lead to the development of parallel sequence generation, in the domains of audio [29], machine translation [12,10], word representation learning [8], and more recently speech recognition [6]. We also combine transformers and parallel decoding for their suitable trade-off between computational cost and the ability to perform the global computations required for set prediction."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    138,
                    709,
                    598,
                    756
                ],
                "angle": 0,
                "content": "2.3 Object detection"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    138,
                    781,
                    1583,
                    1178
                ],
                "angle": 0,
                "content": "Most modern object detection methods make predictions relative to some initial guesses. Two-stage detectors [37,5] predict boxes w.r.t. proposals, whereas single-stage methods make predictions w.r.t. anchors [23] or a grid of possible object centers [53,46]. Recent work [52] demonstrate that the final performance of these systems heavily depends on the exact way these initial guesses are set. In our model we are able to remove this hand-crafted process and streamline the detection process by directly predicting the set of detections with absolute box prediction w.r.t. the input image rather than an anchor."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    138,
                    1199,
                    1583,
                    1496
                ],
                "angle": 0,
                "content": "Set-based loss. Several object detectors [9,25,35] used the bipartite matching loss. However, in these early deep learning models, the relation between different prediction was modeled with convolutional or fully-connected layers only and a hand-designed NMS post-processing can improve their performance. More recent detectors [37,23,53] use non-unique assignment rules between ground truth and predictions together with an NMS."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    138,
                    1499,
                    1583,
                    1796
                ],
                "angle": 0,
                "content": "Learnable NMS methods [16,4] and relation networks [17] explicitly model relations between different predictions with attention. Using direct set losses, they do not require any post-processing steps. However, these methods employ additional hand-crafted context features like proposal box coordinates to model relations between detections efficiently, while we look for solutions that reduce the prior knowledge encoded in the model."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    138,
                    1819,
                    1583,
                    2165
                ],
                "angle": 0,
                "content": "Recurrent detectors. Closest to our approach are end-to-end set predictions for object detection [43] and instance segmentation [41,30,36,42]. Similarly to us, they use bipartite-matching losses with encoder-decoder architectures based on CNN activations to directly produce a set of bounding boxes. These approaches, however, were only evaluated on small datasets and not against modern baselines. In particular, they are based on autoregressive models (more precisely RNNs), so they do not leverage the recent transformers with parallel decoding."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    138,
                    2237,
                    665,
                    2286
                ],
                "angle": 0,
                "content": "3 The DETR model"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    138,
                    2334,
                    1583,
                    2429
                ],
                "angle": 0,
                "content": "Two ingredients are essential for direct set predictions in detection: (1) a set prediction loss that forces unique matching between predicted and ground truth"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    617,
                    38,
                    1449,
                    84
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1559,
                    43,
                    1585,
                    79
                ],
                "angle": 0,
                "content": "5"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    131,
                    143,
                    1587,
                    246
                ],
                "angle": 0,
                "content": "boxes; (2) an architecture that predicts (in a single pass) a set of objects and models their relation. We describe our architecture in detail in Figure 2."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    131,
                    317,
                    1000,
                    371
                ],
                "angle": 0,
                "content": "3.1 Object detection set prediction loss"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    129,
                    402,
                    1588,
                    699
                ],
                "angle": 0,
                "content": "DETR infers a fixed-size set of \\( N \\) predictions, in a single pass through the decoder, where \\( N \\) is set to be significantly larger than the typical number of objects in an image. One of the main difficulties of training is to score predicted objects (class, position, size) with respect to the ground truth. Our loss produces an optimal bipartite matching between predicted and ground truth objects, and then optimize object-specific (bounding box) losses."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    129,
                    702,
                    1587,
                    950
                ],
                "angle": 0,
                "content": "Let us denote by \\(y\\) the ground truth set of objects, and \\(\\hat{y} = \\{\\hat{y}_i\\}_{i=1}^N\\) the set of \\(N\\) predictions. Assuming \\(N\\) is larger than the number of objects in the image, we consider \\(y\\) also as a set of size \\(N\\) padded with \\(\\varnothing\\) (no object). To find a bipartite matching between these two sets we search for a permutation of \\(N\\) elements \\(\\sigma \\in \\mathfrak{S}_N\\) with the lowest cost:"
            },
            {
                "block_id": 6,
                "type": "equation",
                "bbox": [
                    565,
                    989,
                    1581,
                    1117
                ],
                "angle": 0,
                "content": "\\[\n\\hat {\\sigma} = \\underset {\\sigma \\in \\mathfrak {S} _ {N}} {\\arg \\min } \\sum_ {i} ^ {N} \\mathcal {L} _ {\\operatorname {m a t c h}} \\left(y _ {i}, \\hat {y} _ {\\sigma (i)}\\right), \\tag {1}\n\\]"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    131,
                    1158,
                    1587,
                    1307
                ],
                "angle": 0,
                "content": "where \\(\\mathcal{L}_{\\mathrm{match}}(y_i, \\hat{y}_{\\sigma(i)})\\) is a pair-wise matching cost between ground truth \\(y_i\\) and a prediction with index \\(\\sigma(i)\\). This optimal assignment is computed efficiently with the Hungarian algorithm, following prior work (e.g. [43])."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    129,
                    1309,
                    1587,
                    1727
                ],
                "angle": 0,
                "content": "The matching cost takes into account both the class prediction and the similarity of predicted and ground truth boxes. Each element \\(i\\) of the ground truth set can be seen as a \\(y_{i} = (c_{i},b_{i})\\) where \\(c_{i}\\) is the target class label (which may be \\(\\varnothing\\)) and \\(b_{i}\\in [0,1]^{4}\\) is a vector that defines ground truth box center coordinates and its height and width relative to the image size. For the prediction with index \\(\\sigma (i)\\) we define probability of class \\(c_{i}\\) as \\(\\hat{p}_{\\sigma (i)}(c_i)\\) and the predicted box as \\(\\hat{b}_{\\sigma (i)}\\). With these notations we define \\(\\mathcal{L}_{\\mathrm{match}}(y_i,\\hat{y}_{\\sigma (i)})\\) as \\(-\\mathbb{1}_{\\{c_i\\neq \\emptyset \\}}\\hat{p}_{\\sigma (i)}(c_i) + \\mathbb{1}_{\\{c_i\\neq \\emptyset \\}}\\mathcal{L}_{\\mathrm{box}}(b_i,\\hat{b}_{\\sigma (i)})\\)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    129,
                    1724,
                    1587,
                    1922
                ],
                "angle": 0,
                "content": "This procedure of finding matching plays the same role as the heuristic assignment rules used to match proposal [37] or anchors [22] to ground truth objects in modern detectors. The main difference is that we need to find one-to-one matching for direct set prediction without duplicates."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    129,
                    1922,
                    1587,
                    2124
                ],
                "angle": 0,
                "content": "The second step is to compute the loss function, the Hungarian loss for all pairs matched in the previous step. We define the loss similarly to the losses of common object detectors, i.e. a linear combination of a negative log-likelihood for class prediction and a box loss defined later:"
            },
            {
                "block_id": 11,
                "type": "equation",
                "bbox": [
                    286,
                    2163,
                    1578,
                    2291
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\text {H u n g a r i a n}} (y, \\hat {y}) = \\sum_ {i = 1} ^ {N} \\left[ - \\log \\hat {p} _ {\\hat {\\sigma} (i)} \\left(c _ {i}\\right) + \\mathbb {1} _ {\\{c _ {i} \\neq \\emptyset \\}} \\mathcal {L} _ {\\text {b o x}} \\left(b _ {i}, \\hat {b} _ {\\hat {\\sigma}} (i)\\right) \\right], \\tag {2}\n\\]"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    131,
                    2332,
                    1587,
                    2434
                ],
                "angle": 0,
                "content": "where \\(\\hat{\\sigma}\\) is the optimal assignment computed in the first step (1). In practice, we down-weight the log-probability term when \\(c_{i} = \\varnothing\\) by a factor 10 to account for"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    136,
                    43,
                    165,
                    79
                ],
                "angle": 0,
                "content": "6"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    129,
                    143,
                    1592,
                    494
                ],
                "angle": 0,
                "content": "class imbalance. This is analogous to how Faster R-CNN training procedure balances positive/negative proposals by subsampling [37]. Notice that the matching cost between an object and \\(\\varnothing\\) doesn't depend on the prediction, which means that in that case the cost is a constant. In the matching cost we use probabilities \\(\\hat{p}_{\\hat{\\sigma}(i)}(c_i)\\) instead of log-probabilities. This makes the class prediction term commensurable to \\(\\mathcal{L}_{\\mathrm{box}}(\\cdot, \\cdot)\\) (described below), and we observed better empirical performances."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    129,
                    512,
                    1592,
                    1030
                ],
                "angle": 0,
                "content": "Bounding box loss. The second part of the matching cost and the Hungarian loss is \\(\\mathcal{L}_{\\mathrm{box}}(\\cdot)\\) that scores the bounding boxes. Unlike many detectors that do box predictions as a \\(\\Delta\\) w.r.t. some initial guesses, we make box predictions directly. While such approach simplifies the implementation it poses an issue with relative scaling of the loss. The most commonly-used \\(\\ell_1\\) loss will have different scales for small and large boxes even if their relative errors are similar. To mitigate this issue we use a linear combination of the \\(\\ell_1\\) loss and the generalized IoU loss [38] \\(\\mathcal{L}_{\\mathrm{iou}}(\\cdot,\\cdot)\\) that is scale-invariant. Overall, our box loss is \\(\\mathcal{L}_{\\mathrm{box}}(b_i,\\hat{b}_{\\sigma(i)})\\) defined as \\(\\lambda_{\\mathrm{iou}}\\mathcal{L}_{\\mathrm{iou}}(b_i,\\hat{b}_{\\sigma(i)}) + \\lambda_{\\mathrm{L1}}||b_i - \\hat{b}_{\\sigma(i)}||_1\\) where \\(\\lambda_{\\mathrm{iou}},\\lambda_{\\mathrm{L1}}\\in \\mathbb{R}\\) are hyperparameters. These two losses are normalized by the number of objects inside the batch."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    131,
                    1094,
                    660,
                    1145
                ],
                "angle": 0,
                "content": "3.2 DETR architecture"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    129,
                    1171,
                    1592,
                    1373
                ],
                "angle": 0,
                "content": "The overall DETR architecture is surprisingly simple and depicted in Figure 2. It contains three main components, which we describe below: a CNN backbone to extract a compact feature representation, an encoder-decoder transformer, and a simple feed forward network (FFN) that makes the final detection prediction."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    129,
                    1373,
                    1592,
                    1630
                ],
                "angle": 0,
                "content": "Unlike many modern detectors, DETR can be implemented in any deep learning framework that provides a common CNN backbone and a transformer architecture implementation with just a few hundred lines. Inference code for DETR can be implemented in less than 50 lines in PyTorch [32]. We hope that the simplicity of our method will attract new researchers to the detection community."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    129,
                    1640,
                    1592,
                    1801
                ],
                "angle": 0,
                "content": "Backbone. Starting from the initial image \\( x_{\\mathrm{img}} \\in \\mathbb{R}^{3 \\times H_0 \\times W_0} \\) (with 3 color channels²), a conventional CNN backbone generates a lower-resolution activation map \\( f \\in \\mathbb{R}^{C \\times H \\times W} \\). Typical values we use are \\( C = 2048 \\) and \\( H, W = \\frac{H_0}{32}, \\frac{W_0}{32} \\)."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    129,
                    1809,
                    1592,
                    2316
                ],
                "angle": 0,
                "content": "Transformer encoder. First, a 1x1 convolution reduces the channel dimension of the high-level activation map \\( f \\) from \\( C \\) to a smaller dimension \\( d \\). creating a new feature map \\( z_0 \\in \\mathbb{R}^{d \\times H \\times W} \\). The encoder expects a sequence as input, hence we collapse the spatial dimensions of \\( z_0 \\) into one dimension, resulting in a \\( d \\times HW \\) feature map. Each encoder layer has a standard architecture and consists of a multi-head self-attention module and a feed forward network (FFN). Since the transformer architecture is permutation-invariant, we supplement it with fixed positional encodings [31,3] that are added to the input of each attention layer. We defer to the supplementary material the detailed definition of the architecture, which follows the one described in [47]."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    138,
                    2337,
                    1592,
                    2434
                ],
                "angle": 0,
                "content": "2 The input images are batched together, applying 0-padding adequately to ensure they all have the same dimensions \\((H_0,W_0)\\) as the largest image of the batch."
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    41,
                    1449,
                    87
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1559,
                    46,
                    1587,
                    76
                ],
                "angle": 0,
                "content": "7"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    134,
                    140,
                    1587,
                    502
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 2: DETR uses a conventional CNN backbone to learn a 2D representation of an input image. The model flattens it and supplements it with a positional encoding before passing it into a transformer encoder. A transformer decoder then takes as input a small fixed number of learned positional embeddings, which we call object queries, and additionally attends to the encoder output. We pass each output embedding of the decoder to a shared feed forward network (FFN) that predicts either a detection (class and bounding box) or a “no object” class."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    127,
                    968,
                    1592,
                    1771
                ],
                "angle": 0,
                "content": "Transformer decoder. The decoder follows the standard architecture of the transformer, transforming \\( N \\) embeddings of size \\( d \\) using multi-headed self- and encoder-decoder attention mechanisms. The difference with the original transformer is that our model decodes the \\( N \\) objects in parallel at each decoder layer, while Vaswani et al. [47] use an autoregressive model that predicts the output sequence one element at a time. We refer the reader unfamiliar with the concepts to the supplementary material. Since the decoder is also permutation-invariant, the \\( N \\) input embeddings must be different to produce different results. These input embeddings are learnt positional encodings that we refer to as object queries, and similarly to the encoder, we add them to the input of each attention layer. The \\( N \\) object queries are transformed into an output embedding by the decoder. They are then independently decoded into box coordinates and class labels by a feed forward network (described in the next subsection), resulting \\( N \\) final predictions. Using self- and encoder-decoder attention over these embeddings, the model globally reasons about all objects together using pair-wise relations between them, while being able to use the whole image as context."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    129,
                    1799,
                    1587,
                    2301
                ],
                "angle": 0,
                "content": "Prediction feed-forward networks (FFNs). The final prediction is computed by a 3-layer perceptron with ReLU activation function and hidden dimension \\( d \\), and a linear projection layer. The FFN predicts the normalized center coordinates, height and width of the box w.r.t. the input image, and the linear layer predicts the class label using a softmax function. Since we predict a fixed-size set of \\( N \\) bounding boxes, where \\( N \\) is usually much larger than the actual number of objects of interest in an image, an additional special class label \\( \\varnothing \\) is used to represent that no object is detected within a slot. This class plays a similar role to the \"background\" class in the standard object detection approaches."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    131,
                    2332,
                    1587,
                    2437
                ],
                "angle": 0,
                "content": "Auxiliary decoding losses. We found helpful to use auxiliary losses [1] in decoder during training, especially to help the model output the correct number"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    163,
                    79
                ],
                "angle": 0,
                "content": "8"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    276,
                    41,
                    489,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    138,
                    140,
                    1583,
                    340
                ],
                "angle": 0,
                "content": "of objects of each class. We add prediction FFNs and Hungarian loss after each decoder layer. All predictions FFNs share their parameters. We use an additional shared layer-norm to normalize the input to the prediction FFNs from different decoder layers."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    138,
                    425,
                    533,
                    481
                ],
                "angle": 0,
                "content": "4 Experiments"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    138,
                    533,
                    1583,
                    881
                ],
                "angle": 0,
                "content": "We show that DETR achieves competitive results compared to Faster R-CNN in quantitative evaluation on COCO. Then, we provide a detailed ablation study of the architecture and loss, with insights and qualitative results. Finally, to show that DETR is a versatile and extensible model, we present results on panoptic segmentation, training only a small extension on a fixed DETR model. We provide code and pretrained models to reproduce our experiments at https://github.com/facebookresearch/detr."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    138,
                    909,
                    1583,
                    1355
                ],
                "angle": 0,
                "content": "Dataset. We perform experiments on COCO 2017 detection and panoptic segmentation datasets [24,18], containing 118k training images and 5k validation images. Each image is annotated with bounding boxes and panoptic segmentation. There are 7 instances per image on average, up to 63 instances in a single image in training set, ranging from small to large on the same images. If not specified, we report AP as bbox AP, the integral metric over multiple thresholds. For comparison with Faster R-CNN we report validation AP at the last training epoch, for ablations we report median over validation results from the last 10 epochs."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    138,
                    1384,
                    1583,
                    2078
                ],
                "angle": 0,
                "content": "Technical details. We train DETR with AdamW [26] setting the initial transformer's learning rate to \\(10^{-4}\\), the backbone's to \\(10^{-5}\\), and weight decay to \\(10^{-4}\\). All transformer weights are initialized with Xavier init [11], and the backbone is with ImageNet-pretrained ResNet model [15] from TORCHVISION with frozen batchnorm layers. We report results with two different backbones: a ResNet-50 and a ResNet-101. The corresponding models are called respectively DETR and DETR-R101. Following [21], we also increase the feature resolution by adding a dilation to the last stage of the backbone and removing a stride from the first convolution of this stage. The corresponding models are called respectively DETR-DC5 and DETR-DC5-R101 (dilated C5 stage). This modification increases the resolution by a factor of two, thus improving performance for small objects, at the cost of a 16x higher cost in the self-attention of the encoder, leading to an overall 2x increase in computational cost. A full comparison of FLOPs of these models and Faster R-CNN is given in Table 1."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    138,
                    2083,
                    1583,
                    2429
                ],
                "angle": 0,
                "content": "We use scale augmentation, resizing the input images such that the shortest side is at least 480 and at most 800 pixels while the longest at most 1333 [50]. To help learning global relationships through the self-attention of the encoder, we also apply random crop augmentations during training, improving the performance by approximately 1 AP. Specifically, a train image is cropped with probability 0.5 to a random rectangular patch which is then resized again to 800-1333. The transformer is trained with default dropout of 0.1. At inference"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    41,
                    1447,
                    87
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1557,
                    43,
                    1587,
                    79
                ],
                "angle": 0,
                "content": "9"
            },
            {
                "block_id": 3,
                "type": "table",
                "bbox": [
                    134,
                    545,
                    1602,
                    1143
                ],
                "angle": 0,
                "content": "<table><tr><td>Model</td><td colspan=\"2\">GFLOPS/FPS #params</td><td>AP</td><td>\\( AP_{50} \\)</td><td>\\( AP_{75} \\)</td><td>\\( AP_S \\)</td><td>\\( AP_M \\)</td><td>\\( AP_L \\)</td></tr><tr><td>Faster RCNN-DC5</td><td>320/16</td><td>166M</td><td>39.0</td><td>60.5</td><td>42.3</td><td>21.4</td><td>43.5</td><td>52.5</td></tr><tr><td>Faster RCNN-FPN</td><td>180/26</td><td>42M</td><td>40.2</td><td>61.0</td><td>43.8</td><td>24.2</td><td>43.5</td><td>52.0</td></tr><tr><td>Faster RCNN-R101-FPN</td><td>246/20</td><td>60M</td><td>42.0</td><td>62.5</td><td>45.9</td><td>25.2</td><td>45.6</td><td>54.6</td></tr><tr><td>Faster RCNN-DC5+</td><td>320/16</td><td>166M</td><td>41.1</td><td>61.4</td><td>44.3</td><td>22.9</td><td>45.9</td><td>55.0</td></tr><tr><td>Faster RCNN-FPN+</td><td>180/26</td><td>42M</td><td>42.0</td><td>62.1</td><td>45.5</td><td>26.6</td><td>45.4</td><td>53.4</td></tr><tr><td>Faster RCNN-R101-FPN+</td><td>246/20</td><td>60M</td><td>44.0</td><td>63.9</td><td>47.8</td><td>27.2</td><td>48.1</td><td>56.0</td></tr><tr><td>DETR</td><td>86/28</td><td>41M</td><td>42.0</td><td>62.4</td><td>44.2</td><td>20.5</td><td>45.8</td><td>61.1</td></tr><tr><td>DETR-DC5</td><td>187/12</td><td>41M</td><td>43.3</td><td>63.1</td><td>45.9</td><td>22.5</td><td>47.3</td><td>61.1</td></tr><tr><td>DETR-R101</td><td>152/20</td><td>60M</td><td>43.5</td><td>63.8</td><td>46.4</td><td>21.9</td><td>48.0</td><td>61.8</td></tr><tr><td>DETR-DC5-R101</td><td>253/10</td><td>60M</td><td>44.9</td><td>64.7</td><td>47.7</td><td>23.7</td><td>49.5</td><td>62.3</td></tr></table>",
                "caption": "Table 1: Comparison with Faster R-CNN with a ResNet-50 and ResNet-101 backbones on the COCO validation set. The top section shows results for Faster R-CNN models in Detectron2 [50], the middle section shows results for Faster R-CNN models with GIoU [38], random crops train-time augmentation, and the long \\(9\\mathbf{x}\\) training schedule. DETR models achieve comparable results to heavily tuned Faster R-CNN baselines, having lower \\(\\mathrm{AP}_{\\mathrm{S}}\\) but greatly improved \\(\\mathrm{AP}_{\\mathrm{L}}\\). We use torchscript Faster R-CNN and DETR models to measure FLOPS and FPS. Results without R101 in the name correspond to ResNet-50."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    127,
                    1237,
                    1592,
                    1786
                ],
                "angle": 0,
                "content": "time, some slots predict empty class. To optimize for AP, we override the prediction of these slots with the second highest scoring class, using the corresponding confidence. This improves AP by 2 points compared to filtering out empty slots. Other training hyperparameters can be found in section A.4. For our ablation experiments we use training schedule of 300 epochs with a learning rate drop by a factor of 10 after 200 epochs, where a single epoch is a pass over all training images once. Training the baseline model for 300 epochs on 16 V100 GPUs takes 3 days, with 4 images per GPU (hence a total batch size of 64). For the longer schedule used to compare with Faster R-CNN we train for 500 epochs with learning rate drop after 400 epochs. This schedule adds 1.5 AP compared to the shorter schedule."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    131,
                    1855,
                    933,
                    1904
                ],
                "angle": 0,
                "content": "4.1 Comparison with Faster R-CNN"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    127,
                    1935,
                    1593,
                    2437
                ],
                "angle": 0,
                "content": "Transformers are typically trained with Adam or Adagrad optimizers with very long training schedules and dropout, and this is true for DETR as well. Faster R-CNN, however, is trained with SGD with minimal data augmentation and we are not aware of successful applications of Adam or dropout. Despite these differences we attempt to make a Faster R-CNN baseline stronger. To align it with DETR, we add generalized IoU [38] to the box loss, the same random crop augmentation and long training known to improve results [13]. Results are presented in Table 1. In the top section we show Faster R-CNN results from Detectron2 Model Zoo [50] for models trained with the \\(3x\\) schedule. In the middle section we show results (with a “+”) for the same models but trained"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    182,
                    82
                ],
                "angle": 0,
                "content": "10"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 3,
                "type": "table",
                "bbox": [
                    138,
                    317,
                    1585,
                    597
                ],
                "angle": 0,
                "content": "<table><tr><td>#layers</td><td>GFLOPS/FPS</td><td>#params</td><td>AP</td><td>AP50</td><td>APs</td><td>APM</td><td>APL</td></tr><tr><td>0</td><td>76/28</td><td>33.4M</td><td>36.7</td><td>57.4</td><td>16.8</td><td>39.6</td><td>54.2</td></tr><tr><td>3</td><td>81/25</td><td>37.4M</td><td>40.1</td><td>60.6</td><td>18.5</td><td>43.8</td><td>58.6</td></tr><tr><td>6</td><td>86/23</td><td>41.3M</td><td>40.6</td><td>61.6</td><td>19.9</td><td>44.3</td><td>60.2</td></tr><tr><td>12</td><td>95/20</td><td>49.2M</td><td>41.6</td><td>62.1</td><td>19.8</td><td>44.9</td><td>61.9</td></tr></table>",
                "caption": "Table 2: Effect of encoder size. Each row corresponds to a model with varied number of encoder layers and fixed number of decoder layers. Performance gradually improves with more encoder layers."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    136,
                    692,
                    1587,
                    1391
                ],
                "angle": 0,
                "content": "with the \\(9 \\times\\) schedule (109 epochs) and the described enhancements, which in total adds 1-2 AP. In the last section of Table 1 we show the results for multiple DETR models. To be comparable in the number of parameters we choose a model with 6 transformer and 6 decoder layers of width 256 with 8 attention heads. Like Faster R-CNN with FPN this model has 41.3M parameters, out of which 23.5M are in ResNet-50, and 17.8M are in the transformer. Even though both Faster R-CNN and DETR are still likely to further improve with longer training, we can conclude that DETR can be competitive with Faster R-CNN with the same number of parameters, achieving 42 AP on the COCO val subset. The way DETR achieves this is by improving \\(\\mathrm{AP_L}\\) (+7.8), however note that the model is still lagging behind in \\(\\mathrm{AP_S}\\) (-5.5). DETR-DC5 with the same number of parameters and similar FLOP count has higher AP, but is still significantly behind in \\(\\mathrm{AP_S}\\) too. Faster R-CNN and DETR with ResNet-101 backbone show comparable results as well."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    139,
                    1460,
                    458,
                    1512
                ],
                "angle": 0,
                "content": "4.2 Ablations"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    138,
                    1542,
                    1587,
                    1896
                ],
                "angle": 0,
                "content": "Attention mechanisms in the transformer decoder are the key components which model relations between feature representations of different detections. In our ablation analysis, we explore how other components of our architecture and loss influence the final performance. For the study we choose ResNet-50-based DETR model with 6 encoder, 6 decoder layers and width 256. The model has 41.3M parameters, achieves 40.6 and 42.0 AP on short and long schedules respectively, and runs at 28 FPS, similarly to Faster R-CNN-FPN with the same backbone."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    138,
                    1911,
                    1587,
                    2314
                ],
                "angle": 0,
                "content": "Number of encoder layers. We evaluate the importance of global image-level self-attention by changing the number of encoder layers (Table 2). Without encoder layers, overall AP drops by 3.9 points, with a more significant drop of 6.0 AP on large objects. We hypothesize that, by using global scene reasoning, the encoder is important for disentangling objects. In Figure 3, we visualize the attention maps of the last encoder layer of a trained model, focusing on a few points in the image. The encoder seems to separate instances already, which likely simplifies object extraction and localization for the decoder."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    138,
                    2329,
                    1587,
                    2434
                ],
                "angle": 0,
                "content": "Number of decoder layers. We apply auxiliary losses after each decoding layer (see Section 3.2), hence, the prediction FFNs are trained by design to pre"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    41,
                    1450,
                    87
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1542,
                    43,
                    1581,
                    79
                ],
                "angle": 0,
                "content": "11"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    143,
                    140,
                    1580,
                    643
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 3: Encoder self-attention for a set of reference points. The encoder is able to separate individual instances. Predictions are made with baseline DETR model on a validation set image."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    127,
                    922,
                    1590,
                    1671
                ],
                "angle": 0,
                "content": "dict objects out of the outputs of every decoder layer. We analyze the importance of each decoder layer by evaluating the objects that would be predicted at each stage of the decoding (Fig. 4). Both AP and \\(\\mathrm{AP}_{50}\\) improve after every layer, totalling into a very significant \\(+8.2 / 9.5\\) AP improvement between the first and the last layer. With its set-based loss, DETR does not need NMS by design. To verify this we run a standard NMS procedure with default parameters [50] for the outputs after each decoder. NMS improves performance for the predictions from the first decoder. This can be explained by the fact that a single decoding layer of the transformer is not able to compute any cross-correlations between the output elements, and thus it is prone to making multiple predictions for the same object. In the second and subsequent layers, the self-attention mechanism over the activations allows the model to inhibit duplicate predictions. We observe that the improvement brought by NMS diminishes as depth increases. At the last layers, we observe a small loss in AP as NMS incorrectly removes true positive predictions."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    129,
                    1673,
                    1587,
                    1973
                ],
                "angle": 0,
                "content": "Similarly to visualizing encoder attention, we visualize decoder attentions in Fig. 6, coloring attention maps for each predicted object in different colors. We observe that decoder attention is fairly local, meaning that it mostly attends to object extremities such as heads or legs. We hypothesise that after the encoder has separated instances via global attention, the decoder only needs to attend to the extremities to extract the class and object boundaries."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    129,
                    2004,
                    1590,
                    2301
                ],
                "angle": 0,
                "content": "Importance of FFN. FFN inside transformers can be seen as \\(1 \\times 1\\) convolutional layers, making encoder similar to attention augmented convolutional networks [3]. We attempt to remove it completely leaving only attention in the transformer layers. By reducing the number of network parameters from 41.3M to 28.7M, leaving only 10.8M in the transformer, performance drops by 2.3 AP, we thus conclude that FFN are important for achieving good results."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    131,
                    2334,
                    1587,
                    2437
                ],
                "angle": 0,
                "content": "Importance of positional encodings. There are two kinds of positional encodings in our model: spatial positional encodings and output positional encod"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    181,
                    79
                ],
                "angle": 0,
                "content": "12"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    251,
                    130,
                    933,
                    638
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 4: AP and \\(\\mathrm{AP}_{50}\\) performance after each decoder layer. A single long schedule baseline model is evaluated. DETR does not need NMS by design, which is validated by this figure. NMS lowers AP in the final layers, removing TP predictions, but improves AP in the first decoder layers, removing double predictions, as there is no communication in the first layer, and slightly improves \\(\\mathrm{AP}_{50}\\)."
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    1040,
                    189,
                    1555,
                    640
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 5: Out of distribution generalization for rare classes. Even though no image in the training set has more than 13 giraffes, DETR has no difficulty generalizing to 24 and more instances of the same class."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    127,
                    1196,
                    1592,
                    1894
                ],
                "angle": 0,
                "content": "ings (object queries). We experiment with various combinations of fixed and learned encodings, results can be found in table 3. Output positional encodings are required and cannot be removed, so we experiment with either passing them once at decoder input or adding to queries at every decoder attention layer. In the first experiment we completely remove spatial positional encodings and pass output positional encodings at input and, interestingly, the model still achieves more than 32 AP, losing 7.8 AP to the baseline. Then, we pass fixed sine spatial positional encodings and the output encodings at input once, as in the original transformer [47], and find that this leads to 1.4 AP drop compared to passing the positional encodings directly in attention. Learned spatial encodings passed to the attentions give similar results. Surprisingly, we find that not passing any spatial encodings in the encoder only leads to a minor AP drop of 1.3 AP. When we pass the encodings to the attentions, they are shared across all layers, and the output encodings (object queries) are always learned."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    129,
                    1899,
                    1592,
                    2052
                ],
                "angle": 0,
                "content": "Given these ablations, we conclude that transformer components: the global self-attention in encoder, FFN, multiple decoder layers, and positional encodings, all significantly contribute to the final object detection performance."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    129,
                    2083,
                    1597,
                    2437
                ],
                "angle": 0,
                "content": "Loss ablations. To evaluate the importance of different components of the matching cost and the loss, we train several models turning them on and off. There are three components to the loss: classification loss, \\(\\ell_1\\) bounding box distance loss, and GIoU [38] loss. The classification loss is essential for training and cannot be turned off, so we train a model without bounding box distance loss, and a model without the GIoU loss, and compare with baseline, trained with all three losses. Results are presented in table 4. GIoU loss on its own accounts"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    41,
                    1449,
                    87
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1542,
                    43,
                    1587,
                    79
                ],
                "angle": 0,
                "content": "13"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    191,
                    135,
                    1531,
                    766
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 6: Visualizing decoder attention for every predicted object (images from COCOval set). Predictions are made with DETR-DC5 model. Attention scores are coded with different colors for different objects. Decoder typically attends to object extremities, such as legs and heads. Best viewed in color."
            },
            {
                "block_id": 5,
                "type": "table",
                "bbox": [
                    136,
                    1368,
                    1588,
                    1745
                ],
                "angle": 0,
                "content": "<table><tr><td>spatial pos. enc. encoder</td><td>encoder decoder</td><td>output pos. enc. decoder</td><td>AP</td><td>Δ</td><td>AP50</td><td>Δ</td></tr><tr><td>none</td><td>none</td><td>learned at input</td><td>32.8</td><td>-7.8</td><td>55.2</td><td>-6.5</td></tr><tr><td>sine at input</td><td>sine at input</td><td>learned at input</td><td>39.2</td><td>-1.4</td><td>60.0</td><td>-1.6</td></tr><tr><td>learned at attn.</td><td>learned at attn.</td><td>learned at attn.</td><td>39.6</td><td>-1.0</td><td>60.7</td><td>-0.9</td></tr><tr><td>none</td><td>sine at attn.</td><td>learned at attn.</td><td>39.3</td><td>-1.3</td><td>60.3</td><td>-1.4</td></tr><tr><td>sine at attn.</td><td>sine at attn.</td><td>learned at attn.</td><td>40.6</td><td>-</td><td>61.6</td><td>-</td></tr></table>",
                "caption": "Table 4: Effect of loss components on AP. We train two models turning off \\(\\ell_1\\) loss, and GIoU loss, and observe that \\(\\ell_1\\) gives poor results on its own, but when combined with GIoU improves \\(\\mathrm{AP_M}\\) and \\(\\mathrm{AP_L}\\). Our baseline (last row) combines both losses."
            },
            {
                "block_id": 7,
                "type": "table",
                "bbox": [
                    160,
                    1983,
                    1550,
                    2216
                ],
                "angle": 0,
                "content": "<table><tr><td>class</td><td>l1</td><td>G IoU</td><td>AP</td><td>Δ</td><td>AP50</td><td>Δ</td><td>APs</td><td>APM</td><td>APL</td></tr><tr><td>✓</td><td>✓</td><td></td><td>35.8</td><td>-4.8</td><td>57.3</td><td>-4.4</td><td>13.7</td><td>39.8</td><td>57.9</td></tr><tr><td>✓</td><td></td><td>✓</td><td>39.9</td><td>-0.7</td><td>61.6</td><td>0</td><td>19.9</td><td>43.2</td><td>57.9</td></tr><tr><td>✓</td><td>✓</td><td>✓</td><td>40.6</td><td>-</td><td>61.6</td><td>-</td><td>19.9</td><td>44.3</td><td>60.2</td></tr></table>"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    129,
                    2332,
                    1593,
                    2437
                ],
                "angle": 0,
                "content": "for most of the model performance, losing only 0.7 AP to the baseline with combined losses. Using \\(\\ell_1\\) without GIoU shows poor results. We only studied"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    181,
                    79
                ],
                "angle": 0,
                "content": "14"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    144,
                    140,
                    1583,
                    417
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 7: Visualization of all box predictions on all images from COCO 2017 val set for 20 out of total \\( N = 100 \\) prediction slots in DETR decoder. Each box prediction is represented as a point with the coordinates of its center in the 1-by-1 square normalized by each image size. The points are color-coded so that green color corresponds to small boxes, red to large horizontal boxes and blue to large vertical boxes. We observe that each slot learns to specialize on certain areas and box sizes with several operating modes. We note that almost all slots have a mode of predicting large image-wide boxes that are common in COCO dataset."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    129,
                    930,
                    1587,
                    1032
                ],
                "angle": 0,
                "content": "simple ablations of different losses (using the same weighting every time), but other means of combining them may achieve different results."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    131,
                    1112,
                    431,
                    1163
                ],
                "angle": 0,
                "content": "4.3 Analysis"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    127,
                    1202,
                    1592,
                    1553
                ],
                "angle": 0,
                "content": "Decoder output slot analysis In Fig. 7 we visualize the boxes predicted by different slots for all images in COCO 2017 val set. DETR learns different specialization for each query slot. We observe that each slot has several modes of operation focusing on different areas and box sizes. In particular, all slots have the mode for predicting image-wide boxes (visible as the red dots aligned in the middle of the plot). We hypothesize that this is related to the distribution of objects in COCO."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    129,
                    1578,
                    1593,
                    1929
                ],
                "angle": 0,
                "content": "Generalization to unseen numbers of instances. Some classes in COCO are not well represented with many instances of the same class in the same image. For example, there is no image with more than 13 giraffes in the training set. We create a synthetic image<sup>3</sup> to verify the generalization ability of DETR (see Figure 5). Our model is able to find all 24 giraffes on the image which is clearly out of distribution. This experiment confirms that there is no strong class-specialization in each object query."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    131,
                    2009,
                    953,
                    2058
                ],
                "angle": 0,
                "content": "4.4 DETR for panoptic segmentation"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    129,
                    2096,
                    1592,
                    2352
                ],
                "angle": 0,
                "content": "Panoptic segmentation [19] has recently attracted a lot of attention from the computer vision community. Similarly to the extension of Faster R-CNN [37] to Mask R-CNN [14], DETR can be naturally extended by adding a mask head on top of the decoder outputs. In this section we demonstrate that such a head can be used to produce panoptic segmentation [19] by treating stuff and thing classes"
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    141,
                    2381,
                    1476,
                    2434
                ],
                "angle": 0,
                "content": "<sup>3</sup> Base picture credit: https://www.piqsels.com/en/public-domain-photo-jzlwu"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    41,
                    1450,
                    87
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1542,
                    43,
                    1587,
                    79
                ],
                "angle": 0,
                "content": "15"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    138,
                    133,
                    1593,
                    589
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 8: Illustration of the panoptic head. A binary mask is generated in parallel for each detected object, then the masks are merged using pixel-wise argmax."
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    143,
                    794,
                    740,
                    1199
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 5,
                "type": "image",
                "bbox": [
                    743,
                    794,
                    1273,
                    1194
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 6,
                "type": "image",
                "bbox": [
                    1276,
                    794,
                    1578,
                    1194
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 9: Qualitative results for panoptic segmentation generated by DETR-R101. DETR produces aligned mask predictions in a unified manner for things and stuff."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    131,
                    1453,
                    1587,
                    1555
                ],
                "angle": 0,
                "content": "in a unified way. We perform our experiments on the panoptic annotations of the COCO dataset that has 53 stuff categories in addition to 80 things categories."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    129,
                    1568,
                    1590,
                    2168
                ],
                "angle": 0,
                "content": "We train DETR to predict boxes around both stuff and things classes on COCO, using the same recipe. Predicting boxes is required for the training to be possible, since the Hungarian matching is computed using distances between boxes. We also add a mask head which predicts a binary mask for each of the predicted boxes, see Figure 8. It takes as input the output of transformer decoder for each object and computes multi-head (with \\( M \\) heads) attention scores of this embedding over the output of the encoder, generating \\( M \\) attention heatmaps per object in a small resolution. To make the final prediction and increase the resolution, an FPN-like architecture is used. We describe the architecture in more details in the supplement. The final resolution of the masks has stride 4 and each mask is supervised independently using the DICE/F-1 loss [28] and Focal loss [23]."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    129,
                    2183,
                    1590,
                    2434
                ],
                "angle": 0,
                "content": "The mask head can be trained either jointly, or in a two steps process, where we train DETR for boxes only, then freeze all the weights and train only the mask head for 25 epochs. Experimentally, these two approaches give similar results, we report results using the latter method since it results in a shorter total wall-clock time training."
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    182,
                    82
                ],
                "angle": 0,
                "content": "16"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 3,
                "type": "table",
                "bbox": [
                    146,
                    363,
                    1574,
                    740
                ],
                "angle": 0,
                "content": "<table><tr><td>Model</td><td>Backbone</td><td>PQ</td><td>SQ</td><td>RQ</td><td>\\( PQ^{th} \\)</td><td>\\( SQ^{th} \\)</td><td>\\( RQ^{th} \\)</td><td>\\( PQ^{st} \\)</td><td>\\( SQ^{st} \\)</td><td>\\( RQ^{st} \\)</td><td>AP</td></tr><tr><td>PanopticFPN++</td><td>R50</td><td>42.4</td><td>79.3</td><td>51.6</td><td>49.2</td><td>82.4</td><td>58.8</td><td>32.3</td><td>74.8</td><td>40.6</td><td>37.7</td></tr><tr><td>UPSnet</td><td>R50</td><td>42.5</td><td>78.0</td><td>52.5</td><td>48.6</td><td>79.4</td><td>59.6</td><td>33.4</td><td>75.9</td><td>41.7</td><td>34.3</td></tr><tr><td>UPSnet-M</td><td>R50</td><td>43.0</td><td>79.1</td><td>52.8</td><td>48.9</td><td>79.7</td><td>59.7</td><td>34.1</td><td>78.2</td><td>42.3</td><td>34.3</td></tr><tr><td>PanopticFPN++</td><td>R101</td><td>44.1</td><td>79.5</td><td>53.3</td><td>51.0</td><td>83.2</td><td>60.6</td><td>33.6</td><td>74.0</td><td>42.1</td><td>39.7</td></tr><tr><td>DETR</td><td>R50</td><td>43.4</td><td>79.3</td><td>53.8</td><td>48.2</td><td>79.8</td><td>59.5</td><td>36.3</td><td>78.5</td><td>45.3</td><td>31.1</td></tr><tr><td>DETR-DC5</td><td>R50</td><td>44.6</td><td>79.8</td><td>55.0</td><td>49.4</td><td>80.5</td><td>60.6</td><td>37.3</td><td>78.7</td><td>46.5</td><td>31.9</td></tr><tr><td>DETR-R101</td><td>R101</td><td>45.1</td><td>79.9</td><td>55.5</td><td>50.5</td><td>80.9</td><td>61.7</td><td>37.0</td><td>78.5</td><td>46.0</td><td>33.0</td></tr></table>",
                "caption": "Table 5: Comparison with the state-of-the-art methods UPSNet [51] and Panoptic FPN [18] on the COCO val dataset We retrained PanopticFPN with the same data-augmentation as DETR, on a 18x schedule for fair comparison. UPSNet uses the 1x schedule, UPSNet-M is the version with multiscale test-time augmentations."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    136,
                    871,
                    1587,
                    1122
                ],
                "angle": 0,
                "content": "To predict the final panoptic segmentation we simply use an argmax over the mask scores at each pixel, and assign the corresponding categories to the resulting masks. This procedure guarantees that the final masks have no overlaps and, therefore, DETR does not require a heuristic [19] that is often used to align different masks."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    136,
                    1225,
                    1587,
                    1578
                ],
                "angle": 0,
                "content": "Training details. We train DETR, DETR-DC5 and DETR-R101 models following the recipe for bounding box detection to predict boxes around stuff and things classes in COCO dataset. The new mask head is trained for 25 epochs (see supplementary for details). During inference we first filter out the detection with a confidence below \\(85\\%\\), then compute the per-pixel argmax to determine in which mask each pixel belongs. We then collapse different mask predictions of the same stuff category in one, and filter the empty ones (less than 4 pixels)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    136,
                    1681,
                    1587,
                    2432
                ],
                "angle": 0,
                "content": "Main results. Qualitative results are shown in Figure 9. In table 5 we compare our unified panoptic segmentation approach with several established methods that treat things and stuff differently. We report the Panoptic Quality (PQ) and the break-down on things \\((\\mathrm{PQ}^{\\mathrm{th}})\\) and stuff \\((\\mathrm{PQ}^{\\mathrm{st}})\\). We also report the mask AP (computed on the things classes), before any panoptic post-treatment (in our case, before taking the pixel-wise argmax). We show that DETR outperforms published results on COCO-val 2017, as well as our strong PanopticFPN baseline (trained with same data-augmentation as DETR, for fair comparison). The result break-down shows that DETR is especially dominant on stuff classes, and we hypothesize that the global reasoning allowed by the encoder attention is the key element to this result. For things class, despite a severe deficit of up to \\(8\\mathrm{mAP}\\) compared to the baselines on the mask AP computation, DETR obtains competitive \\(\\mathrm{PQ}^{\\mathrm{th}}\\). We also evaluated our method on the test set of the COCO dataset, and obtained \\(46\\mathrm{PQ}\\). We hope that our approach will inspire the exploration of fully unified models for panoptic segmentation in future work."
            }
        ]
    },
    {
        "page_id": 16,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    41,
                    1449,
                    82
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1542,
                    43,
                    1587,
                    79
                ],
                "angle": 0,
                "content": "17"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    134,
                    138,
                    498,
                    192
                ],
                "angle": 0,
                "content": "5 Conclusion"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    129,
                    240,
                    1592,
                    635
                ],
                "angle": 0,
                "content": "We presented DETR, a new design for object detection systems based on transformers and bipartite matching loss for direct set prediction. The approach achieves comparable results to an optimized Faster R-CNN baseline on the challenging COCO dataset. DETR is straightforward to implement and has a flexible architecture that is easily extensible to panoptic segmentation, with competitive results. In addition, it achieves significantly better performance on large objects than Faster R-CNN, likely thanks to the processing of global information performed by the self-attention."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    129,
                    640,
                    1592,
                    843
                ],
                "angle": 0,
                "content": "This new design for detectors also comes with new challenges, in particular regarding training, optimization and performances on small objects. Current detectors required several years of improvements to cope with similar issues, and we expect future work to successfully address them for DETR."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    131,
                    914,
                    698,
                    971
                ],
                "angle": 0,
                "content": "6 Acknowledgements"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    129,
                    1014,
                    1592,
                    1217
                ],
                "angle": 0,
                "content": "We thank Sainbayar Sukhbaatar, Piotr Bojanowski, Natalia Neverova, David Lopez-Paz, Guillaume Lample, Danielle Rothermel, Kaiming He, Ross Girshick, Xinlei Chen and the whole Facebook AI Research Paris team for discussions and advices without which this work would not be possible."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    134,
                    1289,
                    410,
                    1345
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    153,
                    1386,
                    1587,
                    1522
                ],
                "angle": 0,
                "content": "1. Al-Rfou, R., Choe, D., Constant, N., Guo, M., Jones, L.: Character-level language modeling with deeper self-attention. In: AAAI Conference on Artificial Intelligence (2019)"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    151,
                    1527,
                    1588,
                    1617
                ],
                "angle": 0,
                "content": "2. Bahdanau, D., Cho, K., Bengio, Y.: Neural machine translation by jointly learning to align and translate. In: ICLR (2015)"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    153,
                    1619,
                    1583,
                    1704
                ],
                "angle": 0,
                "content": "3. Bello, I., Zoph, B., Vaswani, A., Shlens, J., Le, Q.V.: Attention augmented convolutional networks. In: ICCV (2019)"
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    153,
                    1706,
                    1583,
                    1796
                ],
                "angle": 0,
                "content": "4. Bodla, N., Singh, B., Chellappa, R., Davis, L.S.: Soft-NMS improving object detection with one line of code. In: ICCV (2017)"
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    155,
                    1799,
                    1583,
                    1886
                ],
                "angle": 0,
                "content": "5. Cai, Z., Vasconcelos, N.: Cascade R-CNN: High quality object detection and instance segmentation. PAMI (2019)"
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    155,
                    1888,
                    1583,
                    1978
                ],
                "angle": 0,
                "content": "6. Chan, W., Saharia, C., Hinton, G., Norouzi, M., Jaitly, N.: Imputer: Sequence modelling via imputation and dynamic programming. arXiv:2002.08926 (2020)"
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    156,
                    1981,
                    1583,
                    2068
                ],
                "angle": 0,
                "content": "7. Cordonnier, J.B., Loukas, A., Jaggi, M.: On the relationship between self-attention and convolutional layers. In: ICLR (2020)"
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    155,
                    2070,
                    1583,
                    2158
                ],
                "angle": 0,
                "content": "8. Devlin, J., Chang, M.W., Lee, K., Toutanova, K.: BERT: Pre-training of deep bidirectional transformers for language understanding. In: NAACL-HLT (2019)"
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    155,
                    2163,
                    1583,
                    2250
                ],
                "angle": 0,
                "content": "9. Erhan, D., Szegedy, C., Toshev, A., Anguelov, D.: Scalable object detection using deep neural networks. In: CVPR (2014)"
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    139,
                    2252,
                    1583,
                    2340
                ],
                "angle": 0,
                "content": "10. Ghazvininejad, M., Levy, O., Liu, Y., Zettlemoyer, L.: Mask-predict: Parallel decoding of conditional masked language models. arXiv:1904.09324 (2019)"
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    139,
                    2342,
                    1583,
                    2432
                ],
                "angle": 0,
                "content": "11. Glorot, X., Bengio, Y.: Understanding the difficulty of training deep feedforward neural networks. In: AISTATS (2010)"
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    139,
                    1386,
                    1588,
                    2432
                ],
                "angle": 0,
                "content": null
            }
        ]
    },
    {
        "page_id": 17,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    181,
                    79
                ],
                "angle": 0,
                "content": "18"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    496,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    138,
                    148,
                    1583,
                    238
                ],
                "angle": 0,
                "content": "12. Gu, J., Bradbury, J., Xiong, C., Li, V.O., Socher, R.: Non-autoregressive neural machine translation. In: ICLR (2018)"
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    138,
                    238,
                    1583,
                    284
                ],
                "angle": 0,
                "content": "13. He, K., Girshick, R., Dollar, P.: Rethinking imagenet pre-training. In: ICCV (2019)"
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    138,
                    284,
                    1555,
                    325
                ],
                "angle": 0,
                "content": "14. He, K., Gkioxari, G., Dollar, P., Girshick, R.B.: Mask R-CNN. In: ICCV (2017)"
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    138,
                    328,
                    1581,
                    415
                ],
                "angle": 0,
                "content": "15. He, K., Zhang, X., Ren, S., Sun, J.: Deep residual learning for image recognition. In: CVPR (2016)"
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    138,
                    415,
                    1583,
                    507
                ],
                "angle": 0,
                "content": "16. Hosang, J.H., Benenson, R., Schiele, B.: Learning non-maximum suppression. In: CVPR (2017)"
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    138,
                    507,
                    1583,
                    594
                ],
                "angle": 0,
                "content": "17. Hu, H., Gu, J., Zhang, Z., Dai, J., Wei, Y.: Relation networks for object detection. In: CVPR (2018)"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    138,
                    594,
                    1583,
                    684
                ],
                "angle": 0,
                "content": "18. Kirillov, A., Girshick, R., He, K., Dollar, P.: Panoptic feature pyramid networks. In: CVPR (2019)"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    138,
                    684,
                    1583,
                    774
                ],
                "angle": 0,
                "content": "19. Kirillov, A., He, K., Girshick, R., Rother, C., Dollar, P.: Panoptic segmentation. In: CVPR (2019)"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    138,
                    774,
                    1421,
                    817
                ],
                "angle": 0,
                "content": "20. Kuhn, H.W.: The hungarian method for the assignment problem (1955)"
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    138,
                    817,
                    1583,
                    907
                ],
                "angle": 0,
                "content": "21. Li, Y., Qi, H., Dai, J., Ji, X., Wei, Y.: Fully convolutional instance-aware semantic segmentation. In: CVPR (2017)"
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    138,
                    907,
                    1583,
                    997
                ],
                "angle": 0,
                "content": "22. Lin, T.Y., Dollar, P., Girshick, R., He, K., Hariharan, B., Belongie, S.: Feature pyramid networks for object detection. In: CVPR (2017)"
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    138,
                    997,
                    1583,
                    1084
                ],
                "angle": 0,
                "content": "23. Lin, T.Y., Goyal, P., Girshick, R.B., He, K., Dollár, P.: Focal loss for dense object detection. In: ICCV (2017)"
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    138,
                    1084,
                    1583,
                    1176
                ],
                "angle": 0,
                "content": "24. Lin, T.Y., Maire, M., Belongie, S., Hays, J., Perona, P., Ramanan, D., Dollár, P., Zitnick, C.L.: Microsoft COCO: Common objects in context. In: ECCV (2014)"
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    138,
                    1176,
                    1583,
                    1263
                ],
                "angle": 0,
                "content": "25. Liu, W., Anguelov, D., Erhan, D., Szegedy, C., Reed, S.E., Fu, C.Y., Berg, A.C.: Ssd: Single shot multibox detector. In: ECCV (2016)"
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    138,
                    1263,
                    1583,
                    1309
                ],
                "angle": 0,
                "content": "26. Loshchilov, I., Hutter, F.: Decoupled weight decay regularization. In: ICLR (2017)"
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    138,
                    1309,
                    1583,
                    1442
                ],
                "angle": 0,
                "content": "27. Luscher, C., Beck, E., Irie, K., Kitza, M., Michel, W., Zeyer, A., Schlüter, R., Ney, H.: Rwth asr systems for librispeech: Hybrid vs attention - w/o data augmentation. arXiv:1905.03072 (2019)"
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    138,
                    1442,
                    1583,
                    1532
                ],
                "angle": 0,
                "content": "28. Miletari, F., Navab, N., Ahmadi, S.A.: V-net: Fully convolutional neural networks for volumetric medical image segmentation. In: 3DV (2016)"
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    138,
                    1532,
                    1583,
                    1668
                ],
                "angle": 0,
                "content": "29. Oord, A.v.d., Li, Y., Babuschkin, I., Simonyan, K., Vinyals, O., Kavukcuoglu, K., Driessche, G.v.d., Lockhart, E., Cobo, L.C., Stimberg, F., et al.: Parallel wavenet: Fast high-fidelity speech synthesis. arXiv:1711.10433 (2017)"
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    138,
                    1668,
                    1583,
                    1758
                ],
                "angle": 0,
                "content": "30. Park, E., Berg, A.C.: Learning to decompose for object detection and instance segmentation. arXiv:1511.06449 (2015)"
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    138,
                    1758,
                    1583,
                    1845
                ],
                "angle": 0,
                "content": "31. Parmar, N., Vaswani, A., Uszkoreit, J., Kaiser, L., Shazeer, N., Ku, A., Tran, D.: Image transformer. In: ICML (2018)"
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    138,
                    1845,
                    1583,
                    2070
                ],
                "angle": 0,
                "content": "32. Paszke, A., Gross, S., Massa, F., Lerer, A., Bradbury, J., Chanan, G., Killeen, T., Lin, Z., Gimelshein, N., Antiga, L., Desmaison, A., Kopf, A., Yang, E., DeVito, Z., Raison, M., Tejani, A., Chilamkurthy, S., Steiner, B., Fang, L., Bai, J., Chintala, S.: Pytorch: An imperative style, high-performance deep learning library. In: NeurIPS (2019)"
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    138,
                    2070,
                    1583,
                    2163
                ],
                "angle": 0,
                "content": "33. Pineda, L., Salvador, A., Drozdzal, M., Romero, A.: Elucidating image-to-set prediction: An analysis of models, losses and datasets. arXiv:1904.05709 (2019)"
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    138,
                    2163,
                    1583,
                    2252
                ],
                "angle": 0,
                "content": "34. Radford, A., Wu, J., Child, R., Luan, D., Amodei, D., Sutskever, I.: Language models are unsupervised multitask learners (2019)"
            },
            {
                "block_id": 25,
                "type": "ref_text",
                "bbox": [
                    138,
                    2252,
                    1583,
                    2342
                ],
                "angle": 0,
                "content": "35. Redmon, J., Divvala, S., Girshick, R., Farhadi, A.: You only look once: Unified, real-time object detection. In: CVPR (2016)"
            },
            {
                "block_id": 26,
                "type": "ref_text",
                "bbox": [
                    138,
                    2342,
                    1583,
                    2432
                ],
                "angle": 0,
                "content": "36. Ren, M., Zemel, R.S.: End-to-end instance segmentation with recurrent attention. In: CVPR (2017)"
            },
            {
                "block_id": 27,
                "type": "list",
                "bbox": [
                    138,
                    148,
                    1583,
                    2432
                ],
                "angle": 0,
                "content": null
            }
        ]
    },
    {
        "page_id": 18,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    617,
                    41,
                    1452,
                    82
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1542,
                    43,
                    1587,
                    79
                ],
                "angle": 0,
                "content": "19"
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    132,
                    146,
                    1587,
                    238
                ],
                "angle": 0,
                "content": "37. Ren, S., He, K., Girshick, R.B., Sun, J.: Faster R-CNN: Towards real-time object detection with region proposal networks. PAMI (2015)"
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    132,
                    240,
                    1587,
                    330
                ],
                "angle": 0,
                "content": "38. Rezatofighi, H., Tsoi, N., Gwak, J., Sadeghian, A., Reid, I., Savarese, S.: Generalized intersection over union. In: CVPR (2019)"
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    134,
                    333,
                    1588,
                    466
                ],
                "angle": 0,
                "content": "39. Rezatofighi, S.H., Kaskman, R., Motlagh, F.T., Shi, Q., Cremers, D., Leal-Taixe, L., Reid, I.: Deep perm-set net: Learn to predict sets with unknown permutation and cardinality using deep neural networks. arXiv:1805.00613 (2018)"
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    134,
                    469,
                    1587,
                    604
                ],
                "angle": 0,
                "content": "40. Rezatofighi, S.H., Milan, A., Abbasnejad, E., Dick, A., Reid, I., Kaskman, R., Cremers, D., Leal-Taix, l.: Deepset: Predicting sets with deep neural networks. In: ICCV (2017)"
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    134,
                    607,
                    1587,
                    694
                ],
                "angle": 0,
                "content": "41. Romera-Paredes, B., Torr, P.H.S.: Recurrent instance segmentation. In: ECCV (2015)"
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    134,
                    697,
                    1587,
                    786
                ],
                "angle": 0,
                "content": "42. Salvador, A., Bellver, M., Baradad, M., Marqués, F., Torres, J., Giro, X.: Recurrent neural networks for semantic instance segmentation. arXiv:1712.00617 (2017)"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    134,
                    789,
                    1587,
                    876
                ],
                "angle": 0,
                "content": "43. Stewart, R.J., Andriluka, M., Ng, A.Y.: End-to-end people detection in crowded scenes. In: CVPR (2015)"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    134,
                    879,
                    1587,
                    968
                ],
                "angle": 0,
                "content": "44. Sutskever, I., Vinyals, O., Le, Q.V.: Sequence to sequence learning with neural networks. In: NeurIPS (2014)"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    134,
                    971,
                    1587,
                    1107
                ],
                "angle": 0,
                "content": "45. Synnaeve, G., Xu, Q., Kahn, J., Grave, E., Likhomanenko, T., Pratap, V., Sriram, A., Liptchinsky, V., Collobert, R.: End-to-end ASR: from supervised to semi-supervised learning with modern architectures. arXiv:1911.08460 (2019)"
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    134,
                    1109,
                    1587,
                    1196
                ],
                "angle": 0,
                "content": "46. Tian, Z., Shen, C., Chen, H., He, T.: FCOS: Fully convolutional one-stage object detection. In: ICCV (2019)"
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    134,
                    1199,
                    1587,
                    1289
                ],
                "angle": 0,
                "content": "47. Vaswani, A., Shazeer, N., Parmar, N., Uszkoreit, J., Jones, L., Gomez, A.N., Kaiser, L., Polosukhin, I.: Attention is all you need. In: NeurIPS (2017)"
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    134,
                    1291,
                    1587,
                    1381
                ],
                "angle": 0,
                "content": "48. Vinyals, O., Bengio, S., Kudlur, M.: Order matters: Sequence to sequence for sets. In: ICLR (2016)"
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    134,
                    1381,
                    1587,
                    1471
                ],
                "angle": 0,
                "content": "49. Wang, X., Girshick, R.B., Gupta, A., He, K.: Non-local neural networks. In: CVPR (2018)"
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    134,
                    1473,
                    1587,
                    1563
                ],
                "angle": 0,
                "content": "50. Wu, Y., Kirillov, A., Massa, F., Lo, W.Y., Girshick, R.: Detector2. https://github.com/facebookresearch/detectron2 (2019)"
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    134,
                    1565,
                    1587,
                    1655
                ],
                "angle": 0,
                "content": "51. Xiong, Y., Liao, R., Zhao, H., Hu, R., Bai, M., Yumer, E., Urtasun, R.: Upsnet: A unified panoptic segmentation network. In: CVPR (2019)"
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    134,
                    1658,
                    1587,
                    1791
                ],
                "angle": 0,
                "content": "52. Zhang, S., Chi, C., Yao, Y., Lei, Z., Li, S.Z.: Bridging the gap between anchor-based and anchor-free detection via adaptive training sample selection. arXiv:1912.02424 (2019)"
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    134,
                    1794,
                    1569,
                    1840
                ],
                "angle": 0,
                "content": "53. Zhou, X., Wang, D., Krähenbuhl, P.: Objects as points. arXiv:1904.07850 (2019)"
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    132,
                    146,
                    1588,
                    1840
                ],
                "angle": 0,
                "content": null
            }
        ]
    },
    {
        "page_id": 19,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    136,
                    43,
                    182,
                    82
                ],
                "angle": 0,
                "content": "20"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    134,
                    138,
                    484,
                    197
                ],
                "angle": 0,
                "content": "A Appendix"
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    134,
                    238,
                    1145,
                    289
                ],
                "angle": 0,
                "content": "A.1 Preliminaries: Multi-head attention layers"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    131,
                    315,
                    1588,
                    520
                ],
                "angle": 0,
                "content": "Since our model is based on the Transformer architecture, we remind here the general form of attention mechanisms we use for exhaustivity. The attention mechanism follows [47], except for the details of positional encodings (see Equation 8) that follows [7]."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    131,
                    535,
                    1588,
                    684
                ],
                "angle": 0,
                "content": "Multi-head The general form of multi-head attention with \\( M \\) heads of dimension \\( d \\) is a function with the following signature (using \\( d' = \\frac{d}{M} \\), and giving matrix/tensors sizes in underbrace)"
            },
            {
                "block_id": 6,
                "type": "equation",
                "bbox": [
                    438,
                    709,
                    1585,
                    843
                ],
                "angle": 0,
                "content": "\\[\n\\mathrm {m h - a t t n}: \\underbrace {X _ {\\mathrm {q}}} _ {d \\times N _ {\\mathrm {q}}}, \\underbrace {X _ {\\mathrm {k v}}} _ {d \\times N _ {\\mathrm {k v}}}, \\underbrace {T} _ {M \\times 3 \\times d ^ {\\prime} \\times d}, \\underbrace {L} _ {d \\times d} \\mapsto \\underbrace {\\tilde {X} _ {\\mathrm {q}}} _ {d \\times N _ {\\mathrm {q}}} \\tag {3}\n\\]"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    129,
                    868,
                    1588,
                    1171
                ],
                "angle": 0,
                "content": "where \\( X_{\\mathrm{q}} \\) is the query sequence of length \\( N_{\\mathrm{q}} \\), \\( X_{\\mathrm{kv}} \\) is the key-value sequence of length \\( N_{\\mathrm{kv}} \\) (with the same number of channels \\( d \\) for simplicity of exposition), \\( T \\) is the weight tensor to compute the so-called query, key and value embeddings, and \\( L \\) is a projection matrix. The output is the same size as the query sequence. To fix the vocabulary before giving details, multi-head self-attention (mh-s-attn) is the special case \\( X_{\\mathrm{q}} = X_{\\mathrm{kv}} \\), i.e."
            },
            {
                "block_id": 8,
                "type": "equation",
                "bbox": [
                    464,
                    1199,
                    1585,
                    1255
                ],
                "angle": 0,
                "content": "\\[\n\\operatorname {m h - s - a t t n} (X, T, L) = \\operatorname {m h - a t t n} (X, X, T, L). \\tag {4}\n\\]"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    131,
                    1286,
                    1587,
                    1491
                ],
                "angle": 0,
                "content": "The multi-head attention is simply the concatenation of \\( M \\) single attention heads followed by a projection with \\( L \\). The common practice [47] is to use residual connections, dropout and layer normalization. In other words, denoting \\( \\tilde{X}_{\\mathrm{q}} = \\mathrm{mh - attn}(X_{\\mathrm{q}}, X_{\\mathrm{kv}}, T, L) \\) and \\( \\bar{\\tilde{X}}^{(q)} \\) the concatenation of attention heads, we have"
            },
            {
                "block_id": 10,
                "type": "equation",
                "bbox": [
                    427,
                    1522,
                    1583,
                    1581
                ],
                "angle": 0,
                "content": "\\[\nX _ {\\mathrm {q}} ^ {\\prime} = \\left[ \\operatorname {a t t n} \\left(X _ {\\mathrm {q}}, X _ {\\mathrm {k v}}, T _ {1}\\right); \\dots ; \\operatorname {a t t n} \\left(X _ {\\mathrm {q}}, X _ {\\mathrm {k v}}, T _ {M}\\right) \\right] \\tag {5}\n\\]"
            },
            {
                "block_id": 11,
                "type": "equation",
                "bbox": [
                    427,
                    1589,
                    1583,
                    1653
                ],
                "angle": 0,
                "content": "\\[\n\\tilde {X} _ {\\mathrm {q}} = \\operatorname {l a y e r n o r m} \\left(X _ {\\mathrm {q}} + \\operatorname {d r o p o u t} \\left(L X _ {\\mathrm {q}} ^ {\\prime}\\right)\\right), \\tag {6}\n\\]"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    131,
                    1681,
                    1088,
                    1732
                ],
                "angle": 0,
                "content": "where \\([\\cdot ]\\) denotes concatenation on the channel axis."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    131,
                    1747,
                    1587,
                    1953
                ],
                "angle": 0,
                "content": "Single head An attention head with weight tensor \\( T' \\in \\mathbb{R}^{3 \\times d' \\times d} \\), denoted by \\( \\mathrm{att}(X_{\\mathrm{q}}, X_{\\mathrm{kv}}, T') \\), depends on additional positional encoding \\( P_{\\mathrm{q}} \\in \\mathbb{R}^{d \\times N_{\\mathrm{q}}} \\) and \\( P_{\\mathrm{kv}} \\in \\mathbb{R}^{d \\times N_{\\mathrm{kv}}} \\). It starts by computing so-called query, key and value embeddings after adding the query and key positional encodings [7]:"
            },
            {
                "block_id": 14,
                "type": "equation",
                "bbox": [
                    412,
                    1978,
                    1585,
                    2042
                ],
                "angle": 0,
                "content": "\\[\n[ Q; K; V ] = [ T _ {1} ^ {\\prime} (X _ {\\mathrm {q}} + P _ {\\mathrm {q}}); T _ {2} ^ {\\prime} (X _ {\\mathrm {k v}} + P _ {\\mathrm {k v}}); T _ {3} ^ {\\prime} X _ {\\mathrm {k v}} ] \\tag {7}\n\\]"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    129,
                    2068,
                    1587,
                    2270
                ],
                "angle": 0,
                "content": "where \\( T' \\) is the concatenation of \\( T_1', T_2', T_3' \\). The attention weights \\( \\alpha \\) are then computed based on the softmax of dot products between queries and keys, so that each element of the query sequence attends to all elements of the key-value sequence (\\( i \\) is a query index and \\( j \\) a key-value index):"
            },
            {
                "block_id": 16,
                "type": "equation",
                "bbox": [
                    445,
                    2296,
                    1585,
                    2442
                ],
                "angle": 0,
                "content": "\\[\n\\alpha_ {i, j} = \\frac {e ^ {\\frac {1}{\\sqrt {d ^ {\\prime}}}} Q _ {i} ^ {T} K _ {j}}{Z _ {i}} \\quad \\mathrm {w h e r e} Z _ {i} = \\sum_ {j = 1} ^ {N _ {\\mathrm {k v}}} e ^ {\\frac {1}{\\sqrt {d ^ {\\prime}}}} Q _ {i} ^ {T} K _ {j}. \\tag {8}\n\\]"
            }
        ]
    },
    {
        "page_id": 20,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    617,
                    38,
                    1449,
                    82
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1540,
                    43,
                    1581,
                    79
                ],
                "angle": 0,
                "content": "21"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    129,
                    143,
                    1588,
                    453
                ],
                "angle": 0,
                "content": "In our case, the positional encodings may be learnt or fixed, but are shared across all attention layers for a given query/key-value sequence, so we do not explicitly write them as parameters of the attention. We give more details on their exact value when describing the encoder and the decoder. The final output is the aggregation of values weighted by attention weights: The \\(i\\)-th row is given by \\(\\mathrm{attn}_i(X_{\\mathrm{q}},X_{\\mathrm{kv}},T') = \\sum_{j=1}^{N_{\\mathrm{kv}}}\\alpha_{i,j}V_j\\)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    129,
                    461,
                    1588,
                    763
                ],
                "angle": 0,
                "content": "Feed-forward network (FFN) layers The original transformer alternates multi-head attention and so-called FFN layers [47], which are effectively multi-layer 1x1 convolutions, which have \\(Md\\) input and output channels in our case. The FFN we consider is composed of two-layers of 1x1 convolutions with ReLU activations. There is also a residual connection/dropout/layernorm after the two layers, similarly to equation 6."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    132,
                    835,
                    398,
                    886
                ],
                "angle": 0,
                "content": "A.2 Losses"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    129,
                    914,
                    1587,
                    1219
                ],
                "angle": 0,
                "content": "For completeness, we present in detail the losses used in our approach. All losses are normalized by the number of objects inside the batch. Extra care must be taken for distributed training: since each GPU receives a sub-batch, it is not sufficient to normalize by the number of objects in the local batch, since in general the sub-batches are not balanced across GPUs. Instead, it is important to normalize by the total number of objects in all sub-batches."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    129,
                    1235,
                    1585,
                    1343
                ],
                "angle": 0,
                "content": "Box loss Similarly to [41,36], we use a soft version of Intersection over Union in our loss, together with a \\(\\ell_1\\) loss on \\(\\hat{b}\\):"
            },
            {
                "block_id": 7,
                "type": "equation",
                "bbox": [
                    377,
                    1378,
                    1580,
                    1435
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\text {b o x}} \\left(b _ {\\sigma (i)}, \\hat {b} _ {i}\\right) = \\lambda_ {\\text {i o u}} \\mathcal {L} _ {\\text {i o u}} \\left(b _ {\\sigma (i)}, \\hat {b} _ {i}\\right) + \\lambda_ {\\mathrm {L} 1} \\| b _ {\\sigma (i)} - \\hat {b} _ {i} \\| _ {1}, \\tag {9}\n\\]"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    131,
                    1471,
                    1585,
                    1527
                ],
                "angle": 0,
                "content": "where \\(\\lambda_{\\mathrm{iou}}, \\lambda_{\\mathrm{L1}} \\in \\mathbb{R}\\) are hyperparameters and \\(\\mathcal{L}_{\\mathrm{iou}}(\\cdot)\\) is the generalized IoU [38]:"
            },
            {
                "block_id": 9,
                "type": "equation",
                "bbox": [
                    307,
                    1560,
                    1580,
                    1683
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\mathrm {i o u}} \\left(b _ {\\sigma (i)}, \\hat {b} _ {i}\\right) = 1 - \\left(\\frac {\\left| b _ {\\sigma (i)} \\cap \\hat {b} _ {i} \\right|}{\\left| b _ {\\sigma (i)} \\cup \\hat {b} _ {i} \\right|} - \\frac {\\left| B \\left(b _ {\\sigma (i)} , \\hat {b} _ {i}\\right) \\setminus b _ {\\sigma (i)} \\cup \\hat {b} _ {i} \\right|}{\\left| B \\left(b _ {\\sigma (i)} , \\hat {b} _ {i}\\right) \\right|}\\right). \\tag {10}\n\\]"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    129,
                    1722,
                    1587,
                    2042
                ],
                "angle": 0,
                "content": "|.| means \"area\", and the union and intersection of box coordinates are used as shorthands for the boxes themselves. The areas of unions or intersections are computed by min/max of the linear functions of \\( b_{\\sigma(i)} \\) and \\( \\hat{b}_i \\), which makes the loss sufficiently well-behaved for stochastic gradients. \\( B(b_{\\sigma(i)}, \\hat{b}_i) \\) means the largest box containing \\( b_{\\sigma(i)}, \\hat{b}_i \\) (the areas involving \\( B \\) are also computed based on min/max of linear functions of the box coordinates)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    129,
                    2058,
                    1587,
                    2209
                ],
                "angle": 0,
                "content": "DICE/F-1 loss [28] The DICE coefficient is closely related to the Intersection over Union. If we denote by \\(\\hat{m}\\) the raw mask logits prediction of the model, and \\(m\\) the binary target mask, the loss is defined as:"
            },
            {
                "block_id": 12,
                "type": "equation",
                "bbox": [
                    546,
                    2247,
                    1580,
                    2347
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\mathrm {D I C E}} (m, \\hat {m}) = 1 - \\frac {2 m \\sigma (\\hat {m}) + 1}{\\sigma (\\hat {m}) + m + 1} \\tag {11}\n\\]"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    131,
                    2381,
                    1574,
                    2432
                ],
                "angle": 0,
                "content": "where \\(\\sigma\\) is the sigmoid function. This loss is normalized by the number of objects."
            }
        ]
    },
    {
        "page_id": 21,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    136,
                    43,
                    182,
                    79
                ],
                "angle": 0,
                "content": "22"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    274,
                    41,
                    495,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    134,
                    146,
                    708,
                    189
                ],
                "angle": 0,
                "content": "A.3 Detailed architecture"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    129,
                    238,
                    1592,
                    694
                ],
                "angle": 0,
                "content": "The detailed description of the transformer used in DETR, with positional encodings passed at every attention layer, is given in Fig. 10. Image features from the CNN backbone are passed through the transformer encoder, together with spatial positional encoding that are added to queries and keys at every multi-head self-attention layer. Then, the decoder receives queries (initially set to zero), output positional encoding (object queries), and encoder memory, and produces the final set of predicted class labels and bounding boxes through multiple multi-head self-attention and decoder-encoder attention. The first self-attention layer in the first decoder layer can be skipped."
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    415,
                    784,
                    1412,
                    1873
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 10: Architecture of DETR's transformer. Please, see Section A.3 for details."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    129,
                    2083,
                    1599,
                    2434
                ],
                "angle": 0,
                "content": "Computational complexity Every self-attention in the encoder has complexity \\( \\mathcal{O}(d^2 HW + d(HW)^2) \\): \\( \\mathcal{O}(d'd) \\) is the cost of computing a single query/key/value embeddings (and \\( Md' = d \\)), while \\( \\mathcal{O}(d'(HW)^2) \\) is the cost of computing the attention weights for one head. Other computations are negligible. In the decoder, each self-attention is in \\( \\mathcal{O}(d^2 N + dN^2) \\), and cross-attention between encoder and decoder is in \\( \\mathcal{O}(d^2 (N + HW) + dNHW) \\), which is much lower than the encoder since \\( N \\ll HW \\) in practice."
            }
        ]
    },
    {
        "page_id": 22,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    617,
                    38,
                    1449,
                    82
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1540,
                    43,
                    1583,
                    79
                ],
                "angle": 0,
                "content": "23"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    136,
                    140,
                    1587,
                    440
                ],
                "angle": 0,
                "content": "FLOPS computation Given that the FLOPS for Faster R-CNN depends on the number of proposals in the image, we report the average number of FLOPS for the first 100 images in the COCO 2017 validation set. We compute the FLOPS with the tool flop_countoperators from Detector2 [50]. We use it without modifications for Detector2 models, and extend it to take batch matrix multiply (bmm) into account for DETR models."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    139,
                    499,
                    807,
                    551
                ],
                "angle": 0,
                "content": "A.4 Training hyperparameters"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    139,
                    566,
                    1587,
                    763
                ],
                "angle": 0,
                "content": "We train DETR using AdamW [26] with improved weight decay handling, set to \\(10^{-4}\\). We also apply gradient clipping, with a maximal gradient norm of 0.1. The backbone and the transformers are treated slightly differently, we now discuss the details for both."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    136,
                    784,
                    1599,
                    1132
                ],
                "angle": 0,
                "content": "Backbone ImageNet pretrained backbone ResNet-50 is imported from Torchvision, discarding the last classification layer. Backbone batch normalization weights and statistics are frozen during training, following widely adopted practice in object detection. We fine-tune the backbone using learning rate of \\(10^{-5}\\). We observe that having the backbone learning rate roughly an order of magnitude smaller than the rest of the network is important to stabilize training, especially in the first few epochs."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    139,
                    1150,
                    1585,
                    1302
                ],
                "angle": 0,
                "content": "Transformer We train the transformer with a learning rate of \\(10^{-4}\\). Additive dropout of 0.1 is applied after every multi-head attention and FFN before layer normalization. The weights are randomly initialized with Xavier initialization."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    139,
                    1319,
                    1585,
                    1471
                ],
                "angle": 0,
                "content": "Losses We use linear combination of \\(\\ell_1\\) and GIoU losses for bounding box regression with \\(\\lambda_{\\mathrm{L1}} = 5\\) and \\(\\lambda_{\\mathrm{iou}} = 2\\) weights respectively. All models were trained with \\(N = 100\\) decoder query slots."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    139,
                    1486,
                    1585,
                    1840
                ],
                "angle": 0,
                "content": "Baseline Our enhanced Faster-RCNN+ baselines use GIoU [38] loss along with the standard \\(\\ell_1\\) loss for bounding box regression. We performed a grid search to find the best weights for the losses and the final models use only GIoU loss with weights 20 and 1 for box and proposal regression tasks respectively. For the baselines we adopt the same data augmentation as used in DETR and train it with \\(9\\times\\) schedule (approximately 109 epochs). All other settings are identical to the same models in the Detectron2 model zoo [50]."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    139,
                    1855,
                    1585,
                    2206
                ],
                "angle": 0,
                "content": "Spatial positional encoding Encoder activations are associated with corresponding spatial positions of image features. In our model we use a fixed absolute encoding to represent these spatial positions. We adopt a generalization of the original Transformer [47] encoding to the 2D case [31]. Specifically, for both spatial coordinates of each embedding we independently use \\(\\frac{d}{2}\\) sine and cosine functions with different frequencies. We then concatenate them to get the final \\(d\\) channel positional encoding."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    139,
                    2263,
                    636,
                    2311
                ],
                "angle": 0,
                "content": "A.5 Additional results"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    139,
                    2329,
                    1585,
                    2429
                ],
                "angle": 0,
                "content": "Some extra qualitative results for the panoptic prediction of the DETR-R101 model are shown in Fig.11."
            }
        ]
    },
    {
        "page_id": 23,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    138,
                    43,
                    181,
                    79
                ],
                "angle": 0,
                "content": "24"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    276,
                    41,
                    489,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    151,
                    135,
                    1569,
                    456
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) Failure case with overlapping objects. PanopticFPN misses one plane entirely, while DETR fails to accurately segment 3 of them."
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    151,
                    566,
                    1569,
                    881
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) Things masks are predicted at full resolution, which allows sharper boundaries than PanopticFPN"
            },
            {
                "block_id": 6,
                "type": "image_caption",
                "bbox": [
                    131,
                    1030,
                    1587,
                    1122
                ],
                "angle": 0,
                "content": "Fig. 11: Comparison of panoptic predictions. From left to right: Ground truth, PanopticFPN with ResNet 101, DETR with ResNet 101"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    129,
                    1232,
                    1587,
                    1981
                ],
                "angle": 0,
                "content": "Increasing the number of instances By design, DETR cannot predict more objects than it has query slots, i.e. 100 in our experiments. In this section, we analyze the behavior of DETR when approaching this limit. We select a canonical square image of a given class, repeat it on a \\(10 \\times 10\\) grid, and compute the percentage of instances that are missed by the model. To test the model with less than 100 instances, we randomly mask some of the cells. This ensures that the absolute size of the objects is the same no matter how many are visible. To account for the randomness in the masking, we repeat the experiment 100 times with different masks. The results are shown in Fig.12. The behavior is similar across classes, and while the model detects all instances when up to 50 are visible, it then starts saturating and misses more and more instances. Notably, when the image contains all 100 instances, the model only detects 30 on average, which is less than if the image contains only 50 instances that are all detected. The counter-intuitive behavior of the model is likely because the images and the detections are far from the training distribution."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    129,
                    1983,
                    1587,
                    2434
                ],
                "angle": 0,
                "content": "Note that this test is a test of generalization out-of-distribution by design, since there are very few example images with a lot of instances of a single class. It is difficult to disentangle, from the experiment, two types of out-of-domain generalization: the image itself vs the number of object per class. But since few to no COCO images contain only a lot of objects of the same class, this type of experiment represents our best effort to understand whether query objects overfit the label and position distribution of the dataset. Overall, the experiments suggests that the model does not overfit on these distributions since it yields near-perfect detections up to 50 objects."
            }
        ]
    },
    {
        "page_id": 24,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    619,
                    38,
                    1449,
                    89
                ],
                "angle": 0,
                "content": "End-to-End Object Detection with Transformers"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1540,
                    43,
                    1581,
                    79
                ],
                "angle": 0,
                "content": "25"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    469,
                    133,
                    1293,
                    832
                ],
                "angle": 0,
                "content": null,
                "caption": "Fig. 12: Analysis of the number of instances of various classes missed by DETR depending on how many are present in the image. We report the mean and the standard deviation. As the number of instances gets close to 100, DETR starts saturating and misses more and more objects"
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    132,
                    1155,
                    760,
                    1207
                ],
                "angle": 0,
                "content": "A.6 PyTorch inference code"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    127,
                    1237,
                    1592,
                    1740
                ],
                "angle": 0,
                "content": "To demonstrate the simplicity of the approach, we include inference code with PyTorch and Torchvision libraries in Listing 1. The code runs with Python \\(3.6+\\), PyTorch 1.4 and Torchvision 0.5. Note that it does not support batching, hence it is suitable only for inference or training with DistributedDataParallel with one image per GPU. Also note that for clarity, this code uses learnt positional encodings in the encoder instead of fixed, and positional encodings are added to the input only instead of at each transformer layer. Making these changes requires going beyond PyTorch implementation of transformers, which hampers readability. The entire code to reproduce the experiments will be made available before the conference."
            }
        ]
    },
    {
        "page_id": 25,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    136,
                    43,
                    182,
                    79
                ],
                "angle": 0,
                "content": "26"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    276,
                    41,
                    489,
                    82
                ],
                "angle": 0,
                "content": "Carion et al."
            },
            {
                "block_id": 2,
                "type": "aside_text",
                "bbox": [
                    53,
                    522,
                    94,
                    1717
                ],
                "angle": 0,
                "content": "1   \n2   \n3   \n4   \n5   \n6   \n7   \n8   \n9   \n10   \n11   \n12   \n13   \n14   \n15   \n16   \n17   \n18   \n19   \n20   \n21   \n22   \n23   \n24   \n25   \n26   \n27   \n28   \n29   \n30   \n31   \n32   \n33   \n34   \n35   \n36"
            },
            {
                "block_id": 4,
                "type": "code",
                "bbox": [
                    131,
                    717,
                    1642,
                    1719
                ],
                "angle": 0,
                "content": "def __init__(self, num_classes, hidden_dim, nheads, num Encoder_layers, numDecoder_layers): super().__init_.() # We take only convolutional layers from ResNet-50 model self.backbone = nn Sequential(*list(resnet50(pretrained=True).children()))[:2]) self.conv = nn.Conv2d(2048, hidden_dim, 1) self.transformer = nn.Transformer(hidden_dim, nheads, num Encoder_layers, num decoder_layers) self_linear_class = nn.Linear(hidden_dim, num_classes + 1) self_linear_bbox = nn.Linear(hidden_dim, 4) self/query_pos = nn_PARAMETER(torch.rand(100, hidden_dim)) self.row_embedding = nn_PARAMETER(torch.rand(50, hidden_dim // 2)) self.col_embedding = nn_PARAMETER(torch.rand(50, hidden_dim // 2)) def forward(self, inputs): x = self/backbone(inputs) h = self.conv(x) H, W = h.shape[-2:] pos = torch.cat([ self.col_embedding[:W].unsqueeze(0).repeat(H, 1, 1), self.row_embedding[:H].unsqueeze(1).repeat(1, W, 1), ], dim=-1). flatten(0, 1).unsqueeze(1) h = self.transformer(pos + h/flatten(2).permute(2, 0, 1), self.query_pos.unsqueeze(1)) return self_linear_class(h), self_linear_bbox(h).sigmoid() detr = DETR(num_classes=91, hidden_dim=256, nheads=8, numEncoder_layers=6, numDecoder_layers=6) detr.eval() inputs = torch randn(1, 3, 800, 1200) logits, bboxes = detr(inputs)",
                "caption": "import torch   \nfrom torch import nn   \nfrom torchvision.models import resnet50   \nclass DETR(nn.Module):"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    129,
                    1799,
                    1592,
                    2029
                ],
                "angle": 0,
                "content": "Listing 1: DETR PyTorch inference code. For clarity it uses learnt positional encodings in the encoder instead of fixed, and positional encodings are added to the input only instead of at each transformer layer. Making these changes requires going beyond PyTorch implementation of transformers, which hampers readability. The entire code to reproduce the experiments will be made available before the conference."
            }
        ]
    }
]