[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    669,
                    284,
                    1818,
                    354
                ],
                "angle": 0,
                "content": "SenseBERT: Driving Some Sense into BERT"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    439,
                    431,
                    2074,
                    550
                ],
                "angle": 0,
                "content": "Yoav Levine Barak Lenz Or Dagan Ori Ram Dan Padnos Or Sharir Shai Shalev-Shwartz Amnon Shashua Yoav Shoham"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    972,
                    610,
                    1520,
                    663
                ],
                "angle": 0,
                "content": "AI21 Labs, Tel Aviv, Israel"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    709,
                    726,
                    1788,
                    785
                ],
                "angle": 0,
                "content": "{yoavl,baracl,ord,orir,...}@ai21.com"
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    654,
                    929,
                    846,
                    978
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    1027,
                    1143,
                    1971
                ],
                "angle": 0,
                "content": "The ability to learn from large unlabeled corpora has allowed neural language models to advance the frontier in natural language understanding. However, existing self-supervision techniques operate at the word form level, which serves as a surrogate for the underlying semantic content. This paper proposes a method to employ weak-supervision directly at the word sense level. Our model, named SenseBERT, is pre-trained to predict not only the masked words but also their WordNet supersenses. Accordingly, we attain a lexical-semantic level language model, without the use of human annotation. SenseBERT achieves significantly improved lexical understanding, as we demonstrate by experimenting on SemEval Word Sense Disambiguation, and by attaining a state of the art result on the 'Word in Context' task."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    292,
                    2027,
                    645,
                    2076
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    292,
                    2118,
                    1208,
                    2508
                ],
                "angle": 0,
                "content": "Neural language models have recently undergone a qualitative leap forward, pushing the state of the art on various NLP tasks. Together with advances in network architecture (Vaswani et al., 2017), the use of self-supervision has proven to be central to these achievements, as it allows the network to learn from massive amounts of unannotated text."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    292,
                    2515,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "The self-supervision strategy employed in BERT (Devlin et al., 2019) involves masking some of the words in an input sentence, and then training the model to predict them given their context. Other proposed approaches for self-supervised objectives, including unidirectional (Radford et al., 2019), permutational (Yang et al., 2019), or word insertion-based (Chan et al., 2019) methods, operate similarly, over words. However, since a given word form can possess multiple meanings (e.g., the word 'bass' can refer to a fish, a guitar, a type of singer, etc.), the word itself is merely a surrogate of its"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1275,
                    929,
                    2190,
                    1154
                ],
                "angle": 0,
                "content": "actual meaning in a given context, referred to as its sense. Indeed, the word-form level is viewed as a surface level which often introduces challenging ambiguity (Navigli, 2009)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1275,
                    1161,
                    2195,
                    2111
                ],
                "angle": 0,
                "content": "In this paper, we bring forth a novel methodology for applying weak-supervision directly on the level of a word's meaning. By infusing word-sense information into BERT's pre-training signal, we explicitly expose the model to lexical semantics when learning from a large unannotated corpus. We call the resultant sense-informed model SenseBERT. Specifically, we add a masked-word sense prediction task as an auxiliary task in BERT's pre-training. Thereby, jointly with the standard word-form level language model, we train a semantic-level language model that predicts the missing word's meaning. Our method does not require sense-annotated data; self-supervised learning from unannotated text is facilitated by using WordNet (Miller, 1998), an expert constructed inventory of word senses, as weak supervision."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1275,
                    2118,
                    2195,
                    2904
                ],
                "angle": 0,
                "content": "We focus on a coarse-grained variant of a word's sense, referred to as its WordNet supersense, in order to mitigate an identified brittleness of fine-grained word-sense systems, caused by arbitrary sense granularity, blurriness, and general subjectiveness (Kilgarriff, 1997; Schneider, 2014). WordNet lexicographers organize all word senses into 45 supersense categories, 26 of which are for nouns, 15 for verbs, 3 for adjectives and 1 for adverbs (see full supersense table in the supplementary materials). Disambiguating a word's supersense has been widely studied as a fundamental lexical categorization task (Ciaramita and Johnson, 2003; Basile, 2012; Schneider and Smith, 2015)."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1275,
                    2911,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": "We employ the masked word's allowed supersenses list from WordNet as a set of possible labels for the sense prediction task. The labeling of words with a single supersense (e.g., 'sword' has only the supersense noun.artifact) is straightforward: We"
            },
            {
                "block_id": 13,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4656"
            },
            {
                "block_id": 14,
                "type": "footer",
                "bbox": [
                    419,
                    3301,
                    2054,
                    3395
                ],
                "angle": 0,
                "content": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, pages 4656-4667 July 5 - 10, 2020. ©2020 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1220,
                    603
                ],
                "angle": 0,
                "content": "train the network to predict this supersense given the masked word's context. As for words with multiple supersenses (e.g., 'bass' can be: noun.food, noun.animal, noun.artifact, noun.person, etc.), we train the model to predict any of these senses, leading to a simple yet effective soft-labeling scheme."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    606,
                    1223,
                    1631
                ],
                "angle": 0,
                "content": "We show that SenseBERT<sub>BASE</sub> outscores both BERT<sub>BASE</sub> and BERT<sub>LARGE</sub> by a large margin on a supersense variant of the SemEval Word Sense Disambiguation (WSD) data set standardized in Raganato et al. (2017). Notably, SenseBERT receives competitive results on this task without fun-tuning, i.e., when training a linear classifier over the pretrained embeddings, which serves as a testament for its self-acquisition of lexical semantics. Furthermore, we show that SenseBERT<sub>BASE</sub> surpasses BERT<sub>LARGE</sub> in the Word in Context (WiC) task (Pilehvar and Camacho-Collados, 2019) from the SuperGLUE benchmark (Wang et al., 2019), which directly depends on word-supersense awareness. A single SenseBERT<sub>LARGE</sub> model achieves state of the art performance on WiC with a score of 72.14, improving the score of BERT<sub>LARGE</sub> by 2.5 points."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1676,
                    677,
                    1729
                ],
                "angle": 0,
                "content": "2 Related Work"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1778,
                    1218,
                    2620
                ],
                "angle": 0,
                "content": "Neural network based word embeddings first appeared as a static mapping (non-contextualized), where every word is represented by a constant pretrained embedding (Mikolov et al., 2013; Pennington et al., 2014). Such embeddings were shown to contain some amount of word-sense information (Iacobacci et al., 2016; Yuan et al., 2016; Arora et al., 2018; Le et al., 2018). Additionally, sense embeddings computed for each word sense in the word-sense inventory (e.g. WordNet) have been employed, relying on hypernymity relations (Rothe and Schütze, 2015) or the gloss for each sense (Chen et al., 2014). These approaches rely on static word embeddings and require a large amount of annotated data per word sense."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2627,
                    1220,
                    3195
                ],
                "angle": 0,
                "content": "The introduction of contextualized word embeddings (Peters et al., 2018), for which a given word's embedding is context-dependent rather than precomputed, has brought forth a promising prospect for sense-aware word embeddings. Indeed, visualizations in Reif et al. (2019) show that sense sensitive clusters form in BERT's word embedding space. Nevertheless, we identify a clear gap in this ablity. We show that a vanilla BERT model trained with the current word-level self-supervision,"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2198,
                    603
                ],
                "angle": 0,
                "content": "burdened with the implicit task of disambiguating word meanings, often fails to grasp lexical semantics, exhibiting high supersense misclassification rates. Our suggested weakly-supervised word-sense signal allows SenseBERT to significantly bridge this gap."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    606,
                    2198,
                    1280
                ],
                "angle": 0,
                "content": "Moreover, SenseBERT exhibits an improvement in lexical semantics ability (reflected by the Word in Context task score) even when compared to models with WordNet infused linguistic knowledge. Specifically we compare to Peters et al. (2019) who re-contextualize word embeddings via a word-to-entity attention mechanism (where entities are WordNet lemmas and synsets), and to Loureiro and Jorge (2019) which construct sense embeddings from BERT's word embeddings and use the WordNet graph to enhance coverage (see quantitative comparison in table 3)."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    1267,
                    1333,
                    2046,
                    1448
                ],
                "angle": 0,
                "content": "3 Incorporating Word-Supersense Information in Pre-training"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    1487,
                    2198,
                    1992
                ],
                "angle": 0,
                "content": "In this section, we present our proposed method for integrating word sense-information within SenseBERT's pre-training. We start by describing the vanilla BERT architecture in subsection 3.1. We conceptually divide it into an internal transformer encoder and an external mapping \\( W \\) which translates the observed vocabulary space into and out of the transformer encoder space [see illustration in figure 1(a)]."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1999,
                    2198,
                    2960
                ],
                "angle": 0,
                "content": "In the subsequent subsections, we frame our contribution to the vanilla BERT architecture as an addition of a parallel external mapping to the words supersenses space, denoted \\( S \\) [see illustration in figure 1(b)]. Specifically, in section 3.2 we describe the loss function used for learning \\( S \\) in parallel to \\( W \\), effectively implementing word-form and word-sense multi-task learning in the pre-training stage. Then, in section 3.3 we describe our methodology for adding supersense information in \\( S \\) to the initial Transformer embedding, in parallel to word-level information added by \\( W \\). In section 3.4 we address the issue of supersense prediction for out-of-vocabulary words, and in section 3.5 we describe our modification of BERT's masking strategy, prioritizing single-supersensed words which carry a clearer semantic signal."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    3002,
                    1625,
                    3051
                ],
                "angle": 0,
                "content": "3.1 Background"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1267,
                    3076,
                    2198,
                    3202
                ],
                "angle": 0,
                "content": "The input to BERT is a sequence of words \\(\\{x^{(j)}\\in\\) \\(\\{0,1\\}^{D_W}\\}_{j = 1}^N\\) where \\(15\\%\\) of the words are re"
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4657"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 1,
                "type": "image",
                "bbox": [
                    689,
                    270,
                    2138,
                    627
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) SenseBERT"
            },
            {
                "block_id": 3,
                "type": "image",
                "bbox": [
                    689,
                    659,
                    2173,
                    1020
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: SenseBERT includes a masked-word supersense prediction task, pre-trained jointly with BERT's original masked-word prediction task (Devlin et al., 2019) (see section 3.2). As in the original BERT, the mapping from the Transformer dimension to the external dimension is the same both at input and at output (\\(W\\) for words and \\(S\\) for supersenses), where \\(M\\) denotes a fixed mapping between word-forms and their allowed WordNet supersenses (see section 3.3). The vectors \\(p^{(j)}\\) denote positional embeddings. For clarity, we omit a reference to a sentence-level Next Sentence Prediction task trained jointly with the above."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1497,
                    1215,
                    2115
                ],
                "angle": 0,
                "content": "placed by a [MASK] token (see treatment of subword tokanization in section 3.4). Here \\(N\\) is the input sentence length, \\(D_W\\) is the word vocabulary size, and \\(x^{(j)}\\) is a 1-hot vector corresponding to the \\(j^{\\text{th}}\\) input word. For every masked word, the output of the pretraining task is a word-score vector \\(y^{\\text{words}} \\in \\mathbb{R}^{D_W}\\) containing the per-word score. BERT's architecture can be decomposed to (1) an internal Transformer encoder architecture (Vaswani et al., 2017) wrapped by (2) an external mapping to the word vocabulary space, denoted by \\(W\\).<sup>1</sup>"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2122,
                    1215,
                    2585
                ],
                "angle": 0,
                "content": "The Transformer encoder operates over a sequence of word embeddings \\( v_{\\mathrm{input}}^{(j)} \\in \\mathbb{R}^d \\), where \\( d \\) is the Transformer encoder's hidden dimension. These are passed through multiple attention-based Transformer layers, producing a new sequence of contextualized embeddings at each layer. The Transformer encoder output is the final sequence of contextualized word embeddings \\( v_{\\mathrm{output}}^{(j)} \\in \\mathbb{R}^d \\)."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2588,
                    1218,
                    2981
                ],
                "angle": 0,
                "content": "The external mapping \\( W \\in \\mathbb{R}^{d \\times D_W} \\) is effectively a translation between the external word vocabulary dimension and the internal Transformer dimension. Original words in the input sentence are translated into the Transformer block by applying this mapping (and adding positional encoding vectors \\( p^{(j)} \\in \\mathbb{R}^d \\)):"
            },
            {
                "block_id": 8,
                "type": "equation",
                "bbox": [
                    545,
                    2999,
                    1210,
                    3076
                ],
                "angle": 0,
                "content": "\\[\nv _ {\\text {i n p u t}} ^ {(j)} = W x ^ {(j)} + p ^ {(j)} \\tag {1}\n\\]"
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3097,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "<sup>1</sup>For clarity, we omit a description of the Next Sentence Prediction task which we employ as in Devlin et al. (2019)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1497,
                    2195,
                    1953
                ],
                "angle": 0,
                "content": "The word-score vector for a masked word at position \\(j\\) is extracted from the Transformer encoder output by applying the transpose: \\(y^{\\mathrm{words}} = W^{\\top}v_{\\mathrm{output}}^{(j)}\\) [see illustration in figure 1(a)]. The use of the same matrix \\(W\\) as the mapping in and out of the transformer encoder space is referred to as weight tying (Inan et al., 2017; Press and Wolf, 2017)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    1967,
                    2195,
                    2417
                ],
                "angle": 0,
                "content": "Given a masked word in position \\(j\\), BERT's original masked-word prediction pre-training task is to have the softmax of the word-score vector \\(y^{\\mathrm{words}} = W^{\\top}v_{\\mathrm{output}}^{(j)}\\) get as close as possible to a 1-hot vector corresponding to the masked word. This is done by minimizing the cross-entropy loss between the softmax of the word-score vector and a 1-hot vector corresponding to the masked word:"
            },
            {
                "block_id": 12,
                "type": "equation",
                "bbox": [
                    1473,
                    2497,
                    2190,
                    2553
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\mathrm {L M}} = - \\log p (w | \\text {c o n t e x t}), \\tag {2}\n\\]"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    2631,
                    2195,
                    2799
                ],
                "angle": 0,
                "content": "where \\( w \\) is the masked word, the context is composed of the rest of the input sequence, and the probability is computed by:"
            },
            {
                "block_id": 14,
                "type": "equation",
                "bbox": [
                    1391,
                    2869,
                    2190,
                    3002
                ],
                "angle": 0,
                "content": "\\[\np (w | c o n t e x t) = \\frac {\\exp \\left(y _ {w} ^ {\\mathrm {w o r d s}}\\right)}{\\sum_ {w ^ {\\prime}} \\exp \\left(y _ {w ^ {\\prime}} ^ {\\mathrm {w o r d s}}\\right)}, \\tag {3}\n\\]"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    3076,
                    2195,
                    3185
                ],
                "angle": 0,
                "content": "where \\( y_{w}^{\\mathrm{words}} \\) denotes the \\( w^{\\mathrm{th}} \\) entry of the word-score vector."
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4658"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    287,
                    263,
                    1012,
                    371
                ],
                "angle": 0,
                "content": "3.2 Weakly-Supervised Supersense Prediction Task"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    392,
                    1220,
                    1076
                ],
                "angle": 0,
                "content": "Jointly with the above procedure for training the word-level language model of SenseBERT, we train the model to predict the supersense of every masked word, thereby training a semantic-level language model. This is done by adding a parallel external mapping to the words supersenses space, denoted \\( S \\in \\mathbb{R}^{d \\times D_S} \\) [see illustration in figure 1(b)], where \\( D_S = 45 \\) is the size of supersenses vocabulary. Ideally, the objective is to have the softmax of the sense-score vector \\( y^{\\text{senses}} \\in \\mathbb{R}^{D_S} := S^\\top v_{\\text{output}}^{(j)} \\) get as close as possible to a 1-hot vector corresponding to the word's supersense in the given context."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1080,
                    1218,
                    1918
                ],
                "angle": 0,
                "content": "For each word \\( w \\) in our vocabulary, we employ the WordNet word-sense inventory for constructing \\( A(w) \\), the set of its \"allowed\" supersenses. Specifically, we apply a WordNet Lemmatizer on \\( w \\), extract the different synsets that are mapped to the lemmatized word in WordNet, and define \\( A(w) \\) as the union of supersenses coupled to each of these synsets. As exceptions, we set \\( A(w) = \\emptyset \\) for the following: (i) short words (up to 3 characters), since they are often treated as abbreviations, (ii) stop words, as WordNet does not contain their main synset (e.g. 'he' is either the element helium or the hebrew language according to WordNet), and (iii) tokens that represent part-of-word (see section 3.4 for further discussion on these tokens)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1925,
                    1215,
                    2262
                ],
                "angle": 0,
                "content": "Given the above construction, we employ a combination of two loss terms for the supersense-level language model. The following allowed-senses term maximizes the probability that the predicted sense is in the set of allowed supersenses of the masked word \\( w \\):"
            },
            {
                "block_id": 4,
                "type": "equation",
                "bbox": [
                    396,
                    2283,
                    1210,
                    2480
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} \\mathcal {L} _ {\\mathrm {S L M}} ^ {\\text {a l l o w e d}} = - \\log p (s \\in A (w) | \\text {c o n t e x t}) \\\\ = - \\log \\sum_ {s \\in A (w)} p (s | \\text {c o n t e x t}), \\tag {4} \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2508,
                    1213,
                    2616
                ],
                "angle": 0,
                "content": "where the probability for a supersense \\(s\\) is given by:"
            },
            {
                "block_id": 6,
                "type": "equation",
                "bbox": [
                    436,
                    2609,
                    1210,
                    2736
                ],
                "angle": 0,
                "content": "\\[\np (s | \\text {c o n t e x t}) = \\frac {\\exp \\left(y _ {s} ^ {\\text {s e n s e s}}\\right)}{\\sum_ {s ^ {\\prime}} \\exp \\left(y _ {s ^ {\\prime}} ^ {\\text {s e n s e s}}\\right)}. \\tag {5}\n\\]"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2743,
                    1218,
                    3192
                ],
                "angle": 0,
                "content": "The soft-labeling scheme given above, which treats all the allowed supersenses of the masked word equally, introduces noise to the supersense labels. We expect that encountering many contexts in a sufficiently large corpus will reinforce the correct labels whereas the signal of incorrect labels will diminish. To illustrate this, consider the following examples for the food context:"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1309,
                    263,
                    1811,
                    312
                ],
                "angle": 0,
                "content": "1. “This bass is delicious”"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1357,
                    322,
                    2170,
                    375
                ],
                "angle": 0,
                "content": "(supersenses: noun.food, noun.artifact, etc.)"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1305,
                    420,
                    1907,
                    473
                ],
                "angle": 0,
                "content": "2. “This chocolate is delicious”"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1357,
                    480,
                    2193,
                    533
                ],
                "angle": 0,
                "content": "(supersenses: noun.food, noun(attribute, etc.)"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1305,
                    578,
                    1843,
                    631
                ],
                "angle": 0,
                "content": "3. \"This pickle is delicious\""
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1357,
                    638,
                    2128,
                    691
                ],
                "angle": 0,
                "content": "(supersenses: noun.food, noun.state, etc.)"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    743,
                    2198,
                    1076
                ],
                "angle": 0,
                "content": "Masking the marked word in each of the examples results in three identical input sequences, each with a different sets of labels. The ground truth label, noun.food, appears in all cases, so that its probability in contexts indicating food is increased whereas the signals supporting other labels cancel out."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1262,
                    1083,
                    2198,
                    1532
                ],
                "angle": 0,
                "content": "While \\(\\mathcal{L}_{\\mathrm{SLM}}^{\\mathrm{allowed}}\\) pushes the network in the right direction, minimizing this loss could result in the network becoming overconfident in predicting a strict subset of the allowed senses for a given word, i.e., a collapse of the prediction distribution. This is especially acute in the early stages of the training procedure, when the network could converge to the noisy signal of the soft-labeling scheme."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    1536,
                    2198,
                    1761
                ],
                "angle": 0,
                "content": "To mitigate this issue, the following regularization term is added to the loss, which encourages a uniform prediction distribution over the allowed supersenses:"
            },
            {
                "block_id": 17,
                "type": "equation",
                "bbox": [
                    1305,
                    1806,
                    2193,
                    1946
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\mathrm {S L M}} ^ {\\mathrm {r e g}} = - \\sum_ {s \\in A (w)} \\frac {1}{| A (w) |} \\log p (s | \\text {c o n t e x t}), \\tag {6}\n\\]"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    1989,
                    2193,
                    2097
                ],
                "angle": 0,
                "content": "i.e., a cross-entropy loss with a uniform distribution over the allowed supersenses."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    2104,
                    2198,
                    2322
                ],
                "angle": 0,
                "content": "Overall, jointly with the regular word level language model trained with the loss in eq. 2, we train the semantic level language model with a combined loss of the form:"
            },
            {
                "block_id": 20,
                "type": "equation",
                "bbox": [
                    1466,
                    2385,
                    2193,
                    2459
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\mathrm {S L M}} = \\mathcal {L} _ {\\mathrm {S L M}} ^ {\\text {a l l o w e d}} + \\mathcal {L} _ {\\mathrm {S L M}} ^ {\\text {r e g}}. \\tag {7}\n\\]"
            },
            {
                "block_id": 21,
                "type": "title",
                "bbox": [
                    1265,
                    2494,
                    2113,
                    2550
                ],
                "angle": 0,
                "content": "3.3 Supersense Aware Input Embeddings"
            },
            {
                "block_id": 22,
                "type": "text",
                "bbox": [
                    1262,
                    2571,
                    2198,
                    3192
                ],
                "angle": 0,
                "content": "Though in principle two different matrices could have been used for converting in and out of the Tranformer encoder, the BERT architecture employs the same mapping \\( W \\). This approach, referred to as weight tying, was shown to yield theoretical and practical benefits (Inan et al., 2017; Press and Wolf, 2017). Intuitively, constructing the Transformer encoder's input embeddings from the same mapping with which the scores are computed improves their quality as it makes the input more sensitive to the training signal."
            },
            {
                "block_id": 23,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4659"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 1,
                "type": "image",
                "bbox": [
                    377,
                    357,
                    1230,
                    971
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) Noun Supersenses"
            },
            {
                "block_id": 3,
                "type": "image",
                "bbox": [
                    1434,
                    371,
                    2113,
                    954
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: UMAP visualization of supersense vectors (rows of the classifier \\(S\\)) learned by SenseBERT at pre-training. (a) Clustering by the supersense's part-of speech. (b) Within noun supersenses, semantically similar supersenses are clustered together (see more details in the supplementary materials)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    287,
                    1290,
                    1218,
                    1571
                ],
                "angle": 0,
                "content": "We follow this approach, and insert our newly proposed semantic-level language model matrix \\( S \\) in the input in addition to \\( W \\) [as depicted in figure 1(b)], such that the input vector to the Transformer encoder (eq. 1) is modified to obey:"
            },
            {
                "block_id": 6,
                "type": "equation",
                "bbox": [
                    451,
                    1603,
                    1213,
                    1683
                ],
                "angle": 0,
                "content": "\\[\nv _ {\\text {i n p u t}} ^ {(j)} = (W + S M) x ^ {(j)} + p ^ {(j)}, \\tag {8}\n\\]"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1722,
                    1215,
                    1999
                ],
                "angle": 0,
                "content": "where \\(p^{(j)}\\) are the regular positional embeddings as used in BERT, and \\(M \\in \\mathbb{R}^{D_S \\times D_W}\\) is a static 0/1 matrix converting between words and their allowed WordNet supersenses \\(A(w)\\) (see construction details above)."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2003,
                    1215,
                    2862
                ],
                "angle": 0,
                "content": "The above strategy for constructing \\( v_{\\mathrm{input}}^{(j)} \\) allows for the semantic level vectors in \\( S \\) to come into play and shape the input embeddings even for words which are rarely observed in the training corpus. For such a word, the corresponding row in \\( W \\) is potentially less informative, since due to the low word frequency the model did not have sufficient chance to adequately learn it. However, since the model learns a representation of its supersense, the corresponding row in \\( S \\) is informative of the semantic category of the word. Therefore, the input embedding in eq. 8 can potentially help the model to elicit meaningful information even when the masked word is rare, allowing for better exploitation of the training corpus."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    287,
                    2894,
                    1081,
                    2946
                ],
                "angle": 0,
                "content": "3.4 Rare Words Supersense Prediction"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2967,
                    1218,
                    3192
                ],
                "angle": 0,
                "content": "At the pre-processing stage, when an out-of-vocabulary (OOV) word is encountered in the corpus, it is divided into several in-vocabulary subword tokens. For the self-supervised word pre"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    1290,
                    2195,
                    1627
                ],
                "angle": 0,
                "content": "diction task (eq. 2) masked sub-word tokens are straightforwardly predicted as described in section 3.1. In contrast, word-sense supervision is only meaningful at the word level. We compare two alternatives for dealing with tokenized OOV words for the supersense prediction task (eq. 7)."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1262,
                    1641,
                    2195,
                    2487
                ],
                "angle": 0,
                "content": "In the first alternative, called 60K vocabulary, we augment BERT's original 30K-token vocabulary (which roughly contained the most frequent words) with additional 30K new words, chosen according to their frequency in Wikipedia. This vocabulary increase allows us to see more of the corpus as whole words for which supersense prediction is a meaningful operation. Additionally, in accordance with the discussion in the previous subsection, our sense-aware input embedding mechanism can help the model extract more information from lower-frequency words. For the cases where a sub-word token is chosen for masking, we only propagate the regular word level loss and do not train the supersense prediction task."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    2501,
                    2198,
                    3065
                ],
                "angle": 0,
                "content": "The above addition to the vocabulary results in an increase of approximately 23M parameters over the 110M parameters of BERT<sub>BASE</sub> and an increase of approximately 30M parameters over the 340M parameters of BERT<sub>LARGE</sub> (due to different embedding dimensions \\( d = 768 \\) and \\( d = 1024 \\), respectively). It is worth noting that similar vocabulary sizes in leading models have not resulted in increased sense awareness, as reflected for example in the WiC task results (Liu et al., 2019)."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    3080,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "As a second alternative, referred to as average embedding, we employ BERT's regular 30K-token"
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4660"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 1,
                "type": "image",
                "bbox": [
                    518,
                    322,
                    1051,
                    757
                ],
                "angle": 0,
                "content": null,
                "caption": "(b)"
            },
            {
                "block_id": 3,
                "type": "image",
                "bbox": [
                    1434,
                    329,
                    2022,
                    761
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 3: (a) A demonstration of supersense probabilities assigned to a masked position within context, as given by SenseBERT's word-supersense level semantic language model (capped at \\(5\\%\\)). Example words corresponding to each supersense are presented in parentheses. (b) Examples of SenseBERT's prediction on raw text, when the unmasked input sentence is given to the model. This beyond word-form abstraction ability facilitates a more natural elicitation of semantic content at pre-training."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1203,
                    1218,
                    1599
                ],
                "angle": 0,
                "content": "vocabulary and employ a whole-word-masking strategy. Accordingly, all of the tokens of a tokenized OOV word are masked together. In this case, we train the supersense prediction task to predict the WordNet supersenses of this word from the average of the output embeddings at the location of the masked sub-words tokens."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    287,
                    1634,
                    1089,
                    1694
                ],
                "angle": 0,
                "content": "3.5 Single-Supersensed Word Masking"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1708,
                    1215,
                    2609
                ],
                "angle": 0,
                "content": "Words that have a single supersense are good anchors for obtaining an unambiguous semantic signal. These words teach the model to accurately map contexts to supersenses, such that it is then able to make correct context-based predictions even when a masked word has several supersenses. We therefore favor such words in the masking strategy, choosing \\(50\\%\\) of the single-supersensed words in each input sequence to be masked. We stop if \\(40\\%\\) of the overall \\(15\\%\\) masking budget is filled with single-supersensed words (this rarely happens), and in any case we randomize the choice of the remaining words to complete this budget. As in the original BERT, 1 out of 10 words chosen for masking is shown to the model as itself rather than replaced with [MASK]."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    287,
                    2648,
                    950,
                    2764
                ],
                "angle": 0,
                "content": "4 Semantic Language Model Visualization"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2795,
                    1218,
                    3192
                ],
                "angle": 0,
                "content": "A SenseBERT pretrained as described in section 3 (with training hyperparameters as in Devlin et al. (2019)), has an immediate non-trivial bi-product. The pre-trained mapping to the supersenses space, denoted \\(S\\), acts as an additional head predicting a word's supersense given context [see figure 1(b)]. We thereby effectively attain a semantic-level lan-"
            },
            {
                "block_id": 10,
                "type": "table",
                "bbox": [
                    1277,
                    1192,
                    2188,
                    1480
                ],
                "angle": 0,
                "content": "<table><tr><td>SenseBERTBASE</td><td>SemEval-SS Fine-tuned</td></tr><tr><td>30K no OOV</td><td>81.9</td></tr><tr><td>30K average OOV</td><td>82.7</td></tr><tr><td>60K no OOV</td><td>83</td></tr></table>"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    1532,
                    2198,
                    1936
                ],
                "angle": 0,
                "content": "Table 1: Testing variants for predicting supersenses of rare words during SenseBERT's pretraining, as described in section 5.1. Results are reported on the SemEval-SS task (see section 5.2). \\(30\\mathrm{K} / 60\\mathrm{K}\\) stand for vocabulary size, and no/average OOV stand for not predicting senses for OOV words or predicting senses from the average of the sub-word token embeddings, respectively."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    2038,
                    2200,
                    2206
                ],
                "angle": 0,
                "content": "guage model that predicts the missing word's meaning jointly with the standard word-form level language model."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    2217,
                    2198,
                    2725
                ],
                "angle": 0,
                "content": "We illustrate the resultant mapping in figure 2, showing a UMAP dimensionality reduction (McInnes et al., 2018) of the rows of \\( S \\), which corresponds to the different supersenses. A clear clustering according to the supersense part-of-speech is apparent in figure 2(a). We further identify finer-grained semantic clusters, as shown for example in figure 2(b) and given in more detail in the supplementary materials."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    2732,
                    2195,
                    3125
                ],
                "angle": 0,
                "content": "SenseBERT's semantic language model allows predicting a distribution over supersenses rather than over words in a masked position. Figure 3(a) shows the supersense probabilities assigned by SenseBERT in several contexts, demonstrating the model's ability to assign semantically meaningful categories to the masked position."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1312,
                    3136,
                    2190,
                    3192
                ],
                "angle": 0,
                "content": "Finally, we demonstrate that SenseBERT enjoys"
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1287,
                    3279
                ],
                "angle": 0,
                "content": "4661"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    292,
                    277,
                    2168,
                    880
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"3\">(a) SemEval-SS</td><td colspan=\"2\">The team used a battery of the newly developed “gene probes”</td><td>BERT</td><td>SenseBERT</td></tr><tr><td rowspan=\"2\" colspan=\"2\">Ten shirt-sleeved ringers stand in a circle, one foot ahead of the other in a prize-fighter&#x27;s stance</td><td>noun.artifact</td><td>noun.group</td></tr><tr><td>nounquantity</td><td>noun.body</td></tr><tr><td rowspan=\"2\">(b) WiC</td><td>Sent. A: The kick must be synchronized with the arm movements.</td><td>Sent. B: A sidecar is a smooth drink but it has a powerful kick.</td><td>Same</td><td>Different</td></tr><tr><td>Sent. A: Plant bugs in the dissident&#x27;s apartment.</td><td>Sent. B: Plant a spy in Moscow.</td><td>Different</td><td>Same</td></tr></table>",
                "caption": "Figure 4: Example entries of (a) the SemEval-SS task, where a model is to predict the supersense of the marked word, and (b) the Word in Context (WiC) task where a model must determine whether the underlined word is used in the same/different supersense within sentences A and B. In all displayed examples, taken from the corresponding development sets, SenseBERT predicted the correct label while BERT failed to do so. A quantitative comparison between models is presented in table 2."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1301,
                    1220,
                    1925
                ],
                "angle": 0,
                "content": "an ability to view raw text at a lexical semantic level. Figure 3(b) shows example sentences and their supersense prediction by the pretrained model. Where a vanilla BERT would see only the words of the sentence \"Dan cooked a bass on the grill\", SenseBERT would also have access to the supersense abstraction: \"[Person] [created] [food] on the [artifact]\". This sense-level perspective can help the model extract more knowledge from every training example, and to generalize semantically similar notions which do not share the same phrasing."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1967,
                    1046,
                    2024
                ],
                "angle": 0,
                "content": "5 Lexical Semantics Experiments"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2059,
                    1218,
                    2627
                ],
                "angle": 0,
                "content": "In this section, we present quantitative evaluations of SenseBERT, pre-trained as described in section 3. We test the model's performance on a supersense-based variant of the SemEval WSD test sets standardized in Raganato et al. (2017), and on the Word in Context (WiC) task (Pilehvar and Camacho-Collados, 2019) (included in the recently introduced SuperGLUE benchmark (Wang et al., 2019)), both directly relying on the network's ability to perform lexical semantic categorization."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    287,
                    2666,
                    1104,
                    2771
                ],
                "angle": 0,
                "content": "5.1 Comparing Rare Words Supersense Prediction Methods"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2799,
                    1220,
                    3195
                ],
                "angle": 0,
                "content": "We first report a comparison of the two methods described in section 3.4 for predicting the supersenses of rare words which do not appear in BERT's original vocabulary. The first \\(60K\\) vocabulary method enriches the vocabulary and the second average embedding method predicts a supersense from the average embeddings of the sub-word tokens com"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1301,
                    2195,
                    1634
                ],
                "angle": 0,
                "content": "prising an OOV word. During fine-tuning, when encountering an OOV word we predict the supersenses from the rightmost sub-word token in the 60K vocabulary method and from the average of the sub-word tokens in the average embedding method."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    1645,
                    2200,
                    2206
                ],
                "angle": 0,
                "content": "As shown in table 1, both methods perform comparably on the SemEval supersense disambiguation task (see following subsection), yielding an improvement over the baseline of learning supersense information only for whole words in BERT's original 30K-token vocabulary. We continue with the 60K-token vocabulary for the rest of the experiments, but note the average embedding option as a viable competitor for predicting word-level semantics."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    1267,
                    2262,
                    2188,
                    2318
                ],
                "angle": 0,
                "content": "5.2 SemEval-SS: Supersense Disambiguation"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    2343,
                    2198,
                    3195
                ],
                "angle": 0,
                "content": "We test SenseBERT on a Word Supersense Disambiguation task, a coarse grained variant of the common WSD task. We use SemCor (Miller et al., 1993) as our training dataset (226,036 annotated examples), and the SenseEval (Edmonds and Cotton, 2001; Snyder and Palmer, 2004) / SemEval (Pradhan et al., 2007; Navigli et al., 2013; Moro and Navigli, 2015) suite for evaluation (overall 7253 annotated examples), following Raganato et al. (2017). For each word in both training and test sets, we change its fine-grained sense label to its corresponding WordNet supersense, and therefore train the network to predict a given word's supersense. We name this Supersense disambiguation task SemEval-SS. See figure 4(a) for an example"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4662"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    394,
                    256,
                    2091,
                    599
                ],
                "angle": 0,
                "content": "<table><tr><td></td><td>SemEval-SS Frozen</td><td>SemEval-SS Fine-tuned</td><td>Word in Context</td></tr><tr><td>BERTBASE</td><td>65.1</td><td>79.2</td><td>-</td></tr><tr><td>BERTLARGE</td><td>67.3</td><td>81.1</td><td>69.6</td></tr><tr><td>SenseBERTBASE</td><td>75.6</td><td>83.0</td><td>70.3</td></tr><tr><td>SenseBERTLARGE</td><td>79.5</td><td>83.7</td><td>72.1</td></tr></table>",
                "caption": "Table 2: Results on a supersense variant of the SemEval WSD test set standardized in Raganato et al. (2017), which we denote SemEval-SS, and on the Word in Context (WiC) dataset (Pilehvar and Camacho-Collados, 2019) included in the recently introduced SuperGLUE benchmark (Wang et al., 2019). These tasks require a high level of lexical semantic understanding, as can be seen in the examples in figure 4. For both tasks, SenseBERT demonstrates a clear improvement over BERT in the regular fine-tuning setup, where network weights are modified during training on the task. Notably, SenseBERT<sub>LARGE</sub> achieves state of the art performance on the WiC task. In the SemEval-SS Frozen setting, we train a linear classifier over pretrained embeddings, without changing the network weights. The results show that SenseBERT introduces a dramatic improvement in this setting, implying that its word-sense aware pre-training (section 3) yields embeddings that carries lexical semantic information which is easily extractable for the benefits of downstream tasks. Results for BERT on the SemEval-SS task are attained by employing the published pre-trained BERT models, and the BERT<sub>LARGE</sub> result on WiC is taken from the baseline scores published on the SuperGLUE benchmark (Wang et al., 2019) (no result has been published for BERT<sub>BASE</sub>)."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    292,
                    1329,
                    1230,
                    1789
                ],
                "angle": 0,
                "content": "<table><tr><td></td><td>Word in Context</td></tr><tr><td>ELMo†</td><td>57.7</td></tr><tr><td>BERT sense embeddings ††</td><td>67.7</td></tr><tr><td>BERTLARGE‡</td><td>69.6</td></tr><tr><td>RoBERTa‡‡</td><td>69.9</td></tr><tr><td>KnowBERT-W+W◇</td><td>70.9</td></tr><tr><td>SenseBERT</td><td>72.1</td></tr></table>",
                "caption": "Table 3: Test set results for the WiC dataset."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    295,
                    1869,
                    977,
                    1918
                ],
                "angle": 0,
                "content": "†Pilehvar and Camacho-Collados (2019)"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    295,
                    1918,
                    769,
                    1967
                ],
                "angle": 0,
                "content": "††Loureiro and Jorge (2019)"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    295,
                    1971,
                    625,
                    2020
                ],
                "angle": 0,
                "content": "\\(\\ddagger\\)Wang et al. (2019)"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    295,
                    2020,
                    605,
                    2066
                ],
                "angle": 0,
                "content": "\\(\\S \\ddagger\\) Liu et al. (2019)"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    295,
                    2069,
                    632,
                    2118
                ],
                "angle": 0,
                "content": "Peters et al. (2019)"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    287,
                    2224,
                    796,
                    2269
                ],
                "angle": 0,
                "content": "from this modified data set."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2283,
                    1215,
                    2901
                ],
                "angle": 0,
                "content": "We show results on the SemEval-SS task for two different training schemes. In the first, we trained a linear classifier over the 'frozen' output embeddings of the examined model – we do not change the the trained SenseBERT's parameters in this scheme. This Frozen setting is a test for the amount of basic lexical semantics readily present in the pre-trained model, easily extricable by further downstream tasks (reminiscent of the semantic probes employed in Hewitt and Manning (2019); Reif et al. (2019)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    285,
                    2911,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "In the second training scheme we fine-tuned the examined model on the task, allowing its parameters to change during training (see full training details in the supplementary materials). Results attained by employing this training method reflect"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    1340,
                    2193,
                    1452
                ],
                "angle": 0,
                "content": "the model's potential to acquire word-supersense information given its pre-training."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    1459,
                    2198,
                    2308
                ],
                "angle": 0,
                "content": "Table 2 shows a comparison between vanilla BERT and SenseBERT on the supersense disambiguation task. Our semantic level pretraining signal clearly yields embeddings with enhanced word-meaning awareness, relative to embeddings trained with BERT's vanilla word-level signal. SenseBERT<sub>BASE</sub> improves the score of BERT<sub>BASE</sub> in the Frozen setting by over 10 points and SenseBERT<sub>LARGE</sub> improves that of BERT<sub>LARGE</sub> by over 12 points, demonstrating competitive results even without fine-tuning. In the setting of model fine-tuning, we see a clear demonstration of the model's ability to learn word-level semantics, as SenseBERT<sub>BASE</sub> surpasses the score of BERT<sub>LARGE</sub> by 2 points."
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    1267,
                    2371,
                    1947,
                    2424
                ],
                "angle": 0,
                "content": "5.3 Word in Context (WiC) Task"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1262,
                    2459,
                    2198,
                    3192
                ],
                "angle": 0,
                "content": "We test our model on the recently introduced WiC binary classification task. Each instance in WiC has a target word \\( w \\) for which two contexts are provided, each invoking a specific meaning of \\( w \\). The task is to determine whether the occurrences of \\( w \\) in the two contexts share the same meaning or not, clearly requiring an ability to identify the word's semantic category. The WiC task is defined over supersenses (Pilehvar and Camacho-Collados, 2019) – the negative examples include a word used in two different supersenses and the positive ones include a word used in the same supersense. See figure 4(b) for an example from this data set."
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4663"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    359,
                    256,
                    2128,
                    442
                ],
                "angle": 0,
                "content": "<table><tr><td></td><td>Score</td><td>CoLA</td><td>SST-2</td><td>MRPC</td><td>STS-B</td><td>QQP</td><td>MNLI</td><td>QNLI</td><td>RTE</td></tr><tr><td>BERTBASE (OURS)</td><td>77.5</td><td>50.1</td><td>92.6</td><td>88.7/84.3</td><td>85.7/84.6</td><td>71.0/88.9</td><td>83.6</td><td>89.4</td><td>67.9</td></tr><tr><td>SenseBERTBASE</td><td>77.9</td><td>54.6</td><td>92.2</td><td>89.2/85.2</td><td>83.5/82.3</td><td>70.3/88.8</td><td>83.6</td><td>90.6</td><td>67.5</td></tr></table>",
                "caption": "Table 4: Results on the GLUE benchmark test set."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    634,
                    1223,
                    1031
                ],
                "angle": 0,
                "content": "Results on the WiC task comparing SenseBERT to vanilla BERT are shown in table 2. SenseBERT<sub>BASE</sub> surpasses a larger vanilla model, BERT<sub>LARGE</sub>. As shown in table 3, a single SenseBERT<sub>LARGE</sub> model achieves the state of the art score in this task, demonstrating unprecedented lexical semantic awareness."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1101,
                    535,
                    1150
                ],
                "angle": 0,
                "content": "5.4 GLUE"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1192,
                    1223,
                    2213
                ],
                "angle": 0,
                "content": "The General Language Understanding Evaluation (GLUE; Wang et al. (2018)) benchmark is a popular testbed for language understanding models. It consists of 9 different NLP tasks, covering different linguistic phenomena. We evaluate our model on GLUE, in order to verify that SenseBERT gains its lexical semantic knowledge without compromising performance on other downstream tasks. Due to slight differences in the data used for pretraining BERT and SenseBERT (BookCorpus is not publicly available), we trained a \\(\\mathrm{BERT}_{\\mathrm{BASE}}\\) model with the same data used for our models. \\(\\mathrm{BERT}_{\\mathrm{BASE}}\\) and \\(\\mathrm{SenseBERT}_{\\mathrm{BASE}}\\) were both finetuned using the exact same procedures and hyperparameters. The results are presented in table 4. Indeed, SenseBERT performs on par with BERT, achieving an overall score of 77.9, compared to 77.5 achieved by \\(\\mathrm{BERT}_{\\mathrm{BASE}}\\)."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    287,
                    2287,
                    617,
                    2343
                ],
                "angle": 0,
                "content": "6 Conclusion"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2402,
                    1220,
                    3195
                ],
                "angle": 0,
                "content": "We introduce lexical semantic information into a neural language model's pre-training objective. This results in a boosted word-level semantic awareness of the resultant model, named SenseBERT, which considerably outperforms a vanilla BERT on a SemEval based Supersense Disambiguation task and achieves state of the art results on the Word in Context task. This improvement was obtained without human annotation, but rather by harnessing an external linguistic knowledge source. Our work indicates that semantic signals extending beyond the lexical level can be similarly introduced at the pre-training stage, allowing the network to elicit further insight without human supervision."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    1270,
                    631,
                    1679,
                    687
                ],
                "angle": 0,
                "content": "Acknowledgments"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    726,
                    2198,
                    950
                ],
                "angle": 0,
                "content": "We acknowledge useful comments and assistance from our colleagues at AI21 Labs. We would also like to thank the anonymous reviewers for their valuable feedback."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    1270,
                    1052,
                    1515,
                    1101
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1133,
                    2200,
                    1368
                ],
                "angle": 0,
                "content": "Sanjeev Arora, Yuanzhi Li, Yingyu Liang, Tengyu Ma, and Andrej Risteski. 2018. Linear algebraic structure of word senses, with applications to polysemy. Transactions of the Association for Computational Linguistics, 6:483-495."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1410,
                    2200,
                    1641
                ],
                "angle": 0,
                "content": "Pierpaolo Basile. 2012. Super-sense tagging using support vector machines and distributional features. In International Workshop on Evaluation of Natural Language and Speech Tool for Italian, pages 176-185. Springer."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1680,
                    2200,
                    1869
                ],
                "angle": 0,
                "content": "William Chan, Nikita Kitaev, Kelvin Guu, Mitchell Stern, and Jakob Uszkoreit. 2019. KERMIT: Generative insertion-based modeling for sequences. arXiv preprint arXiv:1906.01604."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1908,
                    2200,
                    2188
                ],
                "angle": 0,
                "content": "Xinxiong Chen, Zhiyuan Liu, and Maosong Sun. 2014. A unified model for word sense representation and disambiguation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1025-1035, Doha, Qatar. Association for Computational Linguistics."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2227,
                    2200,
                    2459
                ],
                "angle": 0,
                "content": "Massimiliano Ciaramita and Mark Johnson. 2003. Supersense tagging of unknown nouns in WordNet. In Proceedings of the 2003 Conference on Empirical Methods in Natural Language Processing, pages 168-175."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2501,
                    2200,
                    2918
                ],
                "angle": 0,
                "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of deep bidirectional transformers for language understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4171-4186, Minneapolis, Minnesota. Association for Computational Linguistics."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2957,
                    2200,
                    3195
                ],
                "angle": 0,
                "content": "Philip Edmonds and Scott Cotton. 2001. SENSEVAL-2: Overview. In Proceedings of SENSEVAL-2 Second International Workshop on Evaluating Word Sense Disambiguation Systems, pages 1-5, Toulouse, France. Association for Computational Linguistics."
            },
            {
                "block_id": 17,
                "type": "list",
                "bbox": [
                    1270,
                    1133,
                    2200,
                    3195
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 18,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4664"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1218,
                    638
                ],
                "angle": 0,
                "content": "John Hewitt and Christopher D. Manning. 2019. A structural probe for finding syntax in word representations. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4129-4138, Minneapolis, Minnesota. Association for Computational Linguistics."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    677,
                    1220,
                    1010
                ],
                "angle": 0,
                "content": "Ignacio Iacobacci, Mohammad Taher Pilehvar, and Roberto Navigli. 2016. Embeddings for word sense disambiguation: An evaluation study. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 897-907, Berlin, Germany. Association for Computational Linguistics."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    1041,
                    1220,
                    1189
                ],
                "angle": 0,
                "content": "Hakan Inan, Khashayar Khosravi, and Richard Socher. 2017. Tying word vectors and word classifiers: A loss framework for language modeling. In ICLR."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    1224,
                    1220,
                    1322
                ],
                "angle": 0,
                "content": "Adam Kilgarriff. 1997. I don't believe in word senses. Computers and the Humanities, 31(2):91-113."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1361,
                    1220,
                    1641
                ],
                "angle": 0,
                "content": "Minh Le, Marten Postma, Jacopo Urbani, and Piek Vossen. 2018. A deep dive into word sense disambiguation with LSTM. In Proceedings of the 27th International Conference on Computational Linguistics, pages 354-365, Santa Fe, New Mexico, USA. Association for Computational Linguistics."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1680,
                    1220,
                    1915
                ],
                "angle": 0,
                "content": "Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. 2019. RoBERTa: A robustly optimized bert pretraining approach. arXiv preprint arXiv:1907.11692."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1953,
                    1218,
                    2280
                ],
                "angle": 0,
                "content": "Daniel Loureiro and Alípio Jorge. 2019. Language modelling makes sense: Propagating representations through WordNet for full-coverage word sense disambiguation. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 5682–5691, Florence, Italy. Association for Computational Linguistics."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    2318,
                    1220,
                    2504
                ],
                "angle": 0,
                "content": "Leland McInnes, John Healy, and James Melville. 2018. UMAP: Uniform manifold approximation and projection for dimension reduction. arXiv preprint arXiv:1802.03426."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2546,
                    1220,
                    2781
                ],
                "angle": 0,
                "content": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in Neural Information Processing Systems 26, pages 3111-3119. Curran Associates, Inc."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2820,
                    1220,
                    2915
                ],
                "angle": 0,
                "content": "George A Miller. 1998. WordNet: An electronic lexical database. MIT press."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2957,
                    1220,
                    3188
                ],
                "angle": 0,
                "content": "George A. Miller, Claudia Leacock, Randee Tengi, and Ross T. Bunker. 1993. A semantic concordance. In Human Language Technology: Proceedings of a Workshop Held at Plainsboro, New Jersey, March 21-24, 1993."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1220,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2198,
                    547
                ],
                "angle": 0,
                "content": "Andrea Moro and Roberto Navigli. 2015. SemEval-2015 task 13: Multilingual all-words sense disambiguation and entity linking. In Proceedings of the 9th International Workshop on Semantic Evaluation (SemEval 2015), pages 288-297, Denver, Colorado. Association for Computational Linguistics."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1272,
                    575,
                    2195,
                    673
                ],
                "angle": 0,
                "content": "Roberto Navigli. 2009. Word sense disambiguation: A survey. ACM Comput. Surv., 41(2)."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1272,
                    701,
                    2198,
                    1073
                ],
                "angle": 0,
                "content": "Roberto Navigli, David Jurgens, and Daniele Vannella. 2013. SemEval-2013 task 12: Multilingual word sense disambiguation. In Second Joint Conference on Lexical and Computational Semantics (*SEM), Volume 2: Proceedings of the Seventh International Workshop on Semantic Evaluation (SemEval 2013), pages 222–231, Atlanta, Georgia, USA. Association for Computational Linguistics."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1098,
                    2198,
                    1378
                ],
                "angle": 0,
                "content": "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1532-1543, Doha, Qatar. Association for Computational Linguistics."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1406,
                    2198,
                    1824
                ],
                "angle": 0,
                "content": "Matthew Peters, Mark Neumann, Mohit Iyyer, Matt Gardner, Christopher Clark, Kenton Lee, and Luke Zettlemoyer. 2018. Deep contextualized word representations. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers), pages 2227-2237, New Orleans, Louisiana. Association for Computational Linguistics."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1852,
                    2198,
                    2269
                ],
                "angle": 0,
                "content": "Matthew E. Peters, Mark Neumann, Robert Logan, Roy Schwartz, Vidur Joshi, Sameer Singh, and Noah A. Smith. 2019. Knowledge enhanced contextual word representations. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 43-54, Hong Kong, China. Association for Computational Linguistics."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2297,
                    2198,
                    2711
                ],
                "angle": 0,
                "content": "Mohammad Taher Pilehvar and Jose Camacho-Collados. 2019. WiC: the word-in-context dataset for evaluating context-sensitive meaning representations. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 1267-1273, Minneapolis, Minnesota. Association for Computational Linguistics."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2743,
                    2198,
                    3065
                ],
                "angle": 0,
                "content": "Sameer Pradhan, Edward Loper, Dmitriy Dligach, and Martha Palmer. 2007. SemEval-2007 task-17: English lexical sample, SRL and all words. In Proceedings of the Fourth International Workshop on Semantic Evaluations (SemEval-2007), pages 87-92, Prague, Czech Republic. Association for Computational Linguistics."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    3094,
                    2198,
                    3192
                ],
                "angle": 0,
                "content": "Ofir Press and Lior Wolf. 2017. Using the output embedding to improve language models. In Proceedings"
            },
            {
                "block_id": 21,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2198,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 22,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4665"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    334,
                    270,
                    1218,
                    456
                ],
                "angle": 0,
                "content": "of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 2, Short Papers, pages 157-163, Valencia, Spain. Association for Computational Linguistics."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    292,
                    491,
                    1215,
                    631
                ],
                "angle": 0,
                "content": "Alec Radford, Jeffrey Wu, Rewon Child, David Luan, Dario Amodei, and Ilya Sutskever. 2019. Language models are unsupervised multitask learners."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    292,
                    666,
                    1218,
                    1034
                ],
                "angle": 0,
                "content": "Alessandro Raganato, Jose Camacho-Collados, and Roberto Navigli. 2017. Word sense disambiguation: A unified evaluation framework and empirical comparison. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 1, Long Papers, pages 99-110, Valencia, Spain. Association for Computational Linguistics."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    292,
                    1073,
                    1215,
                    1347
                ],
                "angle": 0,
                "content": "Emily Reif, Ann Yuan, Martin Wattenberg, Fernanda B Viegas, Andy Coenen, Adam Pearce, and Been Kim. 2019. Visualizing and measuring the geometry of BERT. In Advances in Neural Information Processing Systems 32, pages 8594-8603. Curran Associates, Inc."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    292,
                    1385,
                    1218,
                    1757
                ],
                "angle": 0,
                "content": "Sascha Rothe and Hinrich Schütze. 2015. AutoExtend: Extending word embeddings to embeddings for synsets and lexemes. In Proceedings of the 53rd Annual Meeting of the Association for Computational Linguistics and the 7th International Joint Conference on Natural Language Processing (Volume 1: Long Papers), pages 1793-1803, Beijing, China. Association for Computational Linguistics."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    292,
                    1792,
                    1215,
                    1932
                ],
                "angle": 0,
                "content": "Nathan Schneider. 2014. Lexical semantic analysis in natural language text. Unpublished Doctoral Dissertation, Carnegie Mellon University."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    292,
                    1967,
                    1215,
                    2294
                ],
                "angle": 0,
                "content": "Nathan Schneider and Noah A. Smith. 2015. A corpus and model integrating multiword expressions and supersenses. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, pages 1537-1547, Denver, Colorado. Association for Computational Linguistics."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    292,
                    2329,
                    1215,
                    2606
                ],
                "angle": 0,
                "content": "Benjamin Snyder and Martha Palmer. 2004. The English all-words task. In Proceedings of SENSEVAL-3, the Third International Workshop on the Evaluation of Systems for the Semantic Analysis of Text, pages 41-43, Barcelona, Spain. Association for Computational Linguistics."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    292,
                    2641,
                    1215,
                    2915
                ],
                "angle": 0,
                "content": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N Gomez, Łukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In Advances in Neural Information Processing Systems 30, pages 5998-6008. Curran Associates, Inc."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    292,
                    2957,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": "Alex Wang, Yada Pruksachatkun, Nikita Nangia, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel Bowman. 2019. SuperGLUE: A stickier benchmark for general-purpose language understanding systems. In Advances in Neural Information"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1314,
                    270,
                    2190,
                    361
                ],
                "angle": 0,
                "content": "Processing Systems 32, pages 3266-3280. Curran Associates, Inc."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1272,
                    396,
                    2195,
                    764
                ],
                "angle": 0,
                "content": "Alex Wang, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel Bowman. 2018. GLUE: A multi-task benchmark and analysis platform for natural language understanding. In Proceedings of the 2018 EMNLP Workshop BlackboxNLP: Analyzing and Interpreting Neural Networks for NLP, pages 353-355, Brussels, Belgium. Association for Computational Linguistics."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1270,
                    799,
                    2195,
                    1073
                ],
                "angle": 0,
                "content": "Zhilin Yang, Zihang Dai, Yiming Yang, Jaime Carbonell, Russ R Salakhutdinov, and Quoc V Le. 2019. XLNet: Generalized autoregressive pretraining for language understanding. In Advances in Neural Information Processing Systems 32, pages 5753-5763. Curran Associates, Inc."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1270,
                    1112,
                    2195,
                    1434
                ],
                "angle": 0,
                "content": "Dayu Yuan, Julian Richardson, Ryan Doherty, Colin Evans, and Eric Altendorf. 2016. Semi-supervised word sense disambiguation with neural models. In Proceedings of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers, pages 1374-1385, Osaka, Japan. The COLING 2016 Organizing Committee."
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    1270,
                    1518,
                    2185,
                    1627
                ],
                "angle": 0,
                "content": "A Supersenses and Their Representation in SenseBERT"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    1666,
                    2195,
                    2231
                ],
                "angle": 0,
                "content": "We present in table 5 a comprehensive list of WordNet supersenses, as they appear in the WordNet documentation. In fig. 5 we present a Dendrogram of an Agglomerative hierarchical clustering over the supersense embedding vectors learned by SenseBERT in pre-training. The clustering shows a clear separation between Noun senses and Verb senses. Furthermore, we can observe that semantically related supersenses are clustered together (i.e, noun.animal and noun.plant)."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1270,
                    2269,
                    1709,
                    2329
                ],
                "angle": 0,
                "content": "B Training Details"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    2364,
                    2193,
                    2638
                ],
                "angle": 0,
                "content": "As hyperparameters for the fine-tuning, we used max_seq_length = 128, chose learning rates from \\(\\{5e - 6, 1e - 5, 2e - 5, 3e - 5, 5e - 5\\}\\), batch sizes from \\(\\{16, 32\\}\\), and fine-tuned up to 10 epochs for all the datasets."
            },
            {
                "block_id": 18,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4666"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    312,
                    298,
                    2165,
                    915
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 5: Dendrogram visualization of an Agglomerative hierarchical clustering over the supersense vectors (rows of the classifier S) learned by SenseBERT."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    300,
                    1157,
                    2195,
                    3048
                ],
                "angle": 0,
                "content": "<table><tr><td>Name</td><td>Content</td><td>Name</td><td>Content</td></tr><tr><td>adj.all</td><td>All adjective clusters</td><td>nounquantity</td><td>Nouns denoting quantities and units of measure</td></tr><tr><td>adj.pert</td><td>Relational adjectives (pertainyms)</td><td>nounrelation</td><td>Nouns denoting relations between people or things or ideas</td></tr><tr><td>adv.all</td><td>All adverbs</td><td>noun.shape</td><td>Nouns denoting two and three dimensional shapes</td></tr><tr><td>noun.Tops</td><td>Unique beginner for nouns</td><td>noun.state</td><td>Nouns denoting stable states of affairs</td></tr><tr><td>noun.act</td><td>Nouns denoting acts or actions</td><td>noun.substance</td><td>Nouns denoting substances</td></tr><tr><td>noun.animal</td><td>Nouns denoting animals</td><td>noun.time</td><td>Nouns denoting time and temporal relations</td></tr><tr><td>noun.artifact</td><td>Nouns denoting man-made objects</td><td>verb.body</td><td>Verbs of grooming, dressing and bodily care</td></tr><tr><td>noun(attribute)</td><td>Nouns denoting attributes of people and objects</td><td>verb/change</td><td>Verbs of size, temperature change, intensifying, etc.</td></tr><tr><td>noun.body</td><td>Nouns denoting body parts</td><td>verb.cognition</td><td>Verbs of thinking, judging, analyzing, doubting</td></tr><tr><td>noun.cognition</td><td>Nouns denoting cognitive processes and contents</td><td>verb.communication</td><td>Verbs of telling, asking, ordering, singing</td></tr><tr><td>noun.communication</td><td>Nouns denoting communicative processes and contents</td><td>verbcompetition</td><td>Verbs of fighting, athletic activities</td></tr><tr><td>noun.event</td><td>Nouns denoting natural events</td><td>verbconsumption</td><td>Verbs of eating and drinking</td></tr><tr><td>noun feelsing</td><td>Nouns denoting feelings and emotions</td><td>verb(contact</td><td>Verbs of touching, hitting, tying, digging</td></tr><tr><td>noun.food</td><td>Nouns denoting foods and drinks</td><td>verb creation</td><td>Verbs of sewing, baking, painting, performing</td></tr><tr><td>noun.group</td><td>Nouns denoting groupings of people or objects</td><td>verbemotion</td><td>Verbs of feeling</td></tr><tr><td>noun.location</td><td>Nouns denoting spatial position</td><td>verb.motion</td><td>Verbs of walking, flying, swimming</td></tr><tr><td>noun.motive</td><td>Nouns denoting goals</td><td>verb.perception</td><td>Verbs of seeing, hearing, feeling</td></tr><tr><td>noun.object</td><td>Nouns denoting natural objects (not man-made)</td><td>verb.possession</td><td>Verbs of buying, selling, owning</td></tr><tr><td>noun.person</td><td>Nouns denoting people</td><td>verb/social</td><td>Verbs of political and social activities and events</td></tr><tr><td>noun.phenomenon</td><td>Nouns denoting natural phenomena</td><td>verb.stative</td><td>Verbs of being, having, spatial relations</td></tr><tr><td>noun.plant</td><td>Nouns denoting plants</td><td>verb weather</td><td>Verbs of raining, snowing, thawing, thundering</td></tr><tr><td>noun.possession</td><td>Nouns denoting possession and transfer of possession</td><td>adj.ppl</td><td>Participial adjectives</td></tr><tr><td>noun-process</td><td>Nouns denoting natural processes</td><td></td><td></td></tr></table>",
                "caption": "Table 5: A list of supersense categories from WordNet lexicographer."
            },
            {
                "block_id": 4,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4667"
            }
        ]
    }
]