[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    396,
                    284,
                    2091,
                    350
                ],
                "angle": 0,
                "content": "ERASER: A Benchmark to Evaluate Rationalized NLP Models"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    436,
                    417,
                    2059,
                    554
                ],
                "angle": 0,
                "content": "Jay DeYoung\\*, Sarthak Jain\\*, Nazneen Fatema Rajani\\*, Eric Lehman\\*, Caiming Xiong\\*, Richard Socher\\*, and Byron C. Wallace"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    1042,
                    606,
                    1453,
                    666
                ],
                "angle": 0,
                "content": "*Equal contribution."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    590,
                    673,
                    1905,
                    740
                ],
                "angle": 0,
                "content": "\\(\\Psi\\) Khoury College of Computer Sciences, Northeastern University"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    801,
                    747,
                    1692,
                    799
                ],
                "angle": 0,
                "content": "\\(\\Phi\\) Salesforce Research, Palo Alto, CA, 94301"
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    654,
                    929,
                    850,
                    978
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    352,
                    1006,
                    1151,
                    2353
                ],
                "angle": 0,
                "content": "State-of-the-art models in NLP are now predominantly based on deep neural networks that are opaque in terms of how they come to make predictions. This limitation has increased interest in designing more interpretable deep models for NLP that reveal the 'reasoning' behind model outputs. But work in this direction has been conducted on different datasets and tasks with correspondingly unique aims and metrics; this makes it difficult to track progress. We propose the Evaluating Rationales And Simple English Reasoning (ERASER) benchmark to advance research on interpretable models in NLP. This benchmark comprises multiple datasets and tasks for which human annotations of \"rationales\" (supporting evidence) have been collected. We propose several metrics that aim to capture how well the rationales provided by models align with human rationales, and also how faithful these rationales are (i.e., the degree to which provided rationales influenced the corresponding predictions). Our hope is that releasing this benchmark facilitates progress on designing more interpretable NLP systems. The benchmark, code, and documentation are available at https://www.eraserbenchmark.com/"
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    290,
                    2381,
                    650,
                    2434
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2459,
                    1220,
                    3192
                ],
                "angle": 0,
                "content": "Interest has recently grown in designing NLP systems that can reveal why models make specific predictions. But work in this direction has been conducted on different datasets and using different metrics to quantify performance; this has made it difficult to compare methods and track progress. We aim to address this issue by releasing a standardized benchmark of datasets — repurposed and augmented from pre-existing corpora, spanning a range of NLP tasks — and associated metrics for measuring different properties of rationales. We refer to this as the Evaluating Rationales And Simple English Reasoning (ERASER) benchmark."
            },
            {
                "block_id": 9,
                "type": "image",
                "bbox": [
                    1419,
                    929,
                    2051,
                    1750
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: Examples of instances, labels, and rationales illustrative of four (out of seven) datasets included in ERASER. The 'erased' snippets are rationales."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    2052,
                    2200,
                    2785
                ],
                "angle": 0,
                "content": "In curating and releasing ERASER we take inspiration from the stickiness of the GLUE (Wang et al., 2019b) and SuperGLUE (Wang et al., 2019a) benchmarks for evaluating progress in natural language understanding tasks, which have driven rapid progress on models for general language representation learning. We believe the still somewhat nascent subfield of interpretable NLP stands to benefit similarly from an analogous collection of standardized datasets and tasks; we hope these will aid the design of standardized metrics to measure different properties of 'interpretability', and we propose a set of such metrics as a starting point."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1262,
                    2799,
                    2200,
                    3195
                ],
                "angle": 0,
                "content": "Interpretability is a broad topic with many possible realizations (Doshi-Velez and Kim, 2017; Lipton, 2016). In ERASER we focus specifically on rationales, i.e., snippets that support outputs. All datasets in ERASER include such rationales, explicitly marked by human annotators. By definition, rationales should be sufficient to make predictions,"
            },
            {
                "block_id": 13,
                "type": "page_number",
                "bbox": [
                    1190,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4443"
            },
            {
                "block_id": 14,
                "type": "footer",
                "bbox": [
                    416,
                    3301,
                    2056,
                    3399
                ],
                "angle": 0,
                "content": "Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics, pages 4443-4458 July 5 - 10, 2020. ©2020 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    263,
                    1220,
                    487
                ],
                "angle": 0,
                "content": "but they may not be comprehensive. Therefore, for some datasets, we have also collected comprehensive rationales (in which all evidence supporting an output has been marked) on test instances."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    491,
                    1223,
                    1504
                ],
                "angle": 0,
                "content": "The 'quality' of extracted rationales will depend on their intended use. Therefore, we propose an initial set of metrics to evaluate rationales that are meant to measure different varieties of 'interpretability'. Broadly, this includes measures of agreement with human-provided rationales, and assessments of faithfulness. The latter aim to capture the extent to which rationales provided by a model in fact informed its predictions. We believe these provide a reasonable start, but view the problem of designing metrics for evaluating rationales — especially for measuring faithfulness — as a topic for further research that ERASER can facilitate. And while we will provide a 'leaderboard', this is better viewed as a 'results board'; we do not privilege any one metric. Instead, ERASER permits comparison between models that provide rationales with respect to different criteria of interest."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1511,
                    1215,
                    2073
                ],
                "angle": 0,
                "content": "We implement baseline models and report their performance across the corpora in ERASER. We find that no single 'off-the-shelf' architecture is readily adaptable to datasets with very different instance lengths and associated rationale snippets (Section 3). This highlights a need for new models that can consume potentially lengthy inputs and adaptively provide rationales at a task-appropriate level of granularity. ERASER provides a resource to develop such models."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    2083,
                    1223,
                    2588
                ],
                "angle": 0,
                "content": "In sum, we introduce the ERASER benchmark (www.eraserbenchmark.com), a unified set of diverse NLP datasets (these are repurposed and augmented from existing corpora,\\(^{1}\\) including sentiment analysis, Natural Language Inference, and QA tasks, among others) in a standardized format featuring human rationales for decisions, along with starter code and tools, baseline models, and standardized (initial) metrics for rationales."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    287,
                    2616,
                    677,
                    2669
                ],
                "angle": 0,
                "content": "2 Related Work"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2701,
                    1218,
                    2981
                ],
                "angle": 0,
                "content": "Interpretability in NLP is a large, fast-growing area; we do not attempt to provide a comprehensive overview here. Instead we focus on directions particularly relevant to ERASER, i.e., prior work on models that provide rationales for their predictions."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    287,
                    2999,
                    1215,
                    3055
                ],
                "angle": 0,
                "content": "Learning to explain. In ERASER we assume that"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2195,
                    547
                ],
                "angle": 0,
                "content": "rationales (marked by humans) are provided during training. However, such direct supervision will not always be available, motivating work on methods that can explain (or \"rationalize\") model predictions using only instance-level supervision."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1262,
                    547,
                    2198,
                    1392
                ],
                "angle": 0,
                "content": "In the context of modern neural models for text classification, one might use variants of attention (Bahdanau et al., 2015) to extract rationales. Attention mechanisms learn to assign soft weights to (usually contextualized) token representations, and so one can extract highly weighted tokens as rationales. However, attention weights do not in general provide faithful explanations for predictions (Jain and Wallace, 2019; Serrano and Smith, 2019; Wiegreffe and Pinter, 2019; Zhong et al., 2019; Pruthi et al., 2020; Brunner et al., 2020; Moradi et al., 2019; Vashisth et al., 2019). This likely owes to encoders entangling inputs, complicating the interpretation of attention weights on inputs over contextualized representations of the same."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    1396,
                    2200,
                    1960
                ],
                "angle": 0,
                "content": "By contrast, hard attention mechanisms discretely extract snippets from the input to pass to the classifier, by construction providing faithful explanations. Recent work has proposed hard attention mechanisms as a means of providing explanations. Lei et al. (2016) proposed instantiating two models with their own parameters; one to extract rationales, and one that consumes these to make a prediction. They trained these models jointly via REINFORCE (Williams, 1992) style optimization."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    1964,
                    2198,
                    2694
                ],
                "angle": 0,
                "content": "Recently, Jain et al. (2020) proposed a variant of this two-model setup that uses heuristic feature scores to derive pseudo-labels on tokens comprising rationales; one model can then be used to perform hard extraction in this way, while a second (independent) model can make predictions on the basis of these. Elsewhere, Chang et al. (2019) introduced the notion of classwise rationales that explains support for different output classes using a game theoretic framework. Finally, other recent work has proposed using a differentiable binary mask over inputs, which also avoids recourse to REINFORCE (Bastings et al., 2019)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2711,
                    2198,
                    2936
                ],
                "angle": 0,
                "content": "Post-hoc explanation. Another strand of interpretability work considers post-hoc explanation methods, which seek to explain why a model made a specific prediction for a given input. Commonly"
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    2974,
                    2200,
                    3185
                ],
                "angle": 0,
                "content": "<sup>2</sup>Interestingly, Zhong et al. (2019) find that attention sometimes provides plausible but not faithful rationales. Elsewhere, Pruthi et al. (2020) show that one can easily learn to deceive via attention weights. These findings highlight that one should be mindful of the criteria one wants rationales to fulfill."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3097,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "<sup>1</sup>We ask users of the benchmark to cite all original papers, and provide a BibTeX entry for doing so on the website."
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4444"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    263,
                    1215,
                    655
                ],
                "angle": 0,
                "content": "these take the form of token-level importance scores. Gradient-based explanations are a standard example (Sundararajan et al., 2017; Smilkov et al., 2017). These enjoy a clear semantics (describing how perturbing inputs locally affects outputs), but may nonetheless exhibit counterintuitive behaviors (Feng et al., 2018)."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    663,
                    1215,
                    1115
                ],
                "angle": 0,
                "content": "Gradients of course assume model differentiability. Other methods do not require any model properties. Examples include LIME (Ribeiro et al., 2016) and Alvarez-Melis and Jaakkola (2017); these methods approximate model behavior locally by having it repeatedly make predictions over perturbed inputs and fitting a simple, explainable model over the outputs."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1136,
                    1215,
                    1810
                ],
                "angle": 0,
                "content": "Acquiring rationales. Aside from interpretability considerations, collecting rationales from annotators may afford greater efficiency in terms of model performance realized given a fixed amount of annotator effort (Zaidan and Eisner, 2008). In particular, recent work by McDonnell et al. (2017, 2016) has observed that at least for some tasks, asking annotators to provide rationales justifying their categorizations does not impose much additional effort. Combining rationale annotation with active learning (Settles, 2012) is another promising direction (Wallace et al., 2010; Sharma et al., 2015)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1831,
                    1215,
                    2392
                ],
                "angle": 0,
                "content": "Learning from rationales. Work on learning from rationales marked by annotators for text classification dates back over a decade (Zaidan et al., 2007). Earlier efforts proposed extending standard discriminative models like Support Vector Machines (SVMs) with regularization terms that penalized parameter estimates which disagreed with provided rationales (Zaidan et al., 2007; Small et al., 2011). Other efforts have attempted to specify generative models of rationales (Zaidan and Eisner, 2008)."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2402,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "More recent work has aimed to exploit rationales in training neural text classifiers. Zhang et al. (2016) proposed a rationale-augmented Convolutional Neural Network (CNN) for text classification, explicitly trained to identify sentences supporting categorizations. Strout et al. (2019) showed that providing this model with rationales during training yields predicted rationales that are preferred by humans (compared to rationales produced without explicit supervision). Other work has proposed 'pipeline' approaches in which independent models are trained to perform rationale extraction and classification on the basis of these, respectively (Lehman et al., 2019; Chen et al., 2019), assuming"
            },
            {
                "block_id": 5,
                "type": "table",
                "bbox": [
                    1285,
                    256,
                    2178,
                    613
                ],
                "angle": 0,
                "content": "<table><tr><td>Name</td><td>Size (train/dev/test)</td><td>Tokens</td><td>Comp?</td></tr><tr><td>Evidence Inference</td><td>7958 / 972 / 959</td><td>4761</td><td>◇</td></tr><tr><td>BoolQ</td><td>6363 / 1491 / 2817</td><td>3583</td><td>◇</td></tr><tr><td>Movie Reviews</td><td>1600 / 200 / 200</td><td>774</td><td>◆</td></tr><tr><td>FEVER</td><td>97957 / 6122 / 6111</td><td>327</td><td>✓</td></tr><tr><td>MultiRC</td><td>24029 / 3214 / 4848</td><td>303</td><td>✓</td></tr><tr><td>CoS-E</td><td>8733 / 1092 / 1092</td><td>28</td><td>✓</td></tr><tr><td>e-SNLI</td><td>911938 / 16449 / 16429</td><td>16</td><td>✓</td></tr></table>"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    648,
                    2195,
                    1055
                ],
                "angle": 0,
                "content": "Table 1: Overview of datasets in the ERASER benchmark. Tokens is the average number of tokens in each document. Comprehensive rationales mean that all supporting evidence is marked; \\(\\checkmark\\) denotes cases where this is (more or less) true by default; \\(\\diamond\\), \\(\\spadesuit\\) are datasets for which we have collected comprehensive rationales for either a subset or all of the test datasets, respectively. Additional information can be found in Appendix A."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1108,
                    2146,
                    1161
                ],
                "angle": 0,
                "content": "explicit training data is available for the former."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    1164,
                    2193,
                    1445
                ],
                "angle": 0,
                "content": "Rajani et al. (2019) fine-tuned a Transformer-based language model (Radford et al., 2018) on free-text rationales provided by humans, with an objective of generating open-ended explanations to improve performance on downstream tasks."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1455,
                    2195,
                    1904
                ],
                "angle": 0,
                "content": "Evaluating rationales. Work on evaluating rationales has often compared these to human judgments (Strout et al., 2019; Doshi-Velez and Kim, 2017), or elicited other human evaluations of explanations (Ribeiro et al., 2016; Lundberg and Lee, 2017; Nguyen, 2018). There has also been work on visual evaluations of saliency maps (Li et al., 2016; Ding et al., 2017; Sundararajan et al., 2017)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1911,
                    2195,
                    2357
                ],
                "angle": 0,
                "content": "Measuring agreement between extracted and human rationales (or collecting subjective assessments of them) assesses the plausibility of rationales, but such approaches do not establish whether the model actually relied on these particular rationales to make a prediction. We refer to rationales that correspond to the inputs most relied upon to come to a disposition as faithful."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2360,
                    2195,
                    2925
                ],
                "angle": 0,
                "content": "Most automatic evaluations of faithfulness measure the impact of perturbing or erasing words or tokens identified as important on model output (Araras et al., 2017; Montavon et al., 2017; Serrano and Smith, 2019; Samek et al., 2016; Jain and Wallace, 2019). We build upon these methods in Section 4. Finally, we note that a recent article urges the community to evaluate faithfulness on a continuous scale of acceptability, rather than viewing this as a binary proposition (Jacovi and Goldberg, 2020)."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1267,
                    2943,
                    1803,
                    2995
                ],
                "angle": 0,
                "content": "3 Datasets in ERASER"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    3023,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "For all datasets in ERASER we distribute both reference labels and rationales marked by humans as supporting these in a standardized format. We"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4445"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    263,
                    1223,
                    831
                ],
                "angle": 0,
                "content": "delineate train, validation, and test splits for all corpora (see Appendix A for processing details). We ensure that these splits comprise disjoint sets of source documents to avoid contamination.<sup>3</sup> We have made the decision to distribute the test sets publicly,<sup>4</sup> in part because we do not view the 'correct' metrics to use as settled. We plan to acquire additional human annotations on held-out portions of some of the included corpora so as to offer hidden test set evaluation opportunities in the future."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    845,
                    1220,
                    1466
                ],
                "angle": 0,
                "content": "Evidence inference (Lehman et al., 2019). A dataset of full-text articles describing randomized controlled trials (RCTs). The task is to infer whether a given intervention is reported to either significantly increase, significantly decrease, or have no significant effect on a specified outcome, as compared to a comparator of interest. Rationales have been marked as supporting these inferences. As the original annotations are not necessarily exhaustive, we collected exhaustive rationale annotations on a subset of the validation and test data.[5]"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1480,
                    1218,
                    1989
                ],
                "angle": 0,
                "content": "BoolQ (Clark et al., 2019). This corpus consists of passages selected from Wikipedia, and yes/no questions generated from these passages. As the original Wikipedia article versions used were not maintained, we have made a best-effort attempt to recover these, and then find within them the passages answering the corresponding questions. For public release, we acquired comprehensive annotations on a subset of documents in our test set.<sup>5</sup>"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    2003,
                    1220,
                    2459
                ],
                "angle": 0,
                "content": "Movie Reviews (Zaidan and Eisner, 2008). Includes positive/negative sentiment labels on movie reviews. Original rationale annotations were not necessarily comprehensive; we thus collected comprehensive rationales on the final two folds of the original dataset (Pang and Lee, 2004). In contrast to most other datasets, the rationale annotations here are span level as opposed to sentence level."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2469,
                    1223,
                    2757
                ],
                "angle": 0,
                "content": "FEVER (Thorne et al., 2018). Short for Fact Extraction and VERIFICATION; entails verifying claims from textual sources. Specifically, each claim is to be classified as supported, refuted or not enough information with reference to a collection of source"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2195,
                    378
                ],
                "angle": 0,
                "content": "texts. We take a subset of this dataset, including only supported and refuted claims."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    396,
                    2200,
                    905
                ],
                "angle": 0,
                "content": "MultiRC (Khashabi et al., 2018). A reading comprehension dataset composed of questions with multiple correct answers that by construction depend on information from multiple sentences. Here each rationale is associated with a question, while answers are independent of one another. We convert each rationale/question/answer triplet into an instance within our dataset. Each answer candidate then has a label of True or False."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    929,
                    2203,
                    1550
                ],
                "angle": 0,
                "content": "Commonsense Explanations (CoS-E) (Rajani et al., 2019). This corpus comprises multiple-choice questions and answers from (Talmor et al., 2019) along with supporting rationales. The rationales in this case come in the form both of highlighted (extracted) supporting snippets and freetext, open-ended descriptions of reasoning. Given our focus on extractive rationales, ERASER includes only the former for now. Following Talmor et al. (2019), we repartition the training and validation sets to provide a canonical test split."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    1568,
                    2205,
                    2136
                ],
                "angle": 0,
                "content": "e-SNLI (Camburu et al., 2018). This dataset augments the SNLI corpus (Bowman et al., 2015) with rationales marked in the premise and/or hypothesis (and natural language explanations, which we do not use). For entailment pairs, annotators were required to highlight at least one word in the premise. For contradiction pairs, annotators had to highlight at least one word in both the premise and the hypothesis; for neutral pairs, they were only allowed to highlight words in the hypothesis."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    2157,
                    2198,
                    2438
                ],
                "angle": 0,
                "content": "Human Agreement We report human agreement over extracted rationales for multiple annotators and documents in Table 2. All datasets have a high Cohen \\(\\kappa\\) (Cohen, 1960); with substantial or better agreement."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    2480,
                    1523,
                    2532
                ],
                "angle": 0,
                "content": "4 Metrics"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2571,
                    2198,
                    3192
                ],
                "angle": 0,
                "content": "In ERASER models are evaluated both for their predictive performance and with respect to the rationales that they extract. For the former, we rely on the established metrics for the respective tasks. Here we describe the metrics we propose to evaluate the quality of extracted rationales. We do not claim that these are necessarily the best metrics for evaluating rationales, however. Indeed, we hope the release of ERASER will spur additional research into how best to measure the quality of model explanations in the context of NLP."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    287,
                    2795,
                    1215,
                    2929
                ],
                "angle": 0,
                "content": "3Except for BoolQ, wherein source documents in the original train and validation set were not disjoint and we preserve this structure in our dataset. Questions, of course, are disjoint."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    287,
                    2929,
                    1215,
                    3139
                ],
                "angle": 0,
                "content": "Consequently, for datasets that have been part of previous benchmarks with other aims (namely, GLUE/superGLUE) but which we have re-purposed for work on rationales in ERASER, e.g., BoolQ (Clark et al., 2019), we have carved out for release test sets from the original validation sets."
            },
            {
                "block_id": 14,
                "type": "page_footnote",
                "bbox": [
                    359,
                    3139,
                    950,
                    3192
                ],
                "angle": 0,
                "content": "5 Annotation details are in Appendix B."
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    287,
                    2795,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4446"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    451,
                    252,
                    2039,
                    610
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>Cohen κ</td><td>F1</td><td>P</td><td>R</td><td>#Annotators/doc</td><td>#Documents</td></tr><tr><td>Evidence Inference</td><td>-</td><td>-</td><td>-</td><td>-</td><td>-</td><td>-</td></tr><tr><td>BoolQ</td><td>0.618 ± 0.194</td><td>0.617 ± 0.227</td><td>0.647 ± 0.260</td><td>0.726 ± 0.217</td><td>3</td><td>199</td></tr><tr><td>Movie Reviews</td><td>0.712 ± 0.135</td><td>0.799 ± 0.138</td><td>0.693 ± 0.153</td><td>0.989 ± 0.102</td><td>2</td><td>96</td></tr><tr><td>FEVER</td><td>0.854 ± 0.196</td><td>0.871 ± 0.197</td><td>0.931 ± 0.205</td><td>0.855 ± 0.198</td><td>2</td><td>24</td></tr><tr><td>MultiRC</td><td>0.728 ± 0.268</td><td>0.749 ± 0.265</td><td>0.695 ± 0.284</td><td>0.910 ± 0.259</td><td>2</td><td>99</td></tr><tr><td>CoS-E</td><td>0.619 ± 0.308</td><td>0.654 ± 0.317</td><td>0.626 ± 0.319</td><td>0.792 ± 0.371</td><td>2</td><td>100</td></tr><tr><td>e-SNLI</td><td>0.743 ± 0.162</td><td>0.799 ± 0.130</td><td>0.812 ± 0.154</td><td>0.853 ± 0.124</td><td>3</td><td>9807</td></tr></table>",
                "caption": "Table 2: Human agreement with respect to rationales. For Movie Reviews and BoolQ we calculate the mean agreement of individual annotators with the majority vote per token, over the two-three annotators we hired via Upwork and Amazon Turk, respectively. The e-SNLI dataset already comprised three annotators; for this we calculate mean agreement between individuals and the majority. For CoS-E, MultiRC, and FEVER, members of our team annotated a subset to use a comparison to the (majority of, where appropriate) existing rationales. We collected comprehensive rationales for Evidence Inference from Medical Doctors; as they have a high amount of expertise, we would expect agreement to be high, but have not collected redundant comprehensive annotations."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1027,
                    1069,
                    1083
                ],
                "angle": 0,
                "content": "4.1 Agreement with human rationales"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1112,
                    1218,
                    1396
                ],
                "angle": 0,
                "content": "The simplest means of evaluating extracted rationales is to measure how well they agree with those marked by humans. We consider two classes of metrics, appropriate for models that perform discrete and 'soft' selection, respectively."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1399,
                    1215,
                    2241
                ],
                "angle": 0,
                "content": "For the discrete case, measuring exact matches between predicted and reference rationales is likely too harsh.\\(^{6}\\) We thus consider more relaxed measures. These include Intersection-Over-Union (IOU), borrowed from computer vision (Everingham et al., 2010), which permits credit assignment for partial matches. We define IOU on a token level: for two spans, it is the size of the overlap of the tokens they cover divided by the size of their union. We count a prediction as a match if it overlaps with any of the ground truth rationales by more than some threshold (here, 0.5). We use these partial matches to calculate an F1 score. We also measure token-level precision and recall, and use these to derive token-level F1 scores."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2252,
                    1215,
                    2645
                ],
                "angle": 0,
                "content": "Metrics for continuous or soft token scoring models consider token rankings, rewarding models for assigning higher scores to marked tokens. In particular, we take the Area Under the Precision-Recall curve (AUPRC) constructed by sweeping a threshold over token scores. We define additional metrics for soft scoring models below."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2655,
                    1218,
                    3048
                ],
                "angle": 0,
                "content": "In general, the rationales we have for tasks are sufficient to make judgments, but not necessarily comprehensive. However, for some datasets we have explicitly collected comprehensive rationales for at least a subset of the test set. Therefore, on these datasets recall evaluates comprehensiveness directly (it does so only noisily on other datasets)."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1027,
                    2195,
                    1136
                ],
                "angle": 0,
                "content": "We highlight which corpora contain comprehensive rationales in the test set in Table 3."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    1265,
                    1161,
                    1835,
                    1217
                ],
                "angle": 0,
                "content": "4.2 Measuring faithfulness"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    1234,
                    2198,
                    2196
                ],
                "angle": 0,
                "content": "As discussed above, a model may provide rationales that are plausible (agreeable to humans) but that it did not rely on for its output. In many settings one may want rationales that actually explain model predictions, i.e., rationales extracted for an instance in this case ought to have meaningfully influenced its prediction for the same. We call these faithful rationales. How best to measure rationale faithfulness is an open question. In this first version of ERASER we propose simple metrics motivated by prior work (Zaidan et al., 2007; Yu et al., 2019). In particular, following Yu et al. (2019) we define metrics intended to measure the comprehensiveness (were all features needed to make a prediction selected?) and sufficiency (do the extracted rationales contain enough signal to come to a disposition?) of rationales, respectively."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    2199,
                    2198,
                    2873
                ],
                "angle": 0,
                "content": "Comprehensiveness. To calculate rationale comprehensiveness we create contrast examples (Zaidan et al., 2007): We construct a contrast example for \\( x_{i} \\), \\( \\tilde{x}_{i} \\), which is \\( x_{i} \\) with the predicted rationales \\( r_{i} \\) removed. Assuming a classification setting, let \\( m(x_{i})_{j} \\) be the original prediction provided by a model \\( m \\) for the predicted class \\( j \\). Then we consider the predicted probability from the model for the same class once the supporting rationales are stripped. Intuitively, the model ought to be less confident in its prediction once rationales are removed from \\( x_{i} \\). We can measure this as:"
            },
            {
                "block_id": 11,
                "type": "equation",
                "bbox": [
                    1307,
                    2922,
                    2193,
                    2985
                ],
                "angle": 0,
                "content": "\\[\n\\text {c o m p r e h e n s i v e n e s s} = m \\left(x _ {i}\\right) _ {j} - m \\left(x _ {i} \\backslash r _ {i}\\right) _ {j} \\tag {1}\n\\]"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    3023,
                    2195,
                    3195
                ],
                "angle": 0,
                "content": "A high score here implies that the rationales were indeed influential in the prediction, while a low score suggests that they were not. A negative value"
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3097,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "6 Consider that an extra token destroys the match but not usually the meaning"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4447"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    483,
                    259,
                    1997,
                    999
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: Illustration of faithfulness scoring metrics, comprehensiveness and sufficiency, on the Commonsense Explanations (CoS-E) dataset. For the former, erasing the tokens comprising the provided rationale \\((\\tilde{x}_i)\\) ought to decrease model confidence in the output 'Forest'. For the latter, the model should be able to come to a similar disposition regarding 'Forest' using only the rationales \\(r_i\\)."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1255,
                    1213,
                    1480
                ],
                "angle": 0,
                "content": "here means that the model became more confident in its prediction after the rationales were removed; this would seem counter-intuitive if the rationales were indeed the reason for its prediction."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    287,
                    1487,
                    1215,
                    1652
                ],
                "angle": 0,
                "content": "Sufficiency. This captures the degree to which the snippets within the extracted rationales are adequate for a model to make a prediction."
            },
            {
                "block_id": 4,
                "type": "equation",
                "bbox": [
                    461,
                    1711,
                    1213,
                    1775
                ],
                "angle": 0,
                "content": "\\[\n\\text {s u f f i c i e n c y} = m \\left(x _ {i}\\right) _ {j} - m \\left(r _ {i}\\right) _ {j} \\tag {2}\n\\]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    287,
                    1831,
                    1037,
                    1883
                ],
                "angle": 0,
                "content": "These metrics are illustrated in Figure 2."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1890,
                    1215,
                    2848
                ],
                "angle": 0,
                "content": "As defined, the above measures have assumed discrete rationales \\( r_i \\). We would also like to evaluate the faithfulness of continuous importance scores assigned to tokens by models. Here we adopt a simple approach for this. We convert soft scores over features \\( s_i \\) provided by a model into discrete rationales \\( r_i \\) by taking the top- \\( k_d \\) values, where \\( k_d \\) is a threshold for dataset \\( d \\). We set \\( k_d \\) to the average rationale length provided by humans for dataset \\( d \\) (see Table 4). Intuitively, this says: How much does the model prediction change if we remove a number of tokens equal to what humans use (on average for this dataset) in order of the importance scores assigned to these by the model. Once we have discretized the soft scores into rationales in this way, we compute the faithfulness scores as per Equations 1 and 2."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2852,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "This approach is conceptually simple. It is also computationally cheap to evaluate, in contrast to measures that require per-token measurements, e.g., importance score correlations with 'leave-one-out' scores (Jain and Wallace, 2019), or counting how many 'important' tokens need to be erased before"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    1255,
                    2195,
                    1424
                ],
                "angle": 0,
                "content": "a prediction flips (Serrano and Smith, 2019). However, the necessity of discretizing continuous scores forces us to pick a particular threshold \\( k \\)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1431,
                    2198,
                    2213
                ],
                "angle": 0,
                "content": "We can also consider the behavior of these measures as a function of \\( k \\), inspired by the measurements proposed in Samek et al. (2016) in the context of evaluating saliency maps for image classification. They suggested ranking pixel regions by importance and then measuring the change in output as they are removed in rank order. Our datasets comprise documents and rationales with quite different lengths; to make this measure comparable across datasets, we construct bins designating the number of tokens to be deleted. Denoting the tokens up to and including bin \\( k \\) for instance \\( i \\) by \\( r_{ik} \\), we define an aggregate comprehensiveness measure:"
            },
            {
                "block_id": 10,
                "type": "equation",
                "bbox": [
                    1414,
                    2273,
                    2193,
                    2413
                ],
                "angle": 0,
                "content": "\\[\n\\frac {1}{| \\mathcal {B} | + 1} \\left(\\sum_ {k = 0} ^ {| \\mathcal {B} |} m \\left(x _ {i}\\right) _ {j} - m \\left(x _ {i} \\backslash r _ {i k}\\right) _ {j}\\right) \\tag {3}\n\\]"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2448,
                    2195,
                    2785
                ],
                "angle": 0,
                "content": "This is defined for sufficiency analogously. Here we group tokens into \\( k = 5 \\) bins by grouping them into the top \\( 1\\% \\), \\( 5\\% \\), \\( 10\\% \\), \\( 20\\% \\) and \\( 50\\% \\) of tokens, with respect to the corresponding importance score. We refer to these metrics as \"Area Over the Perturbation Curve\" (AOPC).<sup>7</sup>"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    2788,
                    2193,
                    3013
                ],
                "angle": 0,
                "content": "These AOPC sufficiency and comprehensiveness measures score a particular token ordering under a model. As a point of reference, we also report these when random scores are assigned to tokens."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3055,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "Our AOPC metrics are similar in concept to ROAR (Hooker et al., 2019) except that we re-use an existing model as opposed to retraining for each fraction."
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4448"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    287,
                    263,
                    726,
                    315
                ],
                "angle": 0,
                "content": "5 Baseline Models"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    343,
                    1223,
                    1076
                ],
                "angle": 0,
                "content": "Our focus in this work is primarily on the ERASER benchmark itself, rather than on any particular model(s). But to establish a starting point for future work, we evaluate several baseline models across the corpora in ERASER. We broadly classify these into models that assign 'soft' (continuous) scores to tokens, and those that perform a 'hard' (discrete) selection over inputs. We additionally consider models specifically designed to select individual tokens (and very short sequences) as rationales, as compared to longer snippets. All of our implementations are in PyTorch (Paszke et al., 2019) and are available in the ERASER repository."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1080,
                    1220,
                    1645
                ],
                "angle": 0,
                "content": "All datasets in ERASER comprise inputs, rationales, and labels. But they differ considerably in document and rationale lengths (Table A). This motivated use of different models for datasets, appropriate to their sizes and rationale granularities. We hope that this benchmark motivates design of models that provide rationales that can flexibly adapt to varying input lengths and expected rationale granularities. Indeed, only with such models can we perform comparisons across all datasets."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1673,
                    692,
                    1725
                ],
                "angle": 0,
                "content": "5.1 Hard selection"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1754,
                    1218,
                    2087
                ],
                "angle": 0,
                "content": "Models that perform hard selection may be viewed as comprising two independent modules: an encoder which is responsible for extracting snippets of inputs, and a decoder that makes a prediction based only on the text provided by the encoder. We consider two variants of such models."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2108,
                    1220,
                    2837
                ],
                "angle": 0,
                "content": "Lei et al. (2016). In this model, an encoder induces a binary mask over inputs \\( x \\), \\( z \\). The decoder accepts the tokens in \\( x \\) unmasked by \\( z \\) to make a prediction \\( \\hat{y} \\). These modules are trained jointly via REINFORCE (Williams, 1992) style estimation, minimizing the loss over expected binary vectors \\( z \\) yielded from the encoder. One of the advantages of this approach is that it need not have access to marked rationales; it can learn to rationalize on the basis of instance labels alone. However, given that we do have rationales in the training data, we experiment with a variant in which we train the encoder explicitly using rationale-level annotations."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2844,
                    1220,
                    3013
                ],
                "angle": 0,
                "content": "In our implementation of Lei et al. (2016), we drop in two independent BERT (Devlin et al., 2019) or GloVe (Pennington et al., 2014) base modules"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2200,
                    940
                ],
                "angle": 0,
                "content": "with bidirectional LSTMs (Hochreiter and Schmidhuber, 1997) on top to induce contextualized representations of tokens for the encoder and decoder, respectively. The encoder generates a scalar (denoting the probability of selecting that token) for each LSTM hidden state using a feedforward layer and sigmoid. In the variant using human rationales during training, we minimize cross entropy loss over rationale predictions. The final loss is then a composite of classification loss, regularizers on rationales (Lei et al., 2016), and loss over rationale predictions, when available."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    961,
                    2200,
                    1238
                ],
                "angle": 0,
                "content": "Pipeline models. These are simple models in which we first train the encoder to extract rationales, and then train the decoder to perform prediction using only rationales. No parameters are shared between the two models."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1252,
                    2198,
                    2153
                ],
                "angle": 0,
                "content": "Here we first consider a simple pipeline that first segments inputs into sentences. It passes these, one at a time, through a Gated Recurrent Unit (GRU) (Cho et al., 2014), to yield hidden representations that we compose via an attentive decoding layer (Bahdanau et al., 2015). This aggregate representation is then passed to a classification module which predicts whether the corresponding sentence is a rationale (or not). A second model, using effectively the same architecture but parameterized independently, consumes the outputs (rationales) from the first to make predictions. This simple model is described at length in prior work (Lehman et al., 2019). We further consider a 'BERT-to-BERT' pipeline, where we replace each stage with a BERT module for prediction (Devlin et al., 2019)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    2164,
                    2200,
                    2613
                ],
                "angle": 0,
                "content": "In pipeline models, we train each stage independently. The rationale identification stage is trained using approximate sentence boundaries from our source annotations, with randomly sampled negative examples at each epoch. The classification stage uses the same positive rationales as the identification stage, a type of teacher forcing (Williams and Zipser, 1989) (details in Appendix C)."
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    1267,
                    2655,
                    1644,
                    2701
                ],
                "angle": 0,
                "content": "5.2 Soft selection"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    2743,
                    2198,
                    3195
                ],
                "angle": 0,
                "content": "We consider a model that passes tokens through BERT (Devlin et al., 2019) to induce contextualized representations that are then passed to a bidirectional LSTM (Hochreiter and Schmidhuber, 1997). The hidden representations from the LSTM are collapsed into a single vector using additive attention (Bahdanau et al., 2015). The LSTM layer allows us to bypass the 512 word limit imposed by"
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    359,
                    3055,
                    1004,
                    3097
                ],
                "angle": 0,
                "content": "This is not intended to be comprehensive."
            },
            {
                "block_id": 14,
                "type": "page_footnote",
                "bbox": [
                    357,
                    3101,
                    962,
                    3146
                ],
                "angle": 0,
                "content": "\\(^{9}\\)https://github.com/jayded/"
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    295,
                    3150,
                    640,
                    3185
                ],
                "angle": 0,
                "content": "eraserbenchmark"
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4449"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    394,
                    252,
                    1113,
                    1806
                ],
                "angle": 0,
                "content": "<table><tr><td></td><td>Perf.</td><td>IOU F1</td><td>Token F1</td></tr><tr><td colspan=\"4\">Evidence Inference</td></tr><tr><td>Lei et al. (2016)</td><td>0.461</td><td>0.000</td><td>0.000</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.461</td><td>0.000</td><td>0.000</td></tr><tr><td>Lehman et al. (2019)</td><td>0.471</td><td>0.119</td><td>0.123</td></tr><tr><td>Bert-To-Bert</td><td>0.708</td><td>0.455</td><td>0.468</td></tr><tr><td colspan=\"4\">BoolQ</td></tr><tr><td>Lei et al. (2016)</td><td>0.381</td><td>0.000</td><td>0.000</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.380</td><td>0.000</td><td>0.000</td></tr><tr><td>Lehman et al. (2019)</td><td>0.411</td><td>0.050</td><td>0.127</td></tr><tr><td>Bert-To-Bert</td><td>0.544</td><td>0.052</td><td>0.134</td></tr><tr><td colspan=\"4\">Movie Reviews</td></tr><tr><td>Lei et al. (2016)</td><td>0.914</td><td>0.124</td><td>0.285</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.920</td><td>0.012</td><td>0.322</td></tr><tr><td>Lehman et al. (2019)</td><td>0.750</td><td>0.063</td><td>0.139</td></tr><tr><td>Bert-To-Bert</td><td>0.860</td><td>0.075</td><td>0.145</td></tr><tr><td colspan=\"4\">FEVER</td></tr><tr><td>Lei et al. (2016)</td><td>0.719</td><td>0.218</td><td>0.234</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.718</td><td>0.000</td><td>0.000</td></tr><tr><td>Lehman et al. (2019)</td><td>0.691</td><td>0.540</td><td>0.523</td></tr><tr><td>Bert-To-Bert</td><td>0.877</td><td>0.835</td><td>0.812</td></tr><tr><td colspan=\"4\">MultiRC</td></tr><tr><td>Lei et al. (2016)</td><td>0.655</td><td>0.271</td><td>0.456</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.648</td><td>0.000†</td><td>0.000†</td></tr><tr><td>Lehman et al. (2019)</td><td>0.614</td><td>0.136</td><td>0.140</td></tr><tr><td>Bert-To-Bert</td><td>0.633</td><td>0.416</td><td>0.412</td></tr><tr><td colspan=\"4\">CoS-E</td></tr><tr><td>Lei et al. (2016)</td><td>0.477</td><td>0.255</td><td>0.331</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.476</td><td>0.000†</td><td>0.000†</td></tr><tr><td>Bert-To-Bert</td><td>0.344</td><td>0.389</td><td>0.519</td></tr><tr><td colspan=\"4\">e-SNLI</td></tr><tr><td>Lei et al. (2016)</td><td>0.917</td><td>0.693</td><td>0.692</td></tr><tr><td>Lei et al. (2016) (u)</td><td>0.903</td><td>0.261</td><td>0.379</td></tr><tr><td>Bert-To-Bert</td><td>0.733</td><td>0.704</td><td>0.701</td></tr></table>",
                "caption": "Table 3: Performance of models that perform hard rationale selection. All models are supervised at the rationale level except for those marked with (u), which learn only from instance-level supervision; \\(\\dagger\\) denotes cases in which rationale training degenerated due to the REINFORCE style training. Perf. is accuracy (CoS-E) or macro-averaged F1 (others). Bert-To-Bert for CoS-E and e-SNLI uses a token classification objective. Bert-To-Bert CoS-E uses the highest scoring answer."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    2469,
                    1215,
                    2978
                ],
                "angle": 0,
                "content": "BERT; when we exceed this, we effectively start encoding a 'new' sequence (setting the positional index to 0) via BERT. The hope is that the LSTM learns to compensate for this. Evidence Inference and BoolQ comprise very long (>1000 token) inputs; we were unable to run BERT over these. We instead resorted to swapping GloVe 300d embeddings (Pennington et al., 2014) in place of BERT representations for tokens. spans."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    3023,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": "To soft score features we consider: Simple gradients, attention induced over contextualized representations, and LIME (Ribeiro et al., 2016)."
            },
            {
                "block_id": 4,
                "type": "table",
                "bbox": [
                    1272,
                    252,
                    2195,
                    1887
                ],
                "angle": 0,
                "content": "<table><tr><td></td><td>Perf.</td><td>AUPRC</td><td>Comp. ↑</td><td>Suff. ↓</td></tr><tr><td colspan=\"5\">Evidence Inference</td></tr><tr><td>GloVe + LSTM - Attention</td><td>0.429</td><td>0.506</td><td>-0.002</td><td>-0.023</td></tr><tr><td>GloVe + LSTM - Gradient</td><td>0.429</td><td>0.016</td><td>0.046</td><td>-0.138</td></tr><tr><td>GloVe + LSTM - Lime</td><td>0.429</td><td>0.014</td><td>0.006</td><td>-0.128</td></tr><tr><td>GloVe + LSTM - Random</td><td>0.429</td><td>0.014</td><td>-0.001</td><td>-0.026</td></tr><tr><td colspan=\"5\">BoolQ</td></tr><tr><td>GloVe + LSTM - Attention</td><td>0.471</td><td>0.525</td><td>0.010</td><td>0.022</td></tr><tr><td>GloVe + LSTM - Gradient</td><td>0.471</td><td>0.072</td><td>0.024</td><td>0.031</td></tr><tr><td>GloVe + LSTM - Lime</td><td>0.471</td><td>0.073</td><td>0.028</td><td>-0.154</td></tr><tr><td>GloVe + LSTM - Random</td><td>0.471</td><td>0.074</td><td>0.000</td><td>0.005</td></tr><tr><td colspan=\"5\">Movies</td></tr><tr><td>BERT+LSTM - Attention</td><td>0.970</td><td>0.417</td><td>0.129</td><td>0.097</td></tr><tr><td>BERT+LSTM - Gradient</td><td>0.970</td><td>0.385</td><td>0.142</td><td>0.112</td></tr><tr><td>BERT+LSTM - Lime</td><td>0.970</td><td>0.280</td><td>0.187</td><td>0.093</td></tr><tr><td>BERT+LSTM - Random</td><td>0.970</td><td>0.259</td><td>0.058</td><td>0.330</td></tr><tr><td colspan=\"5\">FEVER</td></tr><tr><td>BERT+LSTM - Attention</td><td>0.870</td><td>0.235</td><td>0.037</td><td>0.122</td></tr><tr><td>BERT+LSTM - Gradient</td><td>0.870</td><td>0.232</td><td>0.059</td><td>0.136</td></tr><tr><td>BERT+LSTM - Lime</td><td>0.870</td><td>0.291</td><td>0.212</td><td>0.014</td></tr><tr><td>BERT+LSTM - Random</td><td>0.870</td><td>0.244</td><td>0.034</td><td>0.122</td></tr><tr><td colspan=\"5\">MultiRC</td></tr><tr><td>BERT+LSTM - Attention</td><td>0.655</td><td>0.244</td><td>0.036</td><td>0.052</td></tr><tr><td>BERT+LSTM - Gradient</td><td>0.655</td><td>0.224</td><td>0.077</td><td>0.064</td></tr><tr><td>BERT+LSTM - Lime</td><td>0.655</td><td>0.208</td><td>0.213</td><td>-0.079</td></tr><tr><td>BERT+LSTM - Random</td><td>0.655</td><td>0.186</td><td>0.029</td><td>0.081</td></tr><tr><td colspan=\"5\">CoS-E</td></tr><tr><td>BERT+LSTM - Attention</td><td>0.487</td><td>0.606</td><td>0.080</td><td>0.217</td></tr><tr><td>BERT+LSTM - Gradient</td><td>0.487</td><td>0.585</td><td>0.124</td><td>0.226</td></tr><tr><td>BERT+LSTM - Lime</td><td>0.487</td><td>0.544</td><td>0.223</td><td>0.143</td></tr><tr><td>BERT+LSTM - Random</td><td>0.487</td><td>0.594</td><td>0.072</td><td>0.224</td></tr><tr><td colspan=\"5\">e-SNLI</td></tr><tr><td>BERT+LSTM - Attention</td><td>0.960</td><td>0.395</td><td>0.105</td><td>0.583</td></tr><tr><td>BERT+LSTM - Gradient</td><td>0.960</td><td>0.416</td><td>0.180</td><td>0.472</td></tr><tr><td>BERT+LSTM - Lime</td><td>0.960</td><td>0.513</td><td>0.437</td><td>0.389</td></tr><tr><td>BERT+LSTM - Random</td><td>0.960</td><td>0.357</td><td>0.081</td><td>0.487</td></tr></table>",
                "caption": "Table 4: Metrics for 'soft' scoring models. Perf. is accuracy (CoS-E) or F1 (others). Comprehensiveness and sufficiency are in terms of AOPC (Eq. 3). 'Random' assigns random scores to tokens to induce orderings; these are averages over 10 runs."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1267,
                    2234,
                    1587,
                    2287
                ],
                "angle": 0,
                "content": "6 Evaluation"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1262,
                    2315,
                    2195,
                    2708
                ],
                "angle": 0,
                "content": "Here we present initial results for the baseline models discussed in Section 5, with respect to the metrics proposed in Section 4. We present results in two parts, reflecting the two classes of rationales discussed above: 'Hard' approaches that perform discrete selection of snippets, and 'soft' methods that assign continuous importance scores to tokens."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1262,
                    2715,
                    2195,
                    3101
                ],
                "angle": 0,
                "content": "In Table 3 we evaluate models that perform discrete selection of rationales. We view these as inherently faithful, because by construction we know which snippets the decoder used to make a prediction.<sup>10</sup> Therefore, for these methods we report only metrics that measure agreement with human annotations."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    1329,
                    3139,
                    2111,
                    3188
                ],
                "angle": 0,
                "content": "\\(^{10}\\)This assumes independent encoders and decoders."
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4450"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1223,
                    831
                ],
                "angle": 0,
                "content": "Due to computational constraints, we were unable to run our BERT-based implementation of Lei et al. (2016) over larger corpora. Conversely, the simple pipeline of Lehman et al. (2019) assumes a setting in which rationale are sentences, and so is not appropriate for datasets in which rationales tend to comprise only very short spans. Again, in our view this highlights the need for models that can rationalize at varying levels of granularity, depending on what is appropriate."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    838,
                    1220,
                    1234
                ],
                "angle": 0,
                "content": "We observe that for the \"rationalizing\" model of Lei et al. (2016), exploiting rationale-level supervision often (though not always) improves agreement with human-provided rationales, as in prior work (Zhang et al., 2016; Strout et al., 2019). Interestingly, this does not seem strongly correlated with predictive performance."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1245,
                    1220,
                    1866
                ],
                "angle": 0,
                "content": "Lei et al. (2016) outperforms the simple pipeline model when using a BERT encoder. Further, Lei et al. (2016) outperforms the 'BERT-to-BERT' pipeline on the comparable datasets for the final prediction tasks. This may be an artifact of the amount of text each model can select: 'BERT-to-BERT' is limited to sentences, while Lei et al. (2016) can select any subset of the text. Designing extraction models that learn to adaptively select contiguous rationales of appropriate length for a given task seems a potentially promising direction."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1876,
                    1223,
                    2381
                ],
                "angle": 0,
                "content": "In Table 4 we report metrics for models that assign continuous importance scores to individual tokens. For these models we again measure downstream (task) performance (macro F1 or accuracy). Here the models are actually the same, and so downstream performance is equivalent. To assess the quality of token scores with respect to human annotations, we report the Area Under the Precision Recall Curve (AUPRC)."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2392,
                    1223,
                    2953
                ],
                "angle": 0,
                "content": "These scoring functions assign only soft scores to inputs (and may still use all inputs to come to a particular prediction), so we report the metrics intended to measure faithfulness defined above: comprehensiveness and sufficiency, averaged over 'bins' of tokens ordered by importance scores. To provide a point of reference for these metrics — which depend on the underlying model — we report results when rationales are randomly selected (averaged over 10 runs)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2967,
                    1220,
                    3192
                ],
                "angle": 0,
                "content": "Both simple gradient and LIME-based scoring yield more comprehensive rationales than attention weights, consistent with prior work (Jain and Wallace, 2019; Serrano and Smith, 2019). Attention"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2198,
                    596
                ],
                "angle": 0,
                "content": "fares better in terms of AUPRC — suggesting better agreement with human rationales — which is also in line with prior findings that it may provide plausible, but not faithful, explanation (Zhong et al., 2019). Interestingly, LIME does particularly well across these tasks in terms of faithfulness."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    606,
                    2200,
                    1168
                ],
                "angle": 0,
                "content": "From the 'Random' results that we conclude models with overall poor performance on their final tasks tend to have an overall poor ordering, with marginal differences in comprehensiveness and sufficiency between them. For models that with high sufficiency scores: Movies, FEVER, CoS-E, and eSNLI, we find that random removal is particularly damaging to performance, indicating poor absolute ranking; whereas those with high comprehensiveness are sensitive to rationale length."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    1267,
                    1192,
                    2098,
                    1248
                ],
                "angle": 0,
                "content": "7 Conclusions and Future Directions"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1273,
                    2198,
                    1890
                ],
                "angle": 0,
                "content": "We have introduced a new publicly available resource: the Evaluating Rationales And Simple English Reasoning (ERASER) benchmark. This comprises seven datasets, all of which include both instance level labels and corresponding supporting snippets ('rationales') marked by human annotators. We have augmented many of these datasets with additional annotations, and converted them into a standard format comprising inputs, rationales, and outputs. ERASER is intended to facilitate progress on explainable models for NLP."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1897,
                    2198,
                    2402
                ],
                "angle": 0,
                "content": "We proposed several metrics intended to measure the quality of rationales extracted by models, both in terms of agreement with human annotations, and in terms of 'faithfulness'. We believe these metrics provide reasonable means of comparison of specific aspects of interpretability, but we view the problem of measuring faithfulness, in particular, a topic ripe for additional research (which ERASER can facilitate)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2409,
                    2198,
                    2859
                ],
                "angle": 0,
                "content": "Our hope is that ERASER enables future work on designing more interpretable NLP models, and comparing their relative strengths across a variety of tasks, datasets, and desired criteria. It also serves as an ideal starting point for several future directions such as better evaluation metrics for interpretability, causal analysis of NLP models and datasets of rationales in other languages."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1267,
                    2883,
                    1773,
                    2939
                ],
                "angle": 0,
                "content": "8 Acknowledgements"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    2964,
                    2034,
                    3016
                ],
                "angle": 0,
                "content": "We thank the anonymous ACL reviewers."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    3023,
                    2198,
                    3188
                ],
                "angle": 0,
                "content": "This work was supported in part by the NSF (CA-REER award 1750978), and by the Army Research Office (W911NF1810328)."
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4451"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    292,
                    263,
                    535,
                    315
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    340,
                    1218,
                    613
                ],
                "angle": 0,
                "content": "David Alvarez-Melis and Tommi Jaakkola. 2017. A causal framework for explaining the predictions of black-box sequence-to-sequence models. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing, pages 412-421."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    663,
                    1220,
                    852
                ],
                "angle": 0,
                "content": "Leila Arras, Franziska Horn, Grégoire Montavon, Klaus-Robert Müller, and Wojciech Samek. 2017. \"what is relevant in a text document?\": An interpretable machine learning approach. In PloS one."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    891,
                    1220,
                    1168
                ],
                "angle": 0,
                "content": "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2015. Neural machine translation by jointly learning to align and translate. In 3rd International Conference on Learning Representations, ICLR 2015, San Diego, CA, USA, May 7-9, 2015, Conference Track Proceedings."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1213,
                    1220,
                    1490
                ],
                "angle": 0,
                "content": "Joost Bastings, Wilker Aziz, and Ivan Titov. 2019. Interpretable neural predictions with differentiable binary variables. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 2963-2977, Florence, Italy. Association for Computational Linguistics."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1532,
                    1218,
                    1669
                ],
                "angle": 0,
                "content": "Iz Beltagy, Kyle Lo, and Arman Cohan. 2019. Scibert: Pretrained language model for scientific text. In EMNLP."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1715,
                    1220,
                    1996
                ],
                "angle": 0,
                "content": "Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large annotated corpus for learning natural language inference. In Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    2038,
                    1218,
                    2269
                ],
                "angle": 0,
                "content": "Gino Brunner, Yang Liu, Damian Pascual, Oliver Richter, Massimiliano Ciaramita, and Roger Wattenhofer. 2020. On identifiability in transformers. In International Conference on Learning Representations."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2315,
                    1220,
                    2546
                ],
                "angle": 0,
                "content": "Oana-Maria Camburu, Tim Rocktäschel, Thomas Lukasiewicz, and Phil Blunsom. 2018. e-snli: Natural language inference with natural language explanations. In Advances in Neural Information Processing Systems, pages 9539-9549."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2588,
                    1220,
                    2820
                ],
                "angle": 0,
                "content": "Shiyu Chang, Yang Zhang, Mo Yu, and Tommi Jaakkola. 2019. A game theoretic approach to class-wise selective rationalization. In Advances in Neural Information Processing Systems, pages 10055-10065."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2866,
                    1220,
                    3188
                ],
                "angle": 0,
                "content": "Sihao Chen, Daniel Khashabi, Wenpeng Yin, Chris Callison-Burch, and Dan Roth. 2019. Seeing things from a different angle: Discovering diverse perspectives about claims. In Proceedings of the Conference of the North American Chapter of the Association for Computational Linguistics (NAACL), pages 542-557, Minneapolis, Minnesota."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    292,
                    340,
                    1220,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2195,
                    684
                ],
                "angle": 0,
                "content": "Kyunghyun Cho, Bart van Merrienboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. 2014. Learning phrase representations using RNN encoder-decoder for statistical machine translation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1724-1734, Doha, Qatar. Association for Computational Linguistics."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1272,
                    729,
                    2195,
                    915
                ],
                "angle": 0,
                "content": "Christopher Clark, Kenton Lee, Ming-Wei Chang, Tom Kwiatkowski, Michael Collins, and Kristina Toutanova. 2019. Boolq: Exploring the surprising difficulty of natural yes/no questions. In *NAACL*."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1272,
                    961,
                    2195,
                    1101
                ],
                "angle": 0,
                "content": "Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educational and Psychological Measurement, 20(1):37-46."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1147,
                    2195,
                    1564
                ],
                "angle": 0,
                "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of deep bidirectional transformers for language understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 4171-4186, Minneapolis, Minnesota. Association for Computational Linguistics."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1610,
                    2195,
                    1890
                ],
                "angle": 0,
                "content": "Yanzhuo Ding, Yang Liu, Huanbo Luan, and Maosong Sun. 2017. Visualizing and understanding neural machine translation. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), Vancouver, Canada. Association for Computational Linguistics."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1932,
                    2195,
                    2076
                ],
                "angle": 0,
                "content": "Finale Doshi-Velez and Been Kim. 2017. Towards a rigorous science of interpretable machine learning. arXiv preprint arXiv:1702.08608."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2122,
                    2195,
                    2346
                ],
                "angle": 0,
                "content": "Mark Everingham, Luc Van Gool, Christopher K. I. Williams, John Winn, and Andrew Zisserman. 2010. The pascal visual object classes (voc) challenge. International Journal of Computer Vision, 88(2):303-338."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2399,
                    2195,
                    2585
                ],
                "angle": 0,
                "content": "Shi Feng, Eric Wallace, Alvin Grissom, Mohit Iyyer, Pedro Rodriguez, and Jordan L. Boyd-Graber. 2018. Pathologies of neural models make interpretation difficult. In EMNLP."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2631,
                    2195,
                    3002
                ],
                "angle": 0,
                "content": "Matt Gardner, Joel Grus, Mark Neumann, Oyvind Tafjord, Pradeep Dasigi, Nelson F. Liu, Matthew Peters, Michael Schmitz, and Luke Zettlemoyer. 2018. AllenNLP: A deep semantic natural language processing platform. In Proceedings of Workshop for NLP Open Source Software (NLP-OSS), pages 1-6, Melbourne, Australia. Association for Computational Linguistics."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    3048,
                    2195,
                    3185
                ],
                "angle": 0,
                "content": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural computation, 9(8):1735-1780."
            },
            {
                "block_id": 22,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2195,
                    3185
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 23,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4452"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1220,
                    589
                ],
                "angle": 0,
                "content": "Sara Hooker, Dumitru Erhan, Pieter-Jan Kindermans, and Been Kim. 2019. A benchmark for interpretability methods in deep neural networks. In H. Wallach, H. Larochelle, A. Beygelzimer, F. d'Alché-Buc, E. Fox, and R. Garnett, editors, Advances in Neural Information Processing Systems 32, pages 9737-9748. Curran Associates, Inc."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    624,
                    1220,
                    806
                ],
                "angle": 0,
                "content": "Alon Jacovi and Yoav Goldberg. 2020. Towards faithfully interpretable nlp systems: How should we define and evaluate faithfulness? arXiv preprint arXiv:2004.03685."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    841,
                    1220,
                    1168
                ],
                "angle": 0,
                "content": "Sarthak Jain and Byron C. Wallace. 2019. Attention is not Explanation. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers), pages 3543-3556, Minneapolis, Minnesota. Association for Computational Linguistics."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    1199,
                    1220,
                    1427
                ],
                "angle": 0,
                "content": "Sarthak Jain, Sarah Wiegrefe, Yuval Pinter, and Byron C. Wallace. 2020. Learning to Faithfully Rationally by Construction. In Proceedings of the Conference of the Association for Computational Linguistics (ACL)."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1462,
                    1220,
                    1782
                ],
                "angle": 0,
                "content": "Daniel Khashabi, Snigdha Chaturvedi, Michael Roth, Shyam Upadhyay, and Dan Roth. 2018. Looking Beyond the Surface: A Challenge Set for Reading Comprehension over Multiple Sentences. In Proc. of the Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL)."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1817,
                    1215,
                    1960
                ],
                "angle": 0,
                "content": "Diederik Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. International Conference on Learning Representations."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1992,
                    1220,
                    2269
                ],
                "angle": 0,
                "content": "Eric Lehman, Jay DeYoung, Regina Barzilay, and Byron C Wallace. 2019. Inferring which medical treatments work from reports of clinical trials. In Proceedings of the North American Chapter of the Association for Computational Linguistics (NAACL), pages 3705-3717."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    2301,
                    1220,
                    2490
                ],
                "angle": 0,
                "content": "Tao Lei, Regina Barzilay, and Tommi Jaakkola. 2016. Rationalizing neural predictions. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing, pages 107-117."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2518,
                    1220,
                    2844
                ],
                "angle": 0,
                "content": "Jiwei Li, Xinlei Chen, Eduard Hovy, and Dan Jurafsky. 2016. Visualizing and understanding neural models in NLP. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, pages 681-691, San Diego, California. Association for Computational Linguistics."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2876,
                    1220,
                    2971
                ],
                "angle": 0,
                "content": "Zachary C Lipton. 2016. The mythos of model interpretability. arXiv preprint arXiv:1606.03490."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    3002,
                    1220,
                    3188
                ],
                "angle": 0,
                "content": "Scott M Lundberg and Su-In Lee. 2017. A unified approach to interpreting model predictions. In Advances in Neural Information Processing Systems, pages 4765-4774."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1220,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2195,
                    452
                ],
                "angle": 0,
                "content": "Tyler McDonnell, Mucahid Kutlu, Tamer Elsayed, and Matthew Lease. 2017. The many benefits of annotator rationales for relevance judgments. In *IJCAI*, pages 4909-4913."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1272,
                    484,
                    2195,
                    715
                ],
                "angle": 0,
                "content": "Tyler McDonnell, Matthew Lease, Mucahid Kutlu, and Tamer Elsayed. 2016. Why is that relevant? collecting annotator rationales for relevance judgments. In Fourth AAAI Conference on Human Computation and Crowdsourcing."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1272,
                    743,
                    2195,
                    971
                ],
                "angle": 0,
                "content": "Grégoire Montavon, Sebastian Lapuschkin, Alexander Binder, Wojciech Samek, and Klaus-Robert Müller. 2017. Explaining nonlinear classification decisions with deep taylor decomposition. Pattern Recognition, 65:211-222."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1003,
                    2195,
                    1280
                ],
                "angle": 0,
                "content": "Pooya Moradi, Nishant Kambhatla, and Anoop Sarkar. 2019. Interrogating the explanatory power of attention in neural machine translation. In Proceedings of the 3rd Workshop on Neural Generation and Translation, pages 221-230, Hong Kong. Association for Computational Linguistics."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1308,
                    2195,
                    1487
                ],
                "angle": 0,
                "content": "Mark Neumann, Daniel King, Iz Beltagy, and Waleed Ammar. 2019. Scispacy: Fast and robust models for biomedical natural language processing. CoRR, abs/1902.07669."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1522,
                    2195,
                    1799
                ],
                "angle": 0,
                "content": "Dong Nguyen. 2018. Comparing automatic and human evaluation of local explanations for text classification. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long Papers), pages 1069-1078."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1827,
                    2195,
                    2104
                ],
                "angle": 0,
                "content": "Bo Pang and Lillian Lee. 2004. A sentimental education: Sentiment analysis using subjectivity summarization based on minimum cuts. In Proceedings of the 42nd Annual Meeting of the Association for Computational Linguistics (ACL-04), pages 271–278, Barcelona, Spain."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2132,
                    2195,
                    2455
                ],
                "angle": 0,
                "content": "Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, et al. 2019. Pytorch: An imperative style, high-performance deep learning library. In Advances in Neural Information Processing Systems, pages 8024-8035."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2483,
                    2195,
                    2623
                ],
                "angle": 0,
                "content": "David J Pearce. 2005. An improved algorithm for finding the strongly connected components of a directed graph. Technical report, Victoria University, NZ."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2652,
                    2195,
                    2929
                ],
                "angle": 0,
                "content": "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 1532-1543, Doha, Qatar. Association for Computational Linguistics."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2957,
                    2195,
                    3188
                ],
                "angle": 0,
                "content": "Danish Pruthi, Mansi Gupta, Bhuwan Dhingra, Graham Neubig, and Zachary C. Lipton. 2020. Learning to deceive with attention-based explanations. In Annual Conference of the Association for Computational Linguistics (ACL)."
            },
            {
                "block_id": 23,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2195,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 24,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4453"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1215,
                    456
                ],
                "angle": 0,
                "content": "Sampo Pyysalo, F Ginter, Hans Moen, T Salakoski, and Sophia Ananiadou. 2013. Distributional semantics resources for biomedical text processing. Proceedings of Languages in Biology and Medicine."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    487,
                    1215,
                    631
                ],
                "angle": 0,
                "content": "Alec Radford, Karthik Narasimhan, Tim Salimans, and Ilya Sutskever. 2018. Improving language understanding by generative pre-training."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    663,
                    1215,
                    894
                ],
                "angle": 0,
                "content": "Nazneen Fatema Rajani, Bryan McCann, Caiming Xiong, and Richard Socher. 2019. Explain yourself! leveraging language models for commonsense reasoning. Proceedings of the Association for Computational Linguistics (ACL)."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    929,
                    1215,
                    1203
                ],
                "angle": 0,
                "content": "Marco Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. why should i trust you?: Explaining the predictions of any classifier. In Proceedings of the 2016 Conference of the North American Chapter of the Association for Computational Linguistics: Demonstrations, pages 97-101."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1238,
                    1215,
                    1511
                ],
                "angle": 0,
                "content": "Wojciech Samek, Alexander Binder, Grégoire Montavon, Sebastian Lapuschkin, and Klaus-Robert Müller. 2016. Evaluating the visualization of what a deep neural network has learned. IEEE transactions on neural networks and learning systems, 28(11):2660-2673."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1547,
                    1215,
                    1827
                ],
                "angle": 0,
                "content": "Tal Schuster, Darsh J Shah, Yun Jie Serene Yeo, Daniel Filizzola, Enrico Santus, and Regina Barzilay. 2019. Towards debiasing fact verification models. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing (EMNLP). Association for Computational Linguistics."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1859,
                    1215,
                    2090
                ],
                "angle": 0,
                "content": "Sofia Serrano and Noah A. Smith. 2019. Is attention interpretable? In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 2931-2951, Florence, Italy. Association for Computational Linguistics."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    2125,
                    1215,
                    2266
                ],
                "angle": 0,
                "content": "Burr Settles. 2012. Active learning. Synthesis Lectures on Artificial Intelligence and Machine Learning, 6(1):1-114."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2297,
                    1215,
                    2578
                ],
                "angle": 0,
                "content": "Manali Sharma, Di Zhuang, and Mustafa Bilgic. 2015. Active learning with rationales for text classification. In Proceedings of the 2015 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, pages 441-451."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2609,
                    1215,
                    2887
                ],
                "angle": 0,
                "content": "Kevin Small, Byron C Wallace, Carla E Brodley, and Thomas A Trikalinos. 2011. The constrained weight space svm: learning with ranked features. In Proceedings of the International Conference on International Conference on Machine Learning (ICML), pages 865-872."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2922,
                    1215,
                    3108
                ],
                "angle": 0,
                "content": "D. Smilkov, N. Thorat, B. Kim, F. Viégas, and M. Wattenberg. 2017. SmoothGrad: removing noise by adding noise. ICML workshop on visualization for deep learning."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    292,
                    3139,
                    1079,
                    3188
                ],
                "angle": 0,
                "content": "Robyn Speer. 2019. ftfy. Zenodo. Version 5.5."
            },
            {
                "block_id": 12,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2195,
                    498
                ],
                "angle": 0,
                "content": "Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: A simple way to prevent neural networks from overfitting. Journal of Machine Learning Research, 15:1929-1958."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1272,
                    547,
                    2195,
                    824
                ],
                "angle": 0,
                "content": "Julia Strout, Ye Zhang, and Raymond Mooney. 2019. Do human rationales improve machine explanations? In Proceedings of the 2019 ACL Workshop BlackboxNLP: Analyzing and Interpreting Neural Networks for NLP, pages 56-62, Florence, Italy. Association for Computational Linguistics."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    873,
                    2195,
                    1105
                ],
                "angle": 0,
                "content": "Mukund Sundararajan, Ankur Taly, and Qiqi Yan. 2017. Axiomatic attribution for deep networks. In Proceedings of the 34th International Conference on Machine Learning-Volume 70, pages 3319-3328. JMLR.org."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1150,
                    2195,
                    1564
                ],
                "angle": 0,
                "content": "Alon Talmor, Jonathan Herzig, Nicholas Lourie, and Jonathan Berant. 2019. *CommonsenseQA: A question answering challenge targeting commonsense knowledge.* In *Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies*, Volume 1 (Long and Short Papers), pages 4149–4158, Minneapolis, Minnesota. Association for Computational Linguistics."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1613,
                    2195,
                    1890
                ],
                "angle": 0,
                "content": "James Thorne, Andreas Vlachos, Christos Christodoulopoulos, and Arpit Mittal. 2018. FEVER: a Large-scale Dataset for Fact Extraction and VERIFICATION. In Proceedings of the North American Chapter of the Association for Computational Linguistics (NAACL), pages 809-819."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1936,
                    2195,
                    2122
                ],
                "angle": 0,
                "content": "Shikhar Vashisth, Shyam Upadhyay, Gaurav Singh Tomar, and Manaal Faruqui. 2019. Attention interpretability across nlp tasks. arXiv preprint arXiv:1909.11218."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2171,
                    2195,
                    2445
                ],
                "angle": 0,
                "content": "Byron C Wallace, Kevin Small, Carla E Brodley, and Thomas A Trikalinos. 2010. Active learning for biomedical citation screening. In Proceedings of the 16th ACM SIGKDD international conference on Knowledge discovery and data mining, pages 173-182. ACM."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2497,
                    2195,
                    2908
                ],
                "angle": 0,
                "content": "Alex Wang, Yada Pruksachatkun, Nikita Nangia, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel Bowman. 2019a. Superglue: A stickier benchmark for general-purpose language understanding systems. In H. Wallach, H. Larochelle, A. Beygelzimer, F. d'Alché-Buc, E. Fox, and R. Garnett, editors, Advances in Neural Information Processing Systems 32, pages 3266-3280. Curran Associates, Inc."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2960,
                    2195,
                    3188
                ],
                "angle": 0,
                "content": "Alex Wang, Amanpreet Singh, Julian Michael, Felix Hill, Omer Levy, and Samuel R. Bowman. 2019b. GLUE: A multi-task benchmark and analysis platform for natural language understanding. In International Conference on Learning Representations."
            },
            {
                "block_id": 22,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2195,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 23,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "4454"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1218,
                    592
                ],
                "angle": 0,
                "content": "Sarah Wiegrefe and Yuval Pinter. 2019. Attention is not not explanation. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 11-20, Hong Kong, China. Association for Computational Linguistics."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    624,
                    1220,
                    771
                ],
                "angle": 0,
                "content": "Ronald J Williams. 1992. Simple statistical gradient-following algorithms for connectionist reinforcement learning. Machine learning, 8(3-4):229-256."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    799,
                    1220,
                    985
                ],
                "angle": 0,
                "content": "Ronald J Williams and David Zipser. 1989. A learning algorithm for continually running fully recurrent neural networks. *Neural computation*, 1(2):270-280."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    1024,
                    1220,
                    1301
                ],
                "angle": 0,
                "content": "Thomas Wolf, Lysandre Debut, Victor Sanh, Julien Chaumond, Clement Delangue, Anthony Moi, Pierric Cistac, Tim Rault, R'emi Louf, Morgan Funtowicz, and Jamie Brew. 2019. Huggingface's transformers: State-of-the-art natural language processing. ArXiv, abs/1910.03771."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1336,
                    1218,
                    1754
                ],
                "angle": 0,
                "content": "Mo Yu, Shiyu Chang, Yang Zhang, and Tommi Jaakkola. 2019. Rethinking cooperative rationalization: Introspective extraction and complement control. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 4094-4103, Hong Kong, China. Association for Computational Linguistics."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1785,
                    1220,
                    2066
                ],
                "angle": 0,
                "content": "Omar Zaidan, Jason Eisner, and Christine Piatko. 2007. Using annotator rationales to improve machine learning for text categorization. In Proceedings of the conference of the North American chapter of the Association for Computational Linguistics (NAACL), pages 260-267."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    2097,
                    1220,
                    2336
                ],
                "angle": 0,
                "content": "Omar F Zaidan and Jason Eisner. 2008. Modeling annotators: A generative approach to learning from annotator rationales. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 31-40."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    2364,
                    1220,
                    2641
                ],
                "angle": 0,
                "content": "Ye Zhang, Iain Marshall, and Byron C Wallace. 2016. Rationale-augmented convolutional neural networks for text classification. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP), volume 2016, page 795. NIH Public Access."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2676,
                    1220,
                    2823
                ],
                "angle": 0,
                "content": "Ruiqi Zhong, Steven Shao, and Kathleen McKeown. 2019. Fine-grained sentiment analysis with faithful attention. arXiv preprint arXiv:1908.06870."
            },
            {
                "block_id": 9,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1220,
                    2823
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    640,
                    2866,
                    853,
                    2922
                ],
                "angle": 0,
                "content": "Appendix"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    290,
                    2943,
                    860,
                    3002
                ],
                "angle": 0,
                "content": "A Dataset Preprocessing"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    287,
                    3023,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": "We describe what, if any, additional processing we perform on a per-dataset basis. All datasets were converted to a unified format."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1267,
                    263,
                    2198,
                    431
                ],
                "angle": 0,
                "content": "MultiRC (Khashabi et al., 2018) We perform minimal processing. We use the validation set as the testing set for public release."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    459,
                    2200,
                    687
                ],
                "angle": 0,
                "content": "Evidence Inference (Lehman et al., 2019) We perform minimal processing. As not all of the provided evidence spans come with offsets, we delete any prompts that had no grounded evidence spans."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    712,
                    2200,
                    940
                ],
                "angle": 0,
                "content": "Movie reviews (Zaidan and Eisner, 2008) We perform minimal processing. We use the ninth fold as the validation set, and collect annotations on the tenth fold for comprehensive evaluation."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    964,
                    2200,
                    2038
                ],
                "angle": 0,
                "content": "FEVER (Thorne et al., 2018) We perform substantial processing for FEVER - we delete the \"Not Enough Info\" claim class, delete any claims with support in more than one document, and repartition the validation set into a validation and a test set for this benchmark (using the test set would compromise the information retrieval portion of the original FEVER task). We ensure that there is no document overlap between train, validation, and test sets (we use Pearce (2005) to ensure this, as conceptually a claim may be supported by facts in more than one document). We ensure that the validation set contains the documents used to create the FEVER symmetric dataset (Schuster et al., 2019) (unfortunately, the documents used to create the validation and test sets overlap so we cannot provide this partitioning). Additionally, we clean up some encoding errors in the dataset via Speer (2019)."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    2066,
                    2200,
                    2799
                ],
                "angle": 0,
                "content": "BoolQ (Clark et al., 2019) The BoolQ dataset required substantial processing. The original dataset did not retain source Wikipedia articles or collection dates. In order to identify the source paragraphs, we download the 12/20/18 Wikipedia archive, and use FuzzyWuzzy https://github.com/seatgeek/fuzzywuzzy to identify the source paragraph span that best matches the original release. If the Levenshtein distance ratio does not reach a score of at least 90, the corresponding instance is removed. For public release, we use the official validation set for testing, and repartition train into a training and validation set."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    2827,
                    2200,
                    2995
                ],
                "angle": 0,
                "content": "e-SNLI (Camburu et al., 2018) We perform minimal processing. We separate the premise and hypothesis statements into separate documents."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    3023,
                    2200,
                    3192
                ],
                "angle": 0,
                "content": "Commonsense Explanations (CoS-E) (Rajani et al., 2019) We perform minimal processing, primarily deletion of any questions without a rationale"
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4455"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    305,
                    329,
                    2183,
                    2097
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>Documents</td><td>Instances</td><td>Rationale %</td><td>Evidence Statements</td><td>Evidence Lengths</td></tr><tr><td colspan=\"6\">MultiRC</td></tr><tr><td>Train</td><td>400</td><td>24029</td><td>17.4</td><td>56298</td><td>21.5</td></tr><tr><td>Val</td><td>56</td><td>3214</td><td>18.5</td><td>7498</td><td>22.8</td></tr><tr><td>Test</td><td>83</td><td>4848</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">Evidence Inference</td></tr><tr><td>Train</td><td>1924</td><td>7958</td><td>1.34</td><td>10371</td><td>39.3</td></tr><tr><td>Val</td><td>247</td><td>972</td><td>1.38</td><td>1294</td><td>40.3</td></tr><tr><td>Test</td><td>240</td><td>959</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">Exhaustive Evidence Inference</td></tr><tr><td>Val</td><td>81</td><td>101</td><td>4.47</td><td>504.0</td><td>35.2</td></tr><tr><td>Test</td><td>106</td><td>152</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">Movie Reviews</td></tr><tr><td>Train</td><td>1599</td><td>1600</td><td>9.35</td><td>13878</td><td>7.7</td></tr><tr><td>Val</td><td>150</td><td>150</td><td>7.45</td><td>1143.0</td><td>6.6</td></tr><tr><td>Test</td><td>200</td><td>200</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">Exhaustive Movie Reviews</td></tr><tr><td>Val</td><td>50</td><td>50</td><td>19.10</td><td>592.0</td><td>12.8</td></tr><tr><td colspan=\"6\">FEVER</td></tr><tr><td>Train</td><td>2915</td><td>97957</td><td>20.0</td><td>146856</td><td>31.3</td></tr><tr><td>Val</td><td>570</td><td>6122</td><td>21.6</td><td>8672</td><td>28.2</td></tr><tr><td>Test</td><td>614</td><td>6111</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">BoolQ</td></tr><tr><td>Train</td><td>4518</td><td>6363</td><td>6.64</td><td>6363.0</td><td>110.2</td></tr><tr><td>Val</td><td>1092</td><td>1491</td><td>7.13</td><td>1491.0</td><td>106.5</td></tr><tr><td>Test</td><td>2294</td><td>2817</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">e-SNLI</td></tr><tr><td>Train</td><td>911938</td><td>549309</td><td>27.3</td><td>1199035.0</td><td>1.8</td></tr><tr><td>Val</td><td>16328</td><td>9823</td><td>25.6</td><td>23639.0</td><td>1.6</td></tr><tr><td>Test</td><td>16299</td><td>9807</td><td>-</td><td>-</td><td>-</td></tr><tr><td colspan=\"6\">CoS-E</td></tr><tr><td>Train</td><td>8733</td><td>8733</td><td>26.6</td><td>8733</td><td>7.4</td></tr><tr><td>Val</td><td>1092</td><td>1092</td><td>27.1</td><td>1092</td><td>7.6</td></tr><tr><td>Test</td><td>1092</td><td>1092</td><td>-</td><td>-</td><td>-</td></tr></table>",
                "caption": "Table 5: Detailed breakdowns for each dataset - the number of documents, instances, evidence statements, and lengths. Additionally we include the percentage of each relevant document that is considered a rationale. For test sets, counts are for all instances including documents with non comprehensive rationales."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    717,
                    2480,
                    1768,
                    2855
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>Labels</td><td>Instances</td><td>Documents</td><td>Sentences</td><td>Tokens</td></tr><tr><td>Evidence Inference</td><td>3</td><td>9889</td><td>2411</td><td>156.0</td><td>4760.6</td></tr><tr><td>BoolQ</td><td>2</td><td>10661</td><td>7026</td><td>175.3</td><td>3582.5</td></tr><tr><td>Movie Reviews</td><td>2</td><td>2000</td><td>1999</td><td>36.8</td><td>774.1</td></tr><tr><td>FEVER</td><td>2</td><td>110190</td><td>4099</td><td>12.1</td><td>326.5</td></tr><tr><td>MultiRC</td><td>2</td><td>32091</td><td>539</td><td>14.9</td><td>302.5</td></tr><tr><td>CoS-E</td><td>5</td><td>10917</td><td>10917</td><td>1.0</td><td>27.6</td></tr><tr><td>e-SNLI</td><td>3</td><td>568939</td><td>944565</td><td>1.7</td><td>16.0</td></tr></table>",
                "caption": "Table 6: General dataset statistics: number of labels, instances, unique documents, and average numbers of sentences and tokens in documents, across the publicly released train/validation/test splits in ERASER. For CoS-E and e-SNLI, the sentence counts are not meaningful as the partitioning of question/sentence/answer formatting is an arbitrary choice in this framework."
            },
            {
                "block_id": 4,
                "type": "page_number",
                "bbox": [
                    1193,
                    3234,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4456"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1223,
                    768
                ],
                "angle": 0,
                "content": "or questions with rationales that were not possible to automatically map back to the underlying text. As recommended by the authors of Talmore et al. (2019) we repartition the train and validation sets into a train, validation, and test set for this benchmark. We encode the entire question and answers as a prompt and convert the problem into a five-class prediction. We also convert the \"Sanity\" datasets for user convenience."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    287,
                    771,
                    1215,
                    1059
                ],
                "angle": 0,
                "content": "All datasets in ERASER were tokenized using spaCy\\(^{11}\\) library (with SciSpacy (Neumann et al., 2019) for Evidence Inference). In addition, we also split all datasets except e-SNLI and CoS-E into sentences using the same library."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1073,
                    781,
                    1126
                ],
                "angle": 0,
                "content": "B Annotation details"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1150,
                    1215,
                    1319
                ],
                "angle": 0,
                "content": "We collected comprehensive rationales for a subset of some test sets to accurately evaluate model recall of rationales."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    327,
                    1354,
                    1220,
                    1810
                ],
                "angle": 0,
                "content": "1. Movies. We used the Upwork Platform\\(^{12}\\) to hire two fluent english speakers to annotate each of the 200 documents in our test set. Workers were paid at rate of USD 8.5 per hour and on average, it took them 5 min to annotate a document. Each annotator was asked to annotate a set of 6 documents and compared against in-house annotations (by authors)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    325,
                    1845,
                    1223,
                    2353
                ],
                "angle": 0,
                "content": "2. Evidence Inference. We again used Upwork to hire 4 medical professionals fluent in english and having passed a pilot of 3 documents. 125 documents were annotated (only once by one of the annotators, which we felt was appropriate given their high-level of expertise) with an average cost of USD 13 per document. Average time spent of single document was \\(31\\mathrm{min}\\)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    325,
                    2388,
                    1220,
                    3069
                ],
                "angle": 0,
                "content": "3. BoolQ. We used Amazon Mechanical Turk (MTurk) to collect reference comprehensive rationales from randomly selected 199 documents from our test set (ranging in 800 to 1500 tokens in length). Only workers from AU, NZ, CA, US, GB with more than 10K approved HITs and an approval rate of greater than \\(98\\%\\) were eligible. For every document, 3 annotations were collected and workers were paid USD 1.50 per HIT. The average work time (obtained through MTurk interface) was 21 min. We did not anticipate the task taking so"
            },
            {
                "block_id": 7,
                "type": "list",
                "bbox": [
                    325,
                    1354,
                    1223,
                    3069
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1357,
                    266,
                    2195,
                    371
                ],
                "angle": 0,
                "content": "long (on average); the effective low pay rate was unintended."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    1267,
                    413,
                    2160,
                    473
                ],
                "angle": 0,
                "content": "C Hyperparameter and training details"
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    498,
                    1858,
                    554
                ],
                "angle": 0,
                "content": "C.1 (Lei et al., 2016) models"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    575,
                    2198,
                    1304
                ],
                "angle": 0,
                "content": "For these models, we set the sparsity rate at 0.01 and we set the contiguity loss weight to 2 times sparsity rate (following the original paper). We used bert-base-uncased (Wolf et al., 2019) as token embedder (for all datasets except BoolQ, Evidence Inference and FEVER) and Bidirectional LSTM with 128 dimensional hidden state in each direction. A dropout (Srivastava et al., 2014) rate of 0.2 was used before feeding the hidden representations to attention layer in decoder and linear layer in encoder. One layer MLP with 128 dimensional hidden state and ReLU activation was used to compute the decoder output distribution."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    1308,
                    2198,
                    1473
                ],
                "angle": 0,
                "content": "For three datasets mentioned above, we use GloVe embeddings (http://nlp.stanford.edu/data/glove.840B.300d.zip)."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    1476,
                    2198,
                    1869
                ],
                "angle": 0,
                "content": "A learning rate of 2e-5 with Adam (Kingma and Ba, 2014) optimizer was used for all models and we only fine-tuned top two layers of BERT encoder. Th models were trained for 20 epochs and early stopping with patience of 5 epochs was used. The best model was selected on validation set using the final task performance metric."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1267,
                    1873,
                    2193,
                    2038
                ],
                "angle": 0,
                "content": "The input for the above model was encoded in form of [CLS] document [SEP] query [SEP]."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    2041,
                    2193,
                    2153
                ],
                "angle": 0,
                "content": "This model was implemented using the AllenNLP library (Gardner et al., 2018)."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1267,
                    2174,
                    1935,
                    2224
                ],
                "angle": 0,
                "content": "C.2 BERT-LSTM/GloVe-LSTM"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    2252,
                    2193,
                    2476
                ],
                "angle": 0,
                "content": "This model is essentially the same as the decoder in previous section. The BERT-LSTM uses the same hyperparameters, and GloVe-LSTM is trained with a learning rate of 1e-2."
            },
            {
                "block_id": 18,
                "type": "title",
                "bbox": [
                    1267,
                    2497,
                    1942,
                    2546
                ],
                "angle": 0,
                "content": "C.3 Lehman et al. (2019) models"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1262,
                    2571,
                    2198,
                    3188
                ],
                "angle": 0,
                "content": "With the exception of the Evidence Inference dataset, these models were trained using the GLoVe (Pennington et al., 2014) 200 dimension word vectors, and Evidence Inference using the (Pyysalo et al., 2013) PubMed word vectors. We use Adam (Kingma and Ba, 2014) with a learning rate of 1e-3, Dropout (Srivastava et al., 2014) of 0.05 at each layer (embedding, GRU, attention layer) of the model, for 50 epochs with a patience of 10. We monitor validation loss, and keep the best model on the validation set."
            },
            {
                "block_id": 20,
                "type": "page_footnote",
                "bbox": [
                    344,
                    3090,
                    756,
                    3143
                ],
                "angle": 0,
                "content": "11https://spacy.io/"
            },
            {
                "block_id": 21,
                "type": "page_footnote",
                "bbox": [
                    349,
                    3146,
                    855,
                    3188
                ],
                "angle": 0,
                "content": "12http://www.upwork.com"
            },
            {
                "block_id": 22,
                "type": "list",
                "bbox": [
                    344,
                    3090,
                    855,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 23,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "4457"
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    290,
                    266,
                    860,
                    315
                ],
                "angle": 0,
                "content": "C.4 BERT-to-BERT model"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    287,
                    340,
                    1225,
                    796
                ],
                "angle": 0,
                "content": "We primarily used the 'bert-base-uncased' model for both components of the identification and classification pipeline, with the sole exception being Evidence Inference with SciBERT (Beltagy et al., 2019). We trained with the standard BERT parameters of a learning rate of 1e-5, Adam (Kingma and Ba, 2014), for 10 epochs. We monitor validation loss, and keep the best model on the validation set."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1193,
                    3230,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "4458"
            }
        ]
    }
]