[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    456,
                    263,
                    2026,
                    406
                ],
                "angle": 0,
                "content": "Find or Classify? Dual Strategy for Slot-Value Predictions on Multi-Domain Dialog State Tracking"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    451,
                    434,
                    2059,
                    557
                ],
                "angle": 0,
                "content": "Jian-Guo Zhang\\(^{1*}\\) Kazuma Hashimoto\\(^{2\\dagger}\\) Chien-Sheng Wu\\(^{2}\\) Yao Wan\\(^{3}\\) Philip S. Yu\\(^{1}\\) Richard Socher\\(^{2}\\) Caiming Xiong\\(^{2}\\)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    749,
                    557,
                    1749,
                    613
                ],
                "angle": 0,
                "content": "<sup>1</sup> University of Illinois at Chicago, Chicago, USA"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    863,
                    617,
                    1632,
                    666
                ],
                "angle": 0,
                "content": "\\(^{2}\\)Salesforce Research, Palo Alto, USA"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    587,
                    670,
                    1905,
                    733
                ],
                "angle": 0,
                "content": "\\(^{3}\\)Huazhong University of Science and Technology, Wuhan, China"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    640,
                    736,
                    1863,
                    789
                ],
                "angle": 0,
                "content": "{jzhan51,psyu}@uic.edu,wanyao@hust.edu.cn"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    471,
                    792,
                    2031,
                    848
                ],
                "angle": 0,
                "content": "{khashimoto,wu.jason,rsocher,cxiong}@salesforce.com"
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    654,
                    929,
                    850,
                    978
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    354,
                    1024,
                    1151,
                    2725
                ],
                "angle": 0,
                "content": "Dialog state tracking (DST) is a core component in task-oriented dialog systems. Existing approaches for DST mainly fall into one of two categories, namely, ontology-based and ontology-free methods. An ontology-based method selects a value from a candidate-value list for each target slot, while an ontology-free method extracts spans from dialog contexts. Recent work introduced a BERT-based model to strike a balance between the two methods by pre-defining categorical and non-categorical slots. However, it is not clear enough which slots are better handled by either of the two slot types, and the way to use the pre-trained model has not been well investigated. In this paper, we propose a simple yet effective dual-strategy model for DST, by adapting a single BERT-style reading comprehension model to jointly handle both the categorical and noncategorical slots. Our experiments on the MultiWOZ datasets show that our method significantly outperforms the BERT-based counterpart, finding that the key is a deep interaction between the domain-slot and context information. When evaluated on noisy (MultiWOZ 2.0) and cleaner (MultiWOZ 2.1) settings, our method performs competitively and robustly across the two different settings. Our method sets the new state of the art in the noisy setting, while performing more robustly than the best model in the cleaner setting. We also conduct a comprehensive error analysis on the dataset, including the effects of the dual strategy for each slot, to facilitate future research."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    290,
                    2767,
                    650,
                    2820
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    287,
                    2929,
                    1215,
                    3016
                ],
                "angle": 0,
                "content": "*Work done while the first author was an intern at Salesforce Research."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    367,
                    3023,
                    724,
                    3062
                ],
                "angle": 0,
                "content": "† Corresponding author."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    292,
                    3065,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": "This work is licensed under a Creative Commons Attribution 4.0 International License. License details: http://creativecommons.org/licenses/by/4.0/."
            },
            {
                "block_id": 13,
                "type": "list",
                "bbox": [
                    287,
                    2929,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 14,
                "type": "image",
                "bbox": [
                    1285,
                    926,
                    2195,
                    1589
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: An example of dialog state tracking for booking a hotel and reserving a restaurant. Each turn contains a user utterance (grey) and a system utterance (orange). The dialog state tracker (green) tracks all the \\(<\\) domain, slot, value \\(>\\) triplets until the current turn. Blue color denotes the new state appearing at that turn. Best viewed in color."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1262,
                    2101,
                    2198,
                    2722
                ],
                "angle": 0,
                "content": "Virtual assistants play important roles in facilitating our daily life, such as booking hotels, reserving restaurants and making travel plans. Dialog State Tracking (DST), which estimates users' goal and intention based on conversation history, is a core component in task-oriented dialog systems (Young et al., 2013; Gao et al., 2019a). A dialog state consists of a set of \\(<\\) domain, slot, value \\(>\\) triplets, and DST aims to track all the states accumulated across the conversational turns. Fig. 1 shows a dialogue with corresponding annotated turn states."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1262,
                    2739,
                    2198,
                    3195
                ],
                "angle": 0,
                "content": "Traditional approaches for DST usually rely on hand-crafted features and domain-specific lexicon, and can be categorized into two classes (Xu and Hu, 2018; Gao et al., 2019b; Ramadan et al., 2018; Zhong et al., 2018): i.e., ontology-based and ontology-free. The ontology-based approaches (Ramasdan et al., 2018; Zhong et al., 2018; Chen et al., 2020) require full access to the pre-defined ontol-"
            },
            {
                "block_id": 18,
                "type": "page_number",
                "bbox": [
                    1205,
                    3230,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "154"
            },
            {
                "block_id": 19,
                "type": "footer",
                "bbox": [
                    414,
                    3301,
                    2059,
                    3395
                ],
                "angle": 0,
                "content": "Proceedings of the Ninth Joint Conference on Lexical and Computational Semantics (*SEM), pages 154-167 Barcelona, Spain (Online), December 12-13, 2020"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1223,
                    1115
                ],
                "angle": 0,
                "content": "ogy to perform classification over the candidate-value list. However, in practice, we may not have access to an ontology or only have partial ontology in the industry. Even if a full ontology exists, it is computationally expensive to enumerate all the values when the full ontology for some slots is very large and diverse (Wu et al., 2019; Xu and Hu, 2018). The ontology-free approaches (Gao et al., 2019b; Xu and Hu, 2018) find slot values directly from the input source using a copy mechanism without requiring an ontology, e.g., learning span matching with start and end positions in the dialog context. However, it is nontrivial to handle situations where values do not appear in the dialog context or have various descriptions by users."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    1136,
                    1220,
                    1873
                ],
                "angle": 0,
                "content": "To mitigate the above issues, recently, (Zhou and Small, 2019) introduced a question asking model to generate questions asking for values of each-domain slot pair and a dynamic knowledge graph to learn relationships between the (domain, slot) pairs. (Rastogi et al., 2020) introduced a BERT-based model (Devlin et al., 2019) to strike a balance between the two methods by pre-defining categorical and non-categorical slots. However, more studies are needed to know which slots are better handled by either of the two slot types, and the way to use the pre-trained models is not well investigated (Lee et al., 2019; Gao et al., 2019b; Rastogi et al., 2020)."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1894,
                    1223,
                    3195
                ],
                "angle": 0,
                "content": "Inspired by the task-oriented dialog schema design in (Rastogi et al., 2020) and the recent successful experience in locating text spans in machine reading comprehensions (Gao et al., 2019b; Asai et al., 2019). we design a simple yet effective Dual-Strategy Dialog State Tracking model (DS-DST), which adapts a single BERT question answering model to jointly handle both the categorical and non-categorical slots, and different with previous approaches on multi-domain DST, we enable the model with direct interactions between dialog context and the slot. We decide whether a slot belongs to a non-categorical slot or a categorical slot by following the heuristics from (Rastogi et al., 2020). For example, it is common that when users book hotels, the requests for parking are usually yes or no with limited choices. These kinds of slots are defined as categorical slots, and the slot values are selected over a partial ontology. In addition, how long the user will stay has unlimited values and it can be found in the context. These kinds of slots are treated as non-categorical slots, and the values are found trough span matching in the dialog"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2195,
                    484
                ],
                "angle": 0,
                "content": "context. Hence, the model is flexible depending on the access level to the ontology or whether the values of slots could be found directly in the dialog context."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1312,
                    494,
                    2160,
                    547
                ],
                "angle": 0,
                "content": "Our contributions are summarized as follows:"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    557,
                    2203,
                    775
                ],
                "angle": 0,
                "content": "- We designed a simple yet effective dual-strategy model based on BERT with strong interactions between the dialog context and domain-slot pairs."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    785,
                    2200,
                    1062
                ],
                "angle": 0,
                "content": "- Our model achieves state of the art on MultiWOZ 2.0 (Budzianowski et al., 2018) and competitive performance on MultiWOZ 2.1 (Eric et al., 2019). Our model also performs robustly across the two different settings."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1069,
                    2195,
                    1234
                ],
                "angle": 0,
                "content": "- We conducted a comprehensive error analysis on the dataset, including the effects of the dual strategy for each slot, to facilitate future research."
            },
            {
                "block_id": 8,
                "type": "list",
                "bbox": [
                    1265,
                    557,
                    2203,
                    1234
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    1267,
                    1287,
                    1654,
                    1343
                ],
                "angle": 0,
                "content": "2 Related Work"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    1382,
                    2205,
                    3195
                ],
                "angle": 0,
                "content": "Multi-domain DST, which tracks dialog states in complicated conversations across multiple domains with many slots, has been a hot research topic during the past few years, along with the development of Dialogue State Tracking Challenges (Williams et al., 2013; Henderson et al., 2014a,b; Kim et al., 2016, 2017, 2019). Traditional approaches usually rely on hand-crafted features or domain-specific lexicon (Henderson et al., 2014c; Wen et al., 2016), making them difficult to be adapted to new domains. In addition, these approaches require a pre-defined full ontology, in which the values of a slot are constrained by a set of candidate values (Ramadan et al., 2018; Liu and Lane, 2017; Zhong et al., 2018; Lee et al., 2019; Chen et al., 2020). To tackle these issues, several methods have been proposed to extract slot values through span matching with start and end positions in the dialog context. For example, (Xu and Hu, 2018) utilizes an attention-based pointer network to copy values from the dialog context. (Gao et al., 2019b) poses DST as a reading comprehension problem and incorporates a slot carryover model to copy states from previous conversational turns. However, tracking states only from the dialog context is insufficient since many values in DST cannot be exactly found in the context due to annotation errors or diverse descriptions of slot values from users. On the other hand, pre-trained models such as BERT (Devlin et al., 2019) and GPT (Radford et al., 2018) have shown promising performances in many downstream tasks. Among them, DSTreader (Gao et al., 2019b) uti"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1208,
                    3234,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "155"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    263,
                    1223,
                    940
                ],
                "angle": 0,
                "content": "lizes BERT as word embeddings for dialog contexts, SUMBT (Lee et al., 2019) employs BERT to extract representations of candidate values, and BERT-DST (Rastogi et al., 2020) adopts BERT to encode the inputs of the user turn as well as the previous system turn. Different from these approaches where the dialog context and domain-slot pairs are usually separately encoded, we employ strong interactions to encode them. Moreover, We investigate and provide insights to decide slot types and conduct a comprehensive analysis of the popular MultiWOZ datasets."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    947,
                    1220,
                    1683
                ],
                "angle": 0,
                "content": "Another direction for multi-domain DST is based on generative approaches (Lei et al., 2018; Wu et al., 2019; Le et al., 2020) which generate slot values without relying on fixed vocabularies and spans. However, such generative methods suffer from generating ill-formatted strings (e.g., repeated words) upon long strings, which is common in DST. For example, the hotel address may be long and a small difference makes the whole dialog state tracking incorrect. By contrast, both the categorical (picklist-based) and non-categorical (span-based) methods can rely on existing strings rather than generating them."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1729,
                    1099,
                    1789
                ],
                "angle": 0,
                "content": "3 DS-DST: a Dual Strategy for DST"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1820,
                    1223,
                    2960
                ],
                "angle": 0,
                "content": "Let \\( X = \\left\\{ (U_1^{sys}, U_1^{usr}), \\ldots, (U_T^{sys}, U_T^{usr}) \\right\\} \\) denote a set of pairs of a system utterance \\( U_t^{sys} \\) and a user utterance \\( U_t^{usr} \\) (\\( 1 \\leq t \\leq T \\)), given a dialogue context with \\( T \\) turns. Each turn \\( (U_t^{sys}, U_t^{usr}) \\) talks about a particular domain (e.g., hotel), and a certain number of slots (e.g., price range) are associated with the domain. We denote all the \\( N \\) possible domain-slot pairs as \\( S = \\{S_1, \\ldots, S_N\\} \\), where each domain-slot pair consists of \\( \\{s_1, \\ldots, s_n\\} \\) tokens, e.g., hotel-price range includes three tokens. Let \\( X_t = \\{(U_1^{sys}, U_1^{usr}), \\ldots, (U_t^{sys}, U_t^{usr})\\} \\) denote the dialogue context at the \\( t_{th} \\) turn and \\( X_t \\) has \\( \\{x_1, \\ldots, x_m\\} \\) tokens. Our goal is to predict the values for all the domain-slot pairs in \\( S \\). Here we assume that \\( M \\) domain-slot pairs in \\( S \\) are treated as non-categorical slots, and the remaining \\( N - M \\) pairs as categorical slots. Each categorical slot has \\( L \\) possible candidate values (picklist), i.e., \\( \\{V_1, \\ldots, V_L\\} \\), where \\( L \\) is the size of the picklist, and each value has \\( \\{v_1, \\ldots, v_c\\} \\) tokens."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    332,
                    2964,
                    1215,
                    3016
                ],
                "angle": 0,
                "content": "Bearing these notations in mind, we then pro"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2200,
                    1059
                ],
                "angle": 0,
                "content": "pose a dual strategy model with direct interactions between dialog context and domain-slot pairs for DST. Fig. 2 shows an overview of the architecture of our proposed DS-DST model. We first utilize a pre-trained BERT (Devlin et al., 2019) to encode information about the dialogue context \\( X_{t} \\) along with each domain-slot pair in \\( S \\), and obtain contextualized representations conditioned on the domain-slot information. We then design a slot gate to handle special types of values. In particular, for the non-categorical slots, we utilize a two-way linear mapping to find text spans. For the categorical slots, we select the most plausible values from the picklists based on the contextual representation."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1267,
                    1090,
                    1808,
                    1140
                ],
                "angle": 0,
                "content": "3.1 Slot-Context Encoder"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1161,
                    2198,
                    1445
                ],
                "angle": 0,
                "content": "We employ a pre-trained BERT (Devlin et al., 2019) to encode the domain-slot types and dialog contexts. For the \\( j_{th} \\) domain-slot pair and the dialog context \\( X_{t} \\) at the \\( t_{th} \\) turn, we concatenate them and get corresponding representations:"
            },
            {
                "block_id": 8,
                "type": "equation",
                "bbox": [
                    1302,
                    1480,
                    2193,
                    1543
                ],
                "angle": 0,
                "content": "\\[\nR _ {t j} = \\mathrm {B E R T} ([ \\mathrm {C L S} ] \\oplus S _ {j} \\oplus [ \\mathrm {S E P} ] \\oplus X _ {t}), (1)\n\\]"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1575,
                    2198,
                    2090
                ],
                "angle": 0,
                "content": "where [CLS] is a special token added in front of each sample, and [SEP] is a special separator token. The outputs of BERT in Eq. (3.1) can be decomposed as \\( R_{tj} = [r_{tj}^{\\mathrm{CLS}}, r_{tj}^{1}, \\ldots, r_{tj}^{K}] \\), where \\( r_{tj}^{\\mathrm{CLS}} \\) is the aggregated representation of the total \\( K \\) sequential input tokens, and \\( [r_{tj}^{1}, \\ldots, r_{tj}^{K}] \\) are the token-level representations. They are used for slot-value predictions in the following sections, and the BERT is fine-tuned during the training process."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    2125,
                    1843,
                    2174
                ],
                "angle": 0,
                "content": "3.2 Slot-Gate Classification"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2196,
                    2198,
                    3097
                ],
                "angle": 0,
                "content": "As there are many domain-slot pairs in multi-domain dialogues, it is nontrivial to correctly predict whether a domain-slot pair appears at each turn of the dialogue. Here we follow (Wu et al., 2019; Xu and Hu, 2018) and design a slot gate classification module for our neural network. Specifically, at the \\( t_{th} \\) turn, the classifier makes a decision among {none, dontcare, prediction}, where none denotes that a domain-slot pair is not mentioned or the value is 'none' at this turn, dontcare implies that the user can accept any values for this slot, and prediction represents that the slot should be processed by the model with a real value. We utilize \\( r_{tj}^{\\mathrm{CLS}} \\) for the slot-gate classification, and the probability for the \\( j_{th} \\) domain-slot pair at the \\( t_{th} \\) turn is calculated as:"
            },
            {
                "block_id": 12,
                "type": "equation",
                "bbox": [
                    1292,
                    3122,
                    2193,
                    3206
                ],
                "angle": 0,
                "content": "\\[\nP _ {t j} ^ {g a t e} = \\mathrm {s o f t m a x} (W _ {g a t e} \\cdot \\left(r _ {t j} ^ {\\mathrm {C L S}}\\right) ^ {\\top} + b _ {g a t e}), (2)\n\\]"
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    285,
                    3055,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "<sup>1</sup>Recent work on question answering has shown that the joint encoding of query-context pairs is crucial to achieving high accuracy (Qiu et al., 2019; Asai et al., 2019)"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "156"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    307,
                    280,
                    2185,
                    1150
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: The architecture of our proposed DS-DST model. The left part is a fixed BERT model which acts as a feature extractor and outputs the representations of values in the candidate-value list for each categorical slot (marked in purple). The right part is the other fine-tuned BERT model which outputs representations for the concatenation of each domain-slot pair and the recent dialog context."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1448,
                    1213,
                    1561
                ],
                "angle": 0,
                "content": "where \\( W_{gate} \\) and \\( b_{gate} \\) are learnable parameters and bias, respectively."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    287,
                    1568,
                    1215,
                    1680
                ],
                "angle": 0,
                "content": "We adopt the cross-entropy loss function for the slot gate classification as follows:"
            },
            {
                "block_id": 4,
                "type": "equation",
                "bbox": [
                    339,
                    1732,
                    1215,
                    1890
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {g a t e} = \\sum_ {t = 1} ^ {T} \\sum_ {j = 1} ^ {N} - \\log (P _ {t j} ^ {g a t e} \\cdot (y _ {t j} ^ {g a t e}) ^ {\\top}), \\quad (3)\n\\]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1946,
                    1213,
                    2066
                ],
                "angle": 0,
                "content": "where \\( y_{tj}^{gate} \\) is the one-hot gate label for the \\( j_{th} \\) domain-slot pair at the \\( t_{th} \\) turn."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    287,
                    2118,
                    1153,
                    2174
                ],
                "angle": 0,
                "content": "3.3 Non-Categorical Slot-Value Prediction"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2203,
                    1215,
                    2669
                ],
                "angle": 0,
                "content": "For each non-categorical slot, its value can be mapped to a span with start and end position in the dialog context, e.g., slot leave at in the taxi domain has spans \\(4:30\\mathrm{pm}\\) in the context. We take token-level representations \\([r_{tj}^{1},\\ldots ,r_{tj}^{K}]\\) of the dialog context as input, and apply a two-way linear mapping to get a start vector \\(\\alpha_{tj}^{start}\\) and an end vector \\(\\alpha_{tj}^{end}\\):"
            },
            {
                "block_id": 8,
                "type": "equation",
                "bbox": [
                    292,
                    2718,
                    1213,
                    2855
                ],
                "angle": 0,
                "content": "\\[\n\\left[ \\alpha_ {t j} ^ {\\text {s t a r t}}, \\alpha_ {t j} ^ {\\text {e n d}} \\right] = W _ {\\text {s p a n}} \\cdot \\left(\\left[ r _ {t j} ^ {1}, \\dots , r _ {t j} ^ {K} \\right]\\right) ^ {\\top} + b _ {\\text {s p a n}}, \\tag {4}\n\\]"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2862,
                    1213,
                    2971
                ],
                "angle": 0,
                "content": "where \\( W_{span} \\) and \\( b_{span} \\) are learnable parameters and bias, respectively."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    287,
                    2978,
                    1215,
                    3206
                ],
                "angle": 0,
                "content": "The probability of the \\(i_{th}\\) word being the start position of the span is computed as: \\(p_{tj}^{start_i} = \\frac{e^{\\alpha_{tj}^{start\\_r_{tj}^i}}}{\\sum_k \\alpha_{tj}^{start\\_r_{tj}^k}}\\), and the loss for the start position pre"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1267,
                    1448,
                    1796,
                    1501
                ],
                "angle": 0,
                "content": "diction can be calculated as:"
            },
            {
                "block_id": 12,
                "type": "equation",
                "bbox": [
                    1302,
                    1532,
                    2193,
                    1690
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {s t a r t} = \\sum_ {t = 1} ^ {T} \\sum_ {j = 1} ^ {M} - \\log (P _ {t j} ^ {s t a r t} \\cdot (y _ {t j} ^ {s t a r t}) ^ {\\top}), (5)\n\\]"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    1729,
                    2193,
                    1845
                ],
                "angle": 0,
                "content": "where \\( y_{tj}^{start} \\) is the one-hot start position label for the \\( j_{th} \\) domain-slot pair at the \\( t_{th} \\) turn."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    1848,
                    2193,
                    2069
                ],
                "angle": 0,
                "content": "Similarly, we can also get the loss \\(\\mathcal{L}_{end}\\) for end positions prediction. Therefore, the total loss \\(\\mathcal{L}_{span}\\) for the non-categorical slot-value prediction is the summation of \\(\\mathcal{L}_{start}\\) and \\(\\mathcal{L}_{end}\\)."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1267,
                    2108,
                    2036,
                    2164
                ],
                "angle": 0,
                "content": "3.4 Categorical Slot-Value Prediction"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    2181,
                    2198,
                    2515
                ],
                "angle": 0,
                "content": "Each categorical slot has several candidate values; e.g., slot price range in the hotel domain has three values {cheap, expensive, moderate}. At the \\( t_{th} \\) turn, for the \\( j_{th} \\) domain-slot pair, we first use another pre-trained BERT to get the aggregated representation of each value in the candidate list:"
            },
            {
                "block_id": 17,
                "type": "equation",
                "bbox": [
                    1379,
                    2557,
                    2190,
                    2623
                ],
                "angle": 0,
                "content": "\\[\ny _ {l} ^ {\\mathrm {C L S}} = \\operatorname {B E R T} ([ \\mathrm {C L S} ] \\oplus V _ {l} \\oplus [ \\mathrm {S E P} ]), \\tag {6}\n\\]"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    2662,
                    2193,
                    2830
                ],
                "angle": 0,
                "content": "where \\( l \\in \\{1, \\dots, L\\} \\). Note that during the training process, this separate BERT model acts as a feature extractor and its model parameters are fixed."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    2834,
                    2195,
                    3002
                ],
                "angle": 0,
                "content": "We calculate the relevance score between the aggregated representation and a reference candidate by the cosine similarity (Lin et al., 2017):"
            },
            {
                "block_id": 20,
                "type": "equation",
                "bbox": [
                    1396,
                    3037,
                    2190,
                    3206
                ],
                "angle": 0,
                "content": "\\[\n\\cos \\left(r _ {t j} ^ {\\mathrm {C L S}}, y _ {l} ^ {\\mathrm {C L S}}\\right) = \\frac {r _ {t j} ^ {\\mathrm {C L S}} \\cdot \\left(y _ {l} ^ {\\mathrm {C L S}}\\right) ^ {\\top}}{\\left\\| r _ {t j} ^ {\\mathrm {C L S}} \\right\\| \\left\\| y _ {l} ^ {\\mathrm {C L S}} \\right\\|}, \\tag {7}\n\\]"
            },
            {
                "block_id": 21,
                "type": "page_number",
                "bbox": [
                    1208,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "157"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    292,
                    252,
                    1205,
                    729
                ],
                "angle": 0,
                "content": "<table><tr><td>Domain</td><td>Hotel</td><td>Train</td><td>Restaurant</td><td>Attraction</td><td>Taxi</td></tr><tr><td>Slots</td><td>price range\ntype\nparking\nbook stay\nbook day\nbook people\narea\nstars\ninternet\nname</td><td>destination\nday\ndeparture\narrive by\nbook people\nleave at</td><td>food\nprice range\narea\nname\nbook time\nbook day\nbook people</td><td>area\nname\ntype</td><td>leave at\ndestination\ndeparture\narrive by</td></tr><tr><td>Train</td><td>3381</td><td>3103</td><td>3813</td><td>2717</td><td>1654</td></tr><tr><td>Validation</td><td>416</td><td>484</td><td>438</td><td>401</td><td>207</td></tr><tr><td>Test</td><td>394</td><td>494</td><td>437</td><td>395</td><td>195</td></tr></table>"
            },
            {
                "block_id": 1,
                "type": "table_footnote",
                "bbox": [
                    285,
                    764,
                    1215,
                    1013
                ],
                "angle": 0,
                "content": "Table 1: The dataset information of MultiWOZ 2.0 and MultiWOZ 2.1. The top two rows list 5 selected domains, consisting of 30 domain-slot pairs. The last three rows show the number of dialogues for each domain."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1105,
                    1215,
                    1280
                ],
                "angle": 0,
                "content": "where \\( r_{tj}^{\\mathrm{CLS}} \\) and \\( y_{l}^{\\mathrm{CLS}} \\) are the aggregated representations from the slot-context encoder and the reference candidate value, respectively."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    287,
                    1280,
                    1213,
                    1501
                ],
                "angle": 0,
                "content": "During the training process, we employ a hinge loss to enlarge the difference between the similarity of \\( r_{tj}^{\\mathrm{CLS}} \\) to the target value and that to the most similar value in the candidate-value list:"
            },
            {
                "block_id": 4,
                "type": "equation",
                "bbox": [
                    290,
                    1540,
                    1238,
                    1806
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} \\mathcal {L} _ {p i c k l i s t} = \\sum_ {t = 1} ^ {T} \\sum_ {j = 1} ^ {N - M} \\max (0, \\lambda - c o s (r _ {t j} ^ {\\mathrm {C L S}}, y _ {t a r g e t} ^ {\\mathrm {C L S}}) \\\\ + \\max  _ {y _ {l} ^ {\\mathrm {C L S}} \\neq y _ {t a r g e t} ^ {\\mathrm {C L S}}} \\cos \\left(r _ {t j} ^ {\\mathrm {C L S}}, y _ {l} ^ {\\mathrm {C L S}}\\right)), \\tag {8} \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1852,
                    1215,
                    2017
                ],
                "angle": 0,
                "content": "where \\(\\lambda\\) is a constant margin and \\(l\\in \\{1,\\ldots ,L\\}\\) and \\(\\mathcal{L}_{picklist}\\) only requires partial ontology for DS-DST."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    287,
                    2066,
                    769,
                    2118
                ],
                "angle": 0,
                "content": "3.5 Training Objective"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2139,
                    1215,
                    2360
                ],
                "angle": 0,
                "content": "During training process, the above three modules can be jointly trained and share parameters of BERT. We optimize the summations of different losses as:"
            },
            {
                "block_id": 8,
                "type": "equation",
                "bbox": [
                    421,
                    2417,
                    1210,
                    2480
                ],
                "angle": 0,
                "content": "\\[\n\\mathcal {L} _ {\\text {t o t a l}} = \\mathcal {L} _ {\\text {g a t e}} + \\mathcal {L} _ {\\text {s p a n}} + \\mathcal {L} _ {\\text {p i c k l i s t}}. \\tag {9}\n\\]"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2525,
                    1215,
                    2809
                ],
                "angle": 0,
                "content": "For the slots that are not mentioned or the users can accept any values (i.e., slots \\(\\in\\) {none, dontcare}) at each dialogue turn, \\(\\mathcal{L}_{\\text{span}}\\) and \\(\\mathcal{L}_{\\text{picklist}}\\) are set to 0 and only the slot-gate classification is optimized during the training process."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    287,
                    2852,
                    801,
                    2911
                ],
                "angle": 0,
                "content": "4 Experimental Setup"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    287,
                    2946,
                    568,
                    2995
                ],
                "angle": 0,
                "content": "4.1 Datasets"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    285,
                    3023,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "We use the MultiWOZ 2.0 (Budzianowski et al., 2018) dataset and the MultiWOZ 2.1 (Eric et al., 2019) dataset. MultiWOZ 2.0 is one of the largest"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    263,
                    2198,
                    712
                ],
                "angle": 0,
                "content": "multi-domain dialogue corpora with seven distinct domains and over 10,000 dialogues. Compared with the original dataset, MultiWOZ 2.1 conducts dataset correction, including correcting dialog states, spelling errors, dialogue utterance corrections, and mis-annotations to reduce several substantial noises (more details can be found in Eric et al. (2019))."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    715,
                    2198,
                    1392
                ],
                "angle": 0,
                "content": "As hospital and police domains contain very few dialogues (5% of total dialogues), and they only appear in the training dataset, we ignore them in our experiments, following Wu et al. (2019). We adopt only five domains (i.e., train, restaurant, hotel, taxi, attraction) and obtain totally 30 domain-slot pairs in the experiments. Table 1 summarizes the domain-slot pairs and their corresponding statistics in MultiWOZ 2.0 and MultiWOZ 2.1. We follow the standard training/validation/test split strategy provided in the original datasets, and the data pre-processing script provided in Wu et al. (2019)."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1262,
                    1392,
                    2195,
                    2069
                ],
                "angle": 0,
                "content": "For MultiWOZ 2.0 and 2.1, the candidate values for the categorical slots are derived based on the ground-truth values of each slot that appeared in the partial dataset ontology. Besides, Since there are no provided ground-truth start positions and end positions for non-categorical slots in the datasets, we find the spans trough string matching between the ground truth values and the values in the dialog contexts, and we treat the start and end positions of the span which appeared at the most recent dialog turn as the ground-truth start positions and end positions."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1267,
                    2108,
                    1525,
                    2157
                ],
                "angle": 0,
                "content": "4.2 Models"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1262,
                    2181,
                    2195,
                    2287
                ],
                "angle": 0,
                "content": "We make a comparison with several existing models and introduce some of them as below:"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    2294,
                    2193,
                    2459
                ],
                "angle": 0,
                "content": "- SpanPtr (Xu and Hu, 2018). It applies a RNN-based pointer network to find text spans with start and end pointers for each domain-slot pair."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    2462,
                    2193,
                    2627
                ],
                "angle": 0,
                "content": "- \\(\\mathbf{Ptr}\\)-DST. It is a variant based on SpanPtr with the exception that some slots are categorical slots, following DS-DST."
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    1262,
                    2634,
                    2190,
                    2855
                ],
                "angle": 0,
                "content": "- DSTreader (Gao et al., 2019b). It models the DST from the perspective of machine reading comprehensions and applies a pre-trained BERT as initial word embeddings."
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    1262,
                    2859,
                    2193,
                    3027
                ],
                "angle": 0,
                "content": "- DSTQA (Zhou and Small, 2019). It applies a dynamically-evolving knowledge graph and generates question asking for the values of a domain-slot"
            },
            {
                "block_id": 22,
                "type": "list",
                "bbox": [
                    1262,
                    2294,
                    2193,
                    3027
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 23,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3055,
                    2190,
                    3185
                ],
                "angle": 0,
                "content": "2We did not compare with (Lee et al., 2019) and (Shan et al., 2020) as the datasets preprocessing is different with other baselines and ours."
            },
            {
                "block_id": 24,
                "type": "page_number",
                "bbox": [
                    1208,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "158"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    473,
                    252,
                    2014,
                    1119
                ],
                "angle": 0,
                "content": "<table><tr><td>Models</td><td>MultiWOZ 2.0</td><td>MultiWOZ 2.1</td></tr><tr><td>SpanPtr (Xu and Hu, 2018)</td><td>30.28%</td><td>29.09%</td></tr><tr><td>Ptr-DST</td><td>-</td><td>42.17%</td></tr><tr><td>DSTreader (Gao et al., 2019b)</td><td>39.41%</td><td>36.40%*</td></tr><tr><td>TRADE (Wu et al., 2019)</td><td>48.62%</td><td>45.60%*</td></tr><tr><td>COMER (Ren et al., 2019)</td><td>45.72%</td><td>-</td></tr><tr><td>DSTQA w/span (Zhou and Small, 2019)</td><td>51.36%</td><td>49.67%</td></tr><tr><td>DSTQA w/o span+ (Zhou and Small, 2019)</td><td>51.44%</td><td>51.17%</td></tr><tr><td>BERT-DST (Rastogi et al., 2020)</td><td>-</td><td>43.40%</td></tr><tr><td>MA-DST (Kumar et al., 2020)</td><td>-</td><td>51.04%</td></tr><tr><td>SST-2+ (Chen et al., 2020)</td><td>51.17%</td><td>55.23%</td></tr><tr><td>NA-DST (Le et al., 2020)</td><td>50.52%</td><td>49.04%</td></tr><tr><td>DS-Span</td><td>42.59%</td><td>40.00%</td></tr><tr><td>DS-DST</td><td>52.24%</td><td>51.21%</td></tr><tr><td>DS-Picklist+</td><td>54.39%</td><td>53.30%</td></tr></table>",
                "caption": "Table 2: Joint accuracy on the test sets of MultiWOZ 2.0 and 2.1.+: the models require a full ontology, and \\(\\star\\): the results are reported by Eric et al. (2019)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1322,
                    379,
                    1371
                ],
                "angle": 0,
                "content": "pair."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    287,
                    1378,
                    1213,
                    1543
                ],
                "angle": 0,
                "content": "- TRADE (Wu et al., 2019). It contains a slot gate module for slots classification and a pointer generator for states generation."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    287,
                    1547,
                    1215,
                    1771
                ],
                "angle": 0,
                "content": "COMER (Ren et al., 2019). It applies BERT as contextualized word embeddings and first generates the slot sequences in the belief state, then generates the value sequences for each slot."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1778,
                    1215,
                    2160
                ],
                "angle": 0,
                "content": "- BERT-DST (Rastogi et al., 2020). It uses BERT to obtain schema element embeddings and encode system as well as user utterances for dialogue state tracking. Different from the original model, it incorporates a pointer-generator copying mechanism for non-categorical slots of the Multi-WOZ datasets."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    287,
                    2171,
                    1215,
                    2336
                ],
                "angle": 0,
                "content": "- SST-2 (Chen et al., 2020). It uses the graph neural network to incorporate slot relations and model slot interactions."
            },
            {
                "block_id": 7,
                "type": "list",
                "bbox": [
                    285,
                    1378,
                    1215,
                    2336
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    287,
                    2343,
                    1215,
                    2448
                ],
                "angle": 0,
                "content": "For our proposed methods, we design three variants:"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2459,
                    1215,
                    3073
                ],
                "angle": 0,
                "content": "- DS-DST. It represents our proposed dual strategy model for DST, which can simultaneously handle the non-categorical slots as well as the categorical ones. Following heuristics from (Rastogi et al., 2020), time and number related slots are treated as non-categorical slots, resulting in five slot types across four domains (nine domain-slot pairs in total), and the rest slots are treated as categorical slots (See also in Table 4). We also conduct investigations to decide domain-slot types in the experiments."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    287,
                    3080,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "- DS-Span. Similar to Xu and Hu (2018); Gao et al. (2019b), it treats all domain-slot pairs as non-"
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    285,
                    2459,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    1322,
                    2193,
                    1536
                ],
                "angle": 0,
                "content": "categorical slots, where corresponding values for each slot are extracted through text spans (string matching) with start and end positions in the dialog context."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    1547,
                    2193,
                    1824
                ],
                "angle": 0,
                "content": "- DS-Picklist. Similar to (Lee et al., 2019; Chen et al., 2020), It assumes a full ontology is available and treats all domain-slot pairs as categorical slots, where corresponding values for each slot are found in the candidate-value list (picklist)."
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    1267,
                    1866,
                    1818,
                    1925
                ],
                "angle": 0,
                "content": "5 Experimental Results"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    1953,
                    2193,
                    2234
                ],
                "angle": 0,
                "content": "We evaluate all the models using the joint accuracy metric. At each turn, the joint accuracy is 1.0 if and only if all \\( < \\) domain, slot, value \\( > \\) triplets are predicted correctly, otherwise 0. The score is averaged across all the turns in the evaluation set."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1267,
                    2273,
                    1677,
                    2329
                ],
                "angle": 0,
                "content": "5.1 Joint Accuracy"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    2346,
                    2193,
                    2676
                ],
                "angle": 0,
                "content": "Overall performance Table 2 shows the results on the test sets of two datasets. We can see that our models achieve the top performance on MultiWOZ 2.0 and competitive performance on MultiWOZ 2.1. Among these state-of-the-art results, ours are less sensitive to the dataset differences."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    2683,
                    2195,
                    3192
                ],
                "angle": 0,
                "content": "Comparing DS-Span and DS-DST, we can find that jointly using the non-categorical and categorical approaches is indeed helpful in multi-domain DST. When the model has access to the full ontology, DS-Picklist shows that our method could further improve the DST performance. Although DS-Picklist is higher than DS-DST, in real scenarios, it may be nontrivial to have access to the full ontology. In the paper, we jointly train the three mod"
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    1205,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "159"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    305,
                    252,
                    1208,
                    571
                ],
                "angle": 0,
                "content": "<table><tr><td>Models</td><td>Joint Accuracy</td></tr><tr><td>BERT-DST (Rastogi et al., 2020)</td><td>43.40%</td></tr><tr><td>DS-DST</td><td>51.21%</td></tr><tr><td>BERT-DST-Picklist (single turn)</td><td>39.86%</td></tr><tr><td>BERT-DST-Picklist (whole dialog history)</td><td>46.42%</td></tr><tr><td>ToD-BERT (Wu et al., 2020)</td><td>48.00%</td></tr><tr><td>DS-Picklist</td><td>53.30%</td></tr></table>",
                "caption": "Table 3: Joint accuracy on the test sets of MultiWOZ 2.1. BERT-DST is the model used in MultiWOZ 2.1. BERT-DST-Picklist is the original model described in (Rastogi et al., 2020), where a full ontology is required and all the slots are treated as categorical slots, 'single turn' and 'whole dialog history' represent the Bert utterance inputs are the current dialog turn and the whole dialog history, respectively."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1105,
                    1215,
                    1385
                ],
                "angle": 0,
                "content": "ules in Section 3.5, we also conduct experiments for separately training the non-categorical slots and categorical slots. DS-DST drops by \\(1.90\\%\\) on MultiWOZ 2.1, which shows the benefits of jointly training."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1431,
                    1215,
                    2220
                ],
                "angle": 0,
                "content": "Detailed comparisons with BERT related methods Compared with those methods as shown in Table 2, we can observe that DS-Span, which employs the strength of BERT, outperforms SpanPtr by \\(10.91\\%\\), and it outperforms COMMER and DSTreader, which also use a pre-trained BERT model as dialog context embeddings and word embeddings, respectively. DS-DST outperforms BERT-DST, which separately encodes dialog context and domain-slot pairs based on BERT, by \\(7.81\\%\\) on MultiWOZ 2.1. The above results show the effectiveness of our model design based on BERT, where we enforce the strong interactions between dialog context and domain-slot pairs."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2224,
                    1215,
                    3013
                ],
                "angle": 0,
                "content": "To further investigate the differences and importance of strong interactions, we reproduce the original BERT-DST model described in (Rastogi et al., 2020). In addition, we compare with ToD-BERT (Wu et al., 2020), which is a large pre-trained model based on several task-oriented dialogue datasets, and it also separately encodes dialog context and domain-slot pairs. We show the results in Table 3. We observe that our model is consistently much better than BERT-DST and BERT-DST-Picklist. Moreover, our models based on BERT surpass the strong ToD-BERT. We conclude that our improvements come from the strong interactions between slots and dialog context. Therefore, it is important to"
            },
            {
                "block_id": 5,
                "type": "table",
                "bbox": [
                    1277,
                    252,
                    2195,
                    1529
                ],
                "angle": 0,
                "content": "<table><tr><td>Slot Name</td><td>DS-Span</td><td>DS-DST</td><td>DS-Picklist</td></tr><tr><td>hotel-type</td><td>87.92</td><td>93.97 (+6.05)</td><td>94.29 (+6.37)</td></tr><tr><td>attraction-name</td><td>91.16</td><td>93.81 (+2.65)</td><td>93.93 (+2.77)</td></tr><tr><td>restaurant-name</td><td>92.11</td><td>93.38 (+1.27)</td><td>92.89 (+0.78)</td></tr><tr><td>hotel-internet</td><td>92.98</td><td>97.48 (+4.50)</td><td>97.26 (+4.28)</td></tr><tr><td>hotel-parking</td><td>93.42</td><td>97.18 (+3.76)</td><td>96.99 (+3.57)</td></tr><tr><td>attraction-type</td><td>93.77</td><td>96.86 (+3.09)</td><td>96.91 (+3.14)</td></tr><tr><td>hotel-name</td><td>94.19</td><td>94.87 (+0.68)</td><td>94.77 (+0.58)</td></tr><tr><td>hotel-area</td><td>94.73</td><td>95.87 (+1.14)</td><td>95.47 (+0.74)</td></tr><tr><td>restaurant-area</td><td>96.23</td><td>96.86 (+0.63)</td><td>97.18 (+0.95)</td></tr><tr><td>attraction-area</td><td>96.57</td><td>96.96 (+0.39)</td><td>96.73 (+0.16)</td></tr><tr><td>hotel-price range</td><td>96.92</td><td>97.39 (+0.47)</td><td>96.97 (+0.05)</td></tr><tr><td>train-departure</td><td>96.96</td><td>98.55 (+1.59)</td><td>98.34 (+1.38)</td></tr><tr><td>restaurant-food</td><td>97.24</td><td>97.60 (+0.36)</td><td>97.19 (-0.05)</td></tr><tr><td>restaurant-price range</td><td>97.29</td><td>97.73 (+0.44)</td><td>97.69 (+0.40)</td></tr><tr><td>taxi-departure</td><td>97.57</td><td>98.53 (+0.96)</td><td>98.59 (+1.02)</td></tr><tr><td>taxi-destination</td><td>97.69</td><td>98.49 (+0.80)</td><td>98.24 (+0.55)</td></tr><tr><td>hotel-stars</td><td>97.80</td><td>97.48 (-0.32)</td><td>97.76 (-0.04)</td></tr><tr><td>train-destination</td><td>98.17</td><td>98.86 (+0.69)</td><td>98.59 (+0.42)</td></tr><tr><td>train-day</td><td>99.24</td><td>99.35 (+0.11)</td><td>99.33 (+0.09)</td></tr><tr><td>hotel-book day</td><td>99.40</td><td>99.32 (-0.08)</td><td>99.24 (-0.16)</td></tr><tr><td>restaurant-book day</td><td>99.40</td><td>99.57 (+0.17)</td><td>99.44 (+0.04)</td></tr><tr><td>train-leave at</td><td>93.43</td><td>93.30 (-0.13)</td><td>93.91 (+0.48)</td></tr><tr><td>train-arrive by</td><td>95.25</td><td>95.78 (+0.53)</td><td>96.59 (+1.34)</td></tr><tr><td>train-book people</td><td>97.99</td><td>97.84 (-0.15)</td><td>98.51 (+0.52)</td></tr><tr><td>restaurant-book time</td><td>98.56</td><td>98.44 (-0.12)</td><td>99.04 (+0.48)</td></tr><tr><td>taxi-leave at</td><td>98.63</td><td>98.53 (-0.10)</td><td>98.94 (+0.31)</td></tr><tr><td>hotel-book people</td><td>99.06</td><td>99.04 (-0.02)</td><td>99.29 (+0.23)</td></tr><tr><td>taxi-arrive by</td><td>99.12</td><td>99.01 (-0.11)</td><td>99.09 (-0.03)</td></tr><tr><td>hotel-book stay</td><td>99.25</td><td>99.25 (+0.00)</td><td>99.40 (+0.15)</td></tr><tr><td>restaurant-book people</td><td>99.31</td><td>99.16 (-0.15)</td><td>99.44 (+0.13)</td></tr><tr><td>Average Accuracy</td><td>96.38%</td><td>97.35%</td><td>97.40%</td></tr></table>",
                "caption": "Table 4: The slot-level accuracy on the test set of MultiWOZ 2.1. \\( \\frac{+/-}{-} \\) indicates absolute performance improvement/degradation compared with DS-Span. The numbers highlighted in bold indicate that the difference is significant (\\( p < 0.05 \\)), tested by bootstrap resampling (Noreen, 1989). The slots above the first dashed line are categorical slots and the slots below the first dashed line are non-categorical slots for DS-DST. The last row shows the average slot accuracy."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    2111,
                    2193,
                    2217
                ],
                "angle": 0,
                "content": "employ strong interactions to multi-domain DST tasks."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    1267,
                    2269,
                    1731,
                    2322
                ],
                "angle": 0,
                "content": "5.2 Per Slot Accuracy"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    2346,
                    2198,
                    3192
                ],
                "angle": 0,
                "content": "Now that we have observed that DS-DST and DS-Picklist perform much better than DS-Span, we focus on where the accuracy improvement comes from. Table 4 shows the accuracy for each slot type on the MultiWOZ 2.1 test set, and we can observe significant improvement over the DS-Span baseline for some slots, including hotel-type, attraction-type, attraction-name, hotel-internet and hotelparking. This is because their values usually have different expressions and cannot be extracted from the dialog context, which decreases the performance of the span-based methods. In contrast, their values can be predicted directly from the candidate-value lists. Compared with other slots, these slots still have space for improvements."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3055,
                    1210,
                    3188
                ],
                "angle": 0,
                "content": "<sup>3</sup>Here we did not show the results when treating all the slots as non-categorical slots, one reason is that the performances of BERT-DST-Span are much worse than BERT-DST."
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1208,
                    3234,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "160"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    525,
                    252,
                    1955,
                    943
                ],
                "angle": 0,
                "content": "<table><tr><td>Slot Name</td><td>DS-Span(#Unfound / #Relative_Turns)</td><td>DS-DST</td><td>DS-Picklist</td></tr><tr><td>hotel-type</td><td>667/1395</td><td>86.36%</td><td>85.91%</td></tr><tr><td>hotel-parking</td><td>419/1048</td><td>89.50%</td><td>86.63%</td></tr><tr><td>hotel-internet</td><td>421/1124</td><td>95.72%</td><td>94.54%</td></tr><tr><td>taxi-leave at</td><td>73/364</td><td>0.00%</td><td>43.84%</td></tr><tr><td>attraction-name</td><td>215/1261</td><td>70.23%</td><td>74.42%</td></tr><tr><td>attraction-type</td><td>270/1658</td><td>84.81%</td><td>84.07%</td></tr><tr><td>train-leave at</td><td>181/1164</td><td>2.21%</td><td>41.44%</td></tr><tr><td>hotel-area</td><td>168/1452</td><td>51.19%</td><td>58.93%</td></tr><tr><td>train-arrive by</td><td>125/1428</td><td>9.60%</td><td>79.20%</td></tr><tr><td>attraction-area</td><td>177/1620</td><td>67.23%</td><td>71.75%</td></tr></table>",
                "caption": "Table 5: Statistics of Top-10 slots on the MultiWOZ 2.1 validation set based on (#Unfound / #Relative_Turns). DS-DST and DS-Picklist show percentages based on (#Recover / #Unfound). #Unfound is the number of slots whose values cannot be found through span matching in the dialog context, #Relative_Turns is the number of dialogue turns where the slot type is mentioned, and #Recover indicates the number of values correctly predicted by DS-DST or DS-Picklist."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1322,
                    885,
                    1371
                ],
                "angle": 0,
                "content": "5.3 Analysis and Discussions"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1424,
                    1215,
                    2774
                ],
                "angle": 0,
                "content": "Error analysis To better understand the improvement, we conducted an error analysis and inspected actual examples on the MultiWOZ 2.1 validation set. Table 5 shows the top-10 slots, according to the ratio of ground-truth slot values which cannot be found through span matching. That is, for such examples, DS-Span cannot extract the ground-truth strings, resulting in the low joint accuracy. Here, we show how well our DS-DST and DS-Picklist can correctly predict the missing values in DS-Span. As we can see in this table, the two methods dramatically reduce the errors for some slots such as attraction-type, hotel-internet and hotel-parking. Hence, for these kinds of slots, it is better to treat them as categorical slots. Among the top-10 slots, the time-related slots such as taxi-leave at and train-arrive by, which are span-based slots in DS-DST, DS-Span and DS-DST cannot perform well as there are no span matching in the dialogue context, and only few values (i.e., 'none' and 'dontcare') can be correctly predicted by the slot-gate classification. When the ontology is accessible, DS-Picklist can further reduce the error rates, since the predicted values can be found in the candidate-values lists."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2799,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "On the other hand, we also investigated slots whose ground-truth values can be found through span matching, and we did not observe a significant difference between the three methods. This means that both the non-categorical and categorical methods perform similarly when target values are explicitly mentioned in the dialogues. Therefore,"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    1322,
                    2193,
                    1487
                ],
                "angle": 0,
                "content": "when most of the slot values can be found directly in the dialog context, these slots can be treated as either non-categorical slots or categorical slots."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    1497,
                    2195,
                    2003
                ],
                "angle": 0,
                "content": "As our model relies on the slot-gate classification in Section 3.2, we also investigate the potential influence of this module. We replace this module with an oracle slot-gate classification module, and the joint accuracy is improved from \\(55.23\\%\\) to \\(86.10\\%\\) on the development set of MultiWOZ 2.1, which indicates that there is a great space to improve the performance with better designs of the slot-gate classification module."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    2062,
                    2195,
                    3192
                ],
                "angle": 0,
                "content": "Examples Table 6 shows three examples of dialogue turns in the validation set. In the first example, we can see that DS-Span cannot correctly extract the ground-truth values, because the User does not always explicitly mention 'yes' or 'no' when being asked about the internet or parking requests. In the second example, the User and the System are talking about a swimming pool, but they just say 'pool' and its meaning can be inferred from the context. As a result, DS-Span can only extract 'pool' as a value, which is not sufficient. In the third example, all the predictions are semantically correct; however, in terms of the string match, only DS-Picklist can correctly predict the value. The two other methods rely on span extraction. This is caused by formatting issues; that is, it is not always guaranteed that strings in the context satisfy desired formats, such as time expressions. Based on our analysis, future work needs to consider more relevant evaluation metrics than the widely-used"
            },
            {
                "block_id": 8,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1275,
                    3279
                ],
                "angle": 0,
                "content": "161"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    292,
                    252,
                    2195,
                    1420
                ],
                "angle": 0,
                "content": "<table><tr><td>User</td><td>i am looking for an expensive place to stay on the north side of cambridge .</td></tr><tr><td>System</td><td>i am sorry , i haven ’ t found any matches , would you like me to look for something else ?</td></tr><tr><td>User</td><td>i am looking for a 4 star hotel and i need free internet and parking .</td></tr><tr><td>Ground Truths</td><td>&lt;hotel, internet, yes&gt;, &lt;hotel, stars, 4&gt;, &lt;hotel, parking, yes&gt;, &lt;hotel, type, hotel&gt;, &lt;hotel, area, north&gt;, &lt;hotel, price range, expensive&gt;</td></tr><tr><td>DS-Span</td><td>&lt;hotel, internet, free internet&gt;, &lt;hotel, stars, 4&gt;, &lt;hotel, parking, internet&gt;, &lt;hotel, type, none&gt;, &lt;hotel, area, north&gt;, &lt;hotel, price range, expensive&gt;</td></tr><tr><td>DS-DST</td><td>&lt;hotel, internet, yes&gt;, &lt;hotel, stars, 4&gt;, &lt;hotel, parking, yes&gt;, &lt;hotel, type, none&gt;, &lt;hotel, area, north&gt;, &lt;hotel, price range, expensive&gt;</td></tr><tr><td>User</td><td>it’s so hot today , can you help me find a good pool to visit on the north side of the city ?</td></tr><tr><td>System</td><td>i have 2 pools in the north area of town : jesus green outdoor pool and kings hedges learner pool . which do you prefer ?</td></tr><tr><td>User</td><td>kings hedges sounds nice . can i get the address please ?</td></tr><tr><td>Ground Truths</td><td>&lt;attraction, area, north&gt;, &lt;attraction, type, swimming pool&gt;, &lt;attraction, name, kings hedges learner pool&gt;</td></tr><tr><td>DS-Span</td><td>&lt;attraction, area, north&gt;, &lt;attraction, type, pool&gt;, &lt;attraction, name, kings hedges learner pool&gt;</td></tr><tr><td>DS-DST</td><td>&lt;attraction, area, north&gt;, &lt;attraction, type, swimming pool&gt;, &lt;attraction, name, kings hedges learner pool&gt;</td></tr><tr><td>User</td><td>do you happen to know of any trains leaving for cambridge this wednesday ?</td></tr><tr><td>System</td><td>yes . there are a total of 202 trains leaving for cambridge on wednesday . where will you be departing from ?</td></tr><tr><td>User</td><td>i will be leaving from norwich and i need to arrive by 8 : 15 .</td></tr><tr><td>System</td><td>the tr4203 is leaving from norwich to cambridge at 05 : 16 . would you like to book a ticket ?</td></tr><tr><td>User</td><td>sure , can you book that for 2 people and provide my reference number ?</td></tr><tr><td>Ground Truths</td><td>&lt;train, arrive by, 08 : 15&gt;, &lt;train, departure, norwich&gt;, &lt;train, day, wednesday&gt;, &lt;train, book people, 2&gt;, &lt;train, destination, cambridge&gt;</td></tr><tr><td>DS-Span</td><td>&lt;train, arrive by, 8 : 15&gt;, &lt;train, departure, norwich&gt;, &lt;train, day, wednesday&gt;, &lt;train, book people, 2&gt;, &lt;train, destination, cambridge&gt;</td></tr><tr><td>DS-DST</td><td>&lt;train, arrive by, 8 : 15&gt;, &lt;train, departure, norwich&gt;, &lt;train, day, wednesday&gt;, &lt;train, book people, 2&gt;, &lt;train, destination, cambridge&gt;</td></tr><tr><td>DS-Picklist</td><td>&lt;train, arrive by, 08 : 15&gt;, &lt;train, departure, norwich&gt;, &lt;train, day, wednesday&gt;, &lt;train, book people, 2&gt;, &lt;train, destination, cambridge&gt;</td></tr></table>",
                "caption": "Table 6: Predicted dialog states on the MultiWOZ 2.1 validation set, bold face means incorrect prediction. The first two examples show comparisons between DS-Span and DS-DST. The last example shows comparisons between DS-Span, DS-DST and DS-Picklist."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1694,
                    1213,
                    1862
                ],
                "angle": 0,
                "content": "string matching metric. For example, in the QA research community, it is investigated how to more robustly evaluate QA models (Chen et al., 2019)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1894,
                    1220,
                    3195
                ],
                "angle": 0,
                "content": "Open discussions Multi-domain dialog state tracking is enjoying popularity in enhancing research on task-oriented dialog systems, to handle tasks across different domains and support a large number of services. However, it should be noted that there is much room for improvement with the popular MultiWOZ 2.0 (Budzianowski et al., 2018) and MultiWOZ 2.1 (Eric et al., 2019) datasets, due to their annotation errors, ambiguity, and inconsistency. Moreover, a potential problem is that no standard ways have been established for the evaluation of the MultiWOZ dataset. Some papers are following the pre-processing ways provided by Wu et al. (2019), while others have their own ways, which may result in unfair comparisons; for example, there are some 'none' values in the test set, and an evaluation metric without considering them will lead to higher accuracy (up to \\(3\\%\\) in our experience). Recent work has refined the datasets to form the latest MultiWOZ 2.2 dataset with higher quality and consistency (Zang et al., 2020). We encourage providing more details of the data processing in future work, and more importantly, testing models"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1267,
                    1694,
                    1962,
                    1750
                ],
                "angle": 0,
                "content": "on the test set with the higher quality."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    1267,
                    1838,
                    1597,
                    1890
                ],
                "angle": 0,
                "content": "6 Conclusion"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1262,
                    1964,
                    2198,
                    2634
                ],
                "angle": 0,
                "content": "In this paper, we have proposed a dual strategy model with strong interactions between the dialog context and domain-slot pairs for the task of multi-domain dialog state tracking. In particular, we predict the slot value via selecting over a partial ontology for categorical slots or finding values from the dialog context for non-categorical slots. Our models achieve the state of the art results on the MultiWOZ 2.0 and competitive results on the MultiWOZ 2.1. Moreover, we conduct a comprehensive analysis on the dataset to facilitate future research."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    1267,
                    2729,
                    1669,
                    2785
                ],
                "angle": 0,
                "content": "Acknowledgments"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1262,
                    2855,
                    2195,
                    3132
                ],
                "angle": 0,
                "content": "This work is supported in part by NSF under grants III-1763325, III-1909323, and SaTC-1930941. We thank Salesforce research members for their insightful discussions, and the anonymous reviewers for their helpful and valuable comments."
            },
            {
                "block_id": 9,
                "type": "page_number",
                "bbox": [
                    1205,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "162"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    292,
                    263,
                    535,
                    315
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    295,
                    340,
                    1215,
                    568
                ],
                "angle": 0,
                "content": "Akari Asai, Kazuma Hashimoto, Hannaneh Hajishirzi, Richard Socher, and Caiming Xiong. 2019. Learning to retrieve reasoning paths over wikipedia graph for question answering. arXiv preprint arXiv:1911.10470."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    599,
                    1220,
                    834
                ],
                "angle": 0,
                "content": "Paweł Budzianowski, Tsung-Hsien Wen, Bo-Hsiang Tseng, Inigo Casanueva, Stefan Ultes, Osman Ramadan, and Milica Gašić. 2018. Multiwoz-a large-scale multi-domain wizard-of-oz dataset for task-oriented dialogue modelling. In EMNLP."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    859,
                    1215,
                    1048
                ],
                "angle": 0,
                "content": "Anthony Chen, Gabriel Stanovsky, Sameer Singh, and Matt Gardner. 2019. Evaluating question answering evaluation. In Proceedings of the 2nd Workshop on Machine Reading for Question Answering."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1073,
                    1220,
                    1259
                ],
                "angle": 0,
                "content": "Lu Chen, Boer Lv, Chi Wang, Su Zhu, Bowen Tan, and Kai Yu. 2020. Schema-guided multi-domain dialogue state tracking with graph attention neural networks. In AAAI, pages 7521-7528."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1287,
                    1220,
                    1476
                ],
                "angle": 0,
                "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. Bert: Pre-training of deep bidirectional transformers for language understanding. In NAACL."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1501,
                    1220,
                    1736
                ],
                "angle": 0,
                "content": "Mihail Eric, Rahul Goel, Shachi Paul, Abhishek Sethi, Sanchit Agarwal, Shuyag Gao, and Dilek Hakkani-Tur. 2019. Multiwoz 2.1: Multi-domain dialogue state corrections and state tracking baselines. arXiv preprint arXiv:1907.01669."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    1761,
                    1220,
                    1946
                ],
                "angle": 0,
                "content": "Jianfeng Gao, Michel Galley, Lihong Li, et al. 2019a. Neural approaches to conversational ai. Foundations and Trends® in Information Retrieval, 13(2-3):127-298."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    1975,
                    1220,
                    2164
                ],
                "angle": 0,
                "content": "Shuyang Gao, Abhishek Sethi, Sanchit Aggarwal, Tagyoung Chung, and Dilek Hakkani-Tur. 2019b. Dialog state tracking: A neural reading comprehension approach. In SIGDIAL."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2188,
                    1215,
                    2332
                ],
                "angle": 0,
                "content": "Matthew Henderson, Blaise Thomson, and Jason D Williams. 2014a. The second dialog state tracking challenge. In SIGDIAL."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2357,
                    1215,
                    2501
                ],
                "angle": 0,
                "content": "Matthew Henderson, Blaise Thomson, and Jason D Williams. 2014b. The third dialog state tracking challenge. In IEEE SLT."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    292,
                    2529,
                    1215,
                    2669
                ],
                "angle": 0,
                "content": "Matthew Henderson, Blaise Thomson, and Steve Young. 2014c. Word-based dialog state tracking with recurrent neural networks. In SIGDIAL."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    292,
                    2694,
                    1220,
                    2932
                ],
                "angle": 0,
                "content": "Seokhwan Kim, Luis Fernando D'Haro, Rafael E Banchs, Jason D Williams, Matthew Henderson, and Koichiro Yoshino. 2016. The fifth dialog state tracking challenge. In 2016 IEEE Spoken Language Technology Workshop (SLT), pages 511-517. IEEE."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    292,
                    2957,
                    1220,
                    3192
                ],
                "angle": 0,
                "content": "Seokhwan Kim, Luis Fernando D'Haro, Rafael E Banchs, Jason D Williams, and Matthew Henderson. 2017. The fourth dialog state tracking challenge. In Dialogues with Social Robots, pages 435-449. Springer."
            },
            {
                "block_id": 14,
                "type": "list",
                "bbox": [
                    292,
                    340,
                    1220,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2195,
                    501
                ],
                "angle": 0,
                "content": "Seokhwan Kim, Michel Galley, Chulaka Gunasekara, Sungjin Lee, Adam Atkinson, Baolin Peng, Hannes Schulz, Jianfeng Gao, Jinchao Li, Mahmoud Adada, et al. 2019. The eighth dialog system technology challenge. arXiv preprint arXiv:1911.06394."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    529,
                    2195,
                    712
                ],
                "angle": 0,
                "content": "Adarsh Kumar, Peter Ku, Anuj Kumar Goyal, Angeliki Metallinou, and Dilek Hakkani-Tur. 2020. Ma-dst: Multi-attention based scalable dialog state tracking. AAAI."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    743,
                    2195,
                    841
                ],
                "angle": 0,
                "content": "Hung Le, Richard Socher, and Steven CH Hoi. 2020. Non-autoregressive dialog state tracking. *ICLR*."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    866,
                    2195,
                    1006
                ],
                "angle": 0,
                "content": "Hwaran Lee, Jinsik Lee, and Tae-Yoon Kim. 2019. Sumbt: Slot-utterance matching for universal and scalable belief tracking. In ACL."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1034,
                    2195,
                    1224
                ],
                "angle": 0,
                "content": "Wenqiang Lei, Xisen Jin, Min-Yen Kan, Zhaochun Ren, Xiangnan He, and Dawei Yin. 2018. Sequicity: Simplifying task-oriented dialogue systems with single sequence-to-sequence architectures. In ACL."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1252,
                    2195,
                    1392
                ],
                "angle": 0,
                "content": "Kevin Lin, Dianqi Li, Xiaodong He, Zhengyou Zhang, and Ming-Ting Sun. 2017. Adversarial ranking for language generation. In NIPS."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1420,
                    2195,
                    1561
                ],
                "angle": 0,
                "content": "Bing Liu and Ian Lane. 2017. An end-to-end trainable neural network model with belief tracking for task-oriented dialog. In INTERSPEECH."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1589,
                    2195,
                    1729
                ],
                "angle": 0,
                "content": "Eric W. Noreen. 1989. Computer-Intensive Methods for Testing Hypotheses: An Introduction. Wiley-Interscience."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1757,
                    2195,
                    1943
                ],
                "angle": 0,
                "content": "Lin Qiu, Yunxuan Xiao, Yanru Qu, Hao Zhou, Lei Li, Weinan Zhang, and Yong Yu. 2019. Dynamically fused graph network for multi-hop reasoning. In ACL."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1975,
                    2195,
                    2118
                ],
                "angle": 0,
                "content": "Alec Radford, Karthik Narasimhan, Tim Salimans, and Ilya Sutskever. 2018. Improving language understanding by generative pre-training."
            },
            {
                "block_id": 25,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2143,
                    2195,
                    2287
                ],
                "angle": 0,
                "content": "Osman Ramadan, Paweł Budzianowski, and Milica Gašić. 2018. Large-scale multi-domain belief tracking with knowledge sharing. In ACL."
            },
            {
                "block_id": 26,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2311,
                    2195,
                    2501
                ],
                "angle": 0,
                "content": "Abhinav Rastogi, Xiaoxue Zang, Srinivas Sunkara, Raghav Gupta, and Pranav Khaitan. 2020. Towards scalable multi-domain conversational agents: The schema-guided dialogue dataset. AAAI."
            },
            {
                "block_id": 27,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2525,
                    2195,
                    2669
                ],
                "angle": 0,
                "content": "Liliang Ren, Jianmo Ni, and Julian McAuley. 2019. Scalable and accurate dialogue state tracking via hierarchical sequence generation. EMNLP."
            },
            {
                "block_id": 28,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2694,
                    2195,
                    2925
                ],
                "angle": 0,
                "content": "Yong Shan, Zekang Li, Jinchao Zhang, Fandong Meng, Yang Feng, Cheng Niu, and Jie Zhou. 2020. A contextual hierarchical attention network with adaptive objective for dialogue state tracking. arXiv preprint arXiv:2006.01554."
            },
            {
                "block_id": 29,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2957,
                    2195,
                    3188
                ],
                "angle": 0,
                "content": "Tsung-Hsien Wen, David Vandyke, Nikola Mrksic, Milica Gasic, Lina M Rojas-Barahona, Pei-Hao Su, Stefan Ultes, and Steve Young. 2016. A network-based end-to-end trainable task-oriented dialogue system. In EACL."
            },
            {
                "block_id": 30,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2195,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 31,
                "type": "page_number",
                "bbox": [
                    1208,
                    3234,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "163"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1215,
                    406
                ],
                "angle": 0,
                "content": "Jason Williams, Antoine Raux, Deepak Ramachandran, and Alan Black. 2013. The dialog state tracking challenge. In SIGDIAL."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    442,
                    1215,
                    627
                ],
                "angle": 0,
                "content": "Chien-Sheng Wu, Steven Hoi, Richard Socher, and Caiming Xiong. 2020. Tod-bert: Pre-trained natural language understanding for task-oriented dialogues. arXiv preprint arXiv:2004.06871."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    663,
                    1215,
                    845
                ],
                "angle": 0,
                "content": "Chien-Sheng Wu, Andrea Madotto, Ehsan Hosseini-Asl, Caiming Xiong, Richard Socher, and Pascale Fung. 2019. Transferable multi-domain state generator for task-oriented dialogue systems. In ACL."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    880,
                    1213,
                    1024
                ],
                "angle": 0,
                "content": "Puyang Xu and Qi Hu. 2018. An end-to-end approach for handling unknown slot values in dialogue state tracking. In ACL."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1055,
                    1215,
                    1241
                ],
                "angle": 0,
                "content": "Steve Young, Milica Gašić, Blaise Thomson, and Jason D Williams. 2013. Pomdp-based statistical spoken dialog systems: A review. Proceedings of the IEEE, 101(5):1160-1179."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1276,
                    1215,
                    1508
                ],
                "angle": 0,
                "content": "Xiaoxue Zang, Abhinav Rastogi, Srinivas Sunkara, Raghav Gupta, Jianguo Zhang, and Jindong Chen. 2020. Multiwoz 2.2: A dialogue dataset with additional annotation corrections and state tracking baselines. arXiv preprint arXiv:2007.12720."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1543,
                    1215,
                    1683
                ],
                "angle": 0,
                "content": "Victor Zhong, Caiming Xiong, and Richard Socher. 2018. Global-locally self-attentive encoder for dialogue state tracking. In ACL."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    1715,
                    1215,
                    1901
                ],
                "angle": 0,
                "content": "Li Zhou and Kevin Small. 2019. Multi-domain dialogue state tracking as dynamic knowledge graph enhanced question answering. arXiv preprint arXiv:1911.06192."
            },
            {
                "block_id": 8,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1215,
                    1901
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 9,
                "type": "page_number",
                "bbox": [
                    1208,
                    3230,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "164"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    290,
                    263,
                    597,
                    322
                ],
                "angle": 0,
                "content": "A Appendix"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    287,
                    350,
                    734,
                    406
                ],
                "angle": 0,
                "content": "A.1 Training Details"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    424,
                    1223,
                    1385
                ],
                "angle": 0,
                "content": "We employ a pre-trained BERT model with the \"bert-base-uncased\" configuration. During the fine-tuning process, we update all the model parameters using the BertAdam (Devlin et al., 2019) optimizer. The maximum input sequence length after WordPiece tokenization for BERT is set to 512. The constant margin \\(\\lambda\\) is set to 0.5 for the DS-DST and DS-Picklist models. For the MultiWOZ 2.0 and MultiWOZ 2.1 datasets, the initial learning rate is set to \\(1e - 4\\), and the proportion for learning rate warmup is set to 0.1. The batch size is set to 16. We follow the learning rate decay mechanism as in (Lee et al., 2019), and we set the maximum number of the training epochs to 5. We check the joint accuracy on the validation set after every 1,000 iterations, and keep the best checkpoint to be used for the final evaluation on the test set."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1420,
                    717,
                    1476
                ],
                "angle": 0,
                "content": "A.2 Sample Output"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1494,
                    1220,
                    2224
                ],
                "angle": 0,
                "content": "We present outputs of DS-Span and DS-DST in all the turns for two dialogues (i.e., MUL0729, PMUL2428) on the validation set of the MultiWOZ 2.1. Table 7 and Table 8 show the predicted dialog states for MUL0729 and PMUL2428, respectively. In Table 7, hotel type and hotel internet are predicted incorrectly by DS-Span, where the value yes of hotel internet has a different description free wifi in the dialog context. For this type of values, DS-Span cannot find the spans directly in the dialog context. In Table 8, DS-Span does not correctly predict the state <taxi, departure, funky fun house> at the \\(6_{th}\\) turn."
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3097,
                    1066,
                    3192
                ],
                "angle": 0,
                "content": "4https://github.com/huggingface/transformers/tree/master/examples"
            },
            {
                "block_id": 6,
                "type": "page_number",
                "bbox": [
                    1208,
                    3230,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "165"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    290,
                    848,
                    2195,
                    2438
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"4\">Turn 1</td><td>User:</td><td>i am looking for a train from ely to cambridge . do you have such trains ?</td></tr><tr><td>Ground Truths:</td><td>&lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;</td></tr><tr><td rowspan=\"5\">Turn 2</td><td>System:</td><td>there are 70 trains do you have a date and time you would like to go ?</td></tr><tr><td>User:</td><td>i would like to leave on a sunday and arrive by 11:30 .</td></tr><tr><td>Ground Truths:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;, &lt;train, day, sunday&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;, &lt;train, day, sunday&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;, &lt;train, day, sunday&gt;</td></tr><tr><td rowspan=\"5\">Turn 3</td><td>System:</td><td>tr4212 is arriving at 9:52 would that work for you ?</td></tr><tr><td>User:</td><td>what time does that train depart ?</td></tr><tr><td>Ground Truths:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;, &lt;train, day, sunday&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;, &lt;train, day, sunday&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, destination, cambridge&gt;, &lt;train, departure, ely&gt;, &lt;train, day, sunday&gt;</td></tr><tr><td rowspan=\"5\">Turn 4</td><td>System:</td><td>the train leaves at 9:35 . shall i book it for you ?</td></tr><tr><td>User:</td><td>no , thank you . i would like to see if you could find a place for me to stay that would have a 4 star rating .</td></tr><tr><td>Ground Truths:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;</td></tr><tr><td rowspan=\"5\">Turn 5</td><td>System:</td><td>of course , there are many 4 star hotel -s to choose from . would you like me to book 1 for you ?</td></tr><tr><td>User:</td><td>not yet , thanks . are any of them guesthouses ?</td></tr><tr><td>Ground Truths:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, type, guest house&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, type, hotel&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, type, guest house&gt;</td></tr><tr><td rowspan=\"8\">Turn 6</td><td>System:</td><td>there are 18 guesthouses to choose from , do you have a preference to the area you would like to stay ?</td></tr><tr><td>User:</td><td>i need a 4 star , and in the east with free wifi for 4 people , 5 nights . i&#x27;ll need a reference number .</td></tr><tr><td>Ground Truths:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, yes&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, area, east&gt;, &lt;hotel, type, guest house&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, no&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, type, hotel&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, yes&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, type, guest house&gt;</td></tr><tr><td rowspan=\"6\">Turn 7</td><td>System:</td><td>do you want that guesthouse reservation to begin on sunday ?</td></tr><tr><td>User:</td><td>yes . i need 5 nights starting on sunday .</td></tr><tr><td>Ground Truths:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, yes&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;hotel, type, guest house&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, area, east&gt;, &lt;hotel, book day, sunday&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, yes&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;hotel, type, hotel&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel area, east&gt;, &lt;hotel, book day, sunday&gt;</td></tr><tr><td rowspan=\"6\">Turn 8</td><td>System:</td><td>i have confirmed your reservation at allenbell starting on sunday for 5 nights . your reference number is sltivabu . can i help with anything else ?</td></tr><tr><td>User:</td><td>that is all i need . thank you so much for all your help .</td></tr><tr><td>Ground Truths:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, yes&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;hotel, type, guest house&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, aea, &gt;, &lt;hotel, book day, sunday&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;train, day, sunday&gt;, &lt;hotel, book stay, 5&gt;, &lt;hotel, book people, 4&gt;, &lt;hotel, stars, 4&gt;, &lt;train, destination, cambridge&gt;, &lt;hotel, internet, yes&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;hotel, type, hotel&gt;, &lt;train, arrive by, 11:30&gt;, &lt;train, departure, ely&gt;, &lt;hotel, area, east&gt;, &lt;hotel, book day, sunday&gt;</td></tr></table>",
                "caption": "Table 7: Predicted dialog states of DS-Span and DS-DST for domains (i.e., train, hotel) in dialogue MUL0729 from the MultiWOZ 2.1 dataset."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1208,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "166"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    290,
                    936,
                    2195,
                    2353
                ],
                "angle": 0,
                "content": "<table><tr><td>Turn 1</td><td>User: Ground Truths: DS-Span: DS-DST:</td><td>i am planning a trip to go to a particular restaurant, can you assist?</td></tr><tr><td rowspan=\"5\">Turn 2</td><td>System:</td><td>sure, what is the name of this particular restaurant?</td></tr><tr><td>User:</td><td>it s called nandos and i would like to book it for monday at 15:00. there will be 6 people.</td></tr><tr><td>Ground Truths:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;restaurant, book people, 6&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;restaurant, book people, 6&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;restaurant, book people, 6&gt;</td></tr><tr><td rowspan=\"5\">Turn 3</td><td>System:</td><td>no problem! i have your table reserved for 15:00 on monday . they will hold your table for 15 minutes , your reference number is hvb51vam .</td></tr><tr><td>User:</td><td>thank you . am also looking for place -s to go in town . the attraction should be in the east</td></tr><tr><td>Ground Truths:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;</td></tr><tr><td rowspan=\"5\">Turn 4</td><td>System:</td><td>what are you looking to do? my system has located 10 place -s .</td></tr><tr><td>User:</td><td>could you recommend something ?</td></tr><tr><td>Ground Truths:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;/restaurant, book time, 15:00&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;</td></tr><tr><td rowspan=\"5\">Turn 5</td><td>System:</td><td>yes , the funky fun house is a great place .</td></tr><tr><td>User:</td><td>great ! can you tell me what the entrance fee is please ?</td></tr><tr><td>Ground Truths:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;attraction, name, funky fun house&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;attraction, name, funky fun house&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;</td></tr><tr><td rowspan=\"5\">Turn 6</td><td>System:</td><td>no , i am sorry . you will have to call them for the entrance fee . the phone number is 01223304705 .</td></tr><tr><td>User:</td><td>thank you . i am also looking to book a taxi to travel between the 2 . i need it to arrive to the restaurant by the reservation time .</td></tr><tr><td>Ground Truths:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;taxi, arrive by, 15:00&gt;, &lt;attraction, name, funky fun house&gt;, &lt;taxi, destination, nandos&gt;, &lt;taxi, departure, funky fun house&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;taxi, arrive by, 15:00&gt;, &lt;attraction, name, funky fun house&gt;, &lt;taxi, destination, nandos&gt;, &lt;taxi, departure, none&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;taxi, arrive by, 15:00&gt;, &lt;attraction, name, funky fun house&gt; , &lt;taxi, destination, nandos&gt;, &lt;taxi, departure, funky fun house&gt;</td></tr><tr><td rowspan=\"5\">Turn 7</td><td>System:</td><td>your taxi is booked and will be a white audi . the contact number is 07057575130 . how else may i help you ?</td></tr><tr><td>User:</td><td>that s all . thank you for your help !</td></tr><tr><td>Ground Truths:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;taxi, arrive by, 15:00&gt;, &lt;attraction, name, funky fun house&gt; , &lt;taxi, destination, nandos&gt;, &lt;taxi, departure, funky fun house&gt;</td></tr><tr><td>DS-Span:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;taxi, arrive by, 15:00&gt;, &lt;attraction, name, funky fun house&gt; , &lt;taxi, destination, nandos&gt;, &lt;taxi, departure, funky fun house&gt;</td></tr><tr><td>DS-DST:</td><td>&lt;restaurant, book day, monday&gt;, &lt;restaurant, name, nandos&gt;, &lt;restaurant, book people, 6&gt;, &lt;attraction, area, east&gt;, &lt;restaurant, book time, 15:00&gt;, &lt;taxi, arrive by, 15:00&gt;, &lt;attraction, name, funky fun house&gt; , &lt;taxi, destination, nandos&gt;, &lt;taxi, departure, funkyFun house&gt;</td></tr></table>",
                "caption": "Table 8: Predicted dialog states of DS-Span and DS-DST for domains (i.e., taxi, attraction, restaurant) in dialogue PMUL2428 from the MultiWOZ 2.1 dataset."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1205,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "167"
            }
        ]
    }
]