[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    396,
                    280,
                    2089,
                    354
                ],
                "angle": 0,
                "content": "Fact-Checking Complex Claims with Program-Guided Reasoning"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    538,
                    371,
                    1947,
                    494
                ],
                "angle": 0,
                "content": "Liangming Pan\\(^{1,2}\\) Xiaobao Wu\\(^{3}\\) Xinyuan Lu\\(^{4}\\) Anh Tuan Luu\\(^{3}\\) William Yang Wang\\(^{1}\\) Min-Yen Kan\\(^{4}\\) Preslav Nakov\\(^{2}\\)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    684,
                    512,
                    1788,
                    571
                ],
                "angle": 0,
                "content": "<sup>1</sup> University of California, Santa Barbara <sup>2</sup> MBZUAI"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    501,
                    575,
                    1974,
                    638
                ],
                "angle": 0,
                "content": "\\(^{3}\\) Nanyang Technological University \\(^{4}\\) National University of Singapore"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    409,
                    648,
                    2079,
                    705
                ],
                "angle": 0,
                "content": "liangmingpan@ucsb.edu xiaobao002@e.ntu.edu.sg luxinyuan@u.nus.edu"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    699,
                    708,
                    1773,
                    757
                ],
                "angle": 0,
                "content": "anhtuan.luu@ntu.edu.sg william@cs.ucsb.edu"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    632,
                    764,
                    1855,
                    817
                ],
                "angle": 0,
                "content": "kanmy@comp.nus.edu.sg preslav.nakov@mbzuai.ac.ae"
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    647,
                    887,
                    846,
                    936
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    352,
                    978,
                    1143,
                    2080
                ],
                "angle": 0,
                "content": "Fact-checking real-world claims often requires collecting multiple pieces of evidence and applying complex multi-step reasoning. In this paper, we present Program-Guided Fact-Checking (PROGRAMFC), a novel fact-checking model that decomposes complex claims into simpler sub-tasks that can be solved using a shared library of specialized functions. We first leverage the in-context learning ability of large language models to generate reasoning programs to guide the verification process. Afterward, we execute the program by delegating each sub-task to the corresponding sub-task handler. This process makes our model both explanatory and data-efficient, providing clear explanations of its reasoning process and requiring minimal training data. We evaluate PROGRAMFC on two challenging fact-checking datasets and show that it outperforms seven fact-checking baselines across different settings of evidence availability, with explicit output programs that benefit human debugging.<sup>1</sup>"
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    285,
                    2115,
                    645,
                    2167
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    280,
                    2203,
                    1210,
                    2592
                ],
                "angle": 0,
                "content": "The proliferation of disinformation, e.g., in social media, has made automated fact-checking a crucial application of natural language processing (NLP). Given a claim, the goal is to find evidence and then to make a verdict about the claim's veracity based on that evidence (Thorne and Vlachos, 2018; Glockner et al., 2022; Guo et al., 2022)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    277,
                    2599,
                    1213,
                    3108
                ],
                "angle": 0,
                "content": "Evaluating the veracity of real-world claims often involves collecting multiple pieces of evidence and applying complex reasoning (Jiang et al., 2020; Nguyen et al., 2020; Aly and Vlachos, 2022; Chen et al., 2022a). For instance, consider the claim \"Both James Cameron and the director of the film Interstellar were born in Canada\". It may be challenging to find direct evidence on the web that refutes or supports this claim."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1260,
                    891,
                    2195,
                    1452
                ],
                "angle": 0,
                "content": "Instead, a human fact-checker needs to decompose the claim, gather multiple pieces of evidence, and perform step-by-step reasoning (Nakov et al., 2021a), as illustrated in Figure 1. This makes verifying complex claims much more challenging than the typical setting explored in previous work, where information from a single article is sufficient to support/refute the claim (Thorne et al., 2018; Saakyan et al., 2021; Schuster et al., 2021; Pan et al., 2021; Wadden et al., 2022a; Krishna et al., 2022)."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1260,
                    1462,
                    2195,
                    2480
                ],
                "angle": 0,
                "content": "Besides multi-step reasoning, we still need to consider two key aspects for developing a reliable fact-checking system: (i) Explanability: The model should not only predict the veracity of the claim, but it should also provide a clear explanation of its reasoning process to help users understand and trust the results. (ii) Data efficiency: Human annotation is often time-consuming, costly, and potentially biased, making it difficult to collect sufficient high-quality labeled data for model training, particularly for complex claims. Therefore, it is desirable to build a model that can perform well with minimal or no training data. Despite a few models (Zhou et al., 2019; Zhong et al., 2020; Aly and Vlachos, 2022) being proposed to facilitate multi-step reasoning in fact-checking, they either lack explainability in their reasoning process or require a large number of task-specific training examples."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1260,
                    2490,
                    2193,
                    3223
                ],
                "angle": 0,
                "content": "In this paper, we present Program-Guided Fact-Checking (PROGRAMFC), a novel fact-checking framework that is both explanatory and data-efficient. Figure 1 illustrates our approach. To verify complex claims, PROGRAMFC decomposes them into simpler sub-tasks that can be solved using a shared library of specialized sub-task functions. To be specific, PROGRAMFC begins by generating a reasoning program for the input claim, which is a sequence of sub-tasks (e.g., S1-S4 in Figure 1) in the form of ACTION[ARGUMENT], where ACTION and ARGUMENT define the type and the content of the sub-task, respectively."
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    282,
                    3132,
                    1210,
                    3223
                ],
                "angle": 0,
                "content": "<sup>1</sup>The program code and the data are publicly available at https://github.com/mbzuai-nlp/ProgramFC"
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1190,
                    3255,
                    1287,
                    3301
                ],
                "angle": 0,
                "content": "6981"
            },
            {
                "block_id": 17,
                "type": "footer",
                "bbox": [
                    563,
                    3318,
                    1910,
                    3360
                ],
                "angle": 0,
                "content": "Proceedings of the 61st Annual Meeting of the Association for Computational Linguistics"
            },
            {
                "block_id": 18,
                "type": "footer",
                "bbox": [
                    917,
                    3364,
                    1560,
                    3406
                ],
                "angle": 0,
                "content": "Volume 1: Long Papers, pages 6981-7004"
            },
            {
                "block_id": 19,
                "type": "footer",
                "bbox": [
                    736,
                    3409,
                    1741,
                    3455
                ],
                "angle": 0,
                "content": "July 9-14, 2023 ©2023 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    290,
                    298,
                    2195,
                    1122
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: Overview of our PROGRAMFC model, which consists of two modules: (i) Program Generation generates a reasoning program for the input claim using Codex with in-context learning, and then (ii) Program Execution sequentially interprets the program by delegating each step to the corresponding sub-task function."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    280,
                    1399,
                    1213,
                    1848
                ],
                "angle": 0,
                "content": "The generated reasoning program serves as a step-by-step guide for verifying the claim. We then execute the program by sequentially delegating each sub-task to the corresponding sub-task handler, as shown in the functions columns in Figure 1. These sub-tasks may include answering questions, verifying simple claims, or conducting logical reasoning."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    280,
                    1859,
                    1215,
                    2876
                ],
                "angle": 0,
                "content": "PROGRAMFC combines explainability with data efficiency. It uses reasoning programs to provide clear explanations of its reasoning process. For data efficiency, Large Language Models (LLMs) can solve various tasks given only a few examples as prompts, e.g., in-context learning (Brown et al., 2020). We leverage this ability of LLMs to generate reasoning programs for a given claim by showing the model just a few dozen of (claim, program) pairs as demonstrations. PROGRAMFC is also flexible as it allows for easy swapping of subtask function implementations to work under different settings of fact-checking, without affecting the rest of the system. We can allow the functions to retrieve information from external sources (in an open-book setting) or we can ask them to generate answers based solely on the LLM's internal parametric knowledge (in a closed-book setting)."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    280,
                    2887,
                    1215,
                    3223
                ],
                "angle": 0,
                "content": "We evaluate PROGRAMFC on two challenging datasets designed for fact-checking complex claims: HOVER (Jiang et al., 2020) and FEVEROUS (Aly et al., 2021), and we show that it outperforms seven few-shot fact-checking baselines on both datasets (§ 4.1)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1260,
                    1399,
                    2195,
                    1957
                ],
                "angle": 0,
                "content": "The strategy of program-guided reasoning becomes increasingly effective as the required reasoning depth increases (§ 4.1). In the open-domain setting, we find that reasoning programs can enhance the retrieval of relevant evidence from knowledge sources (§ 4.2). Moreover, PROGRAMFC is robust even when we use weak models as sub-task solvers (§ 4.2). We also evaluate the interpretability of the reasoning programs through human evaluation and error analysis (§ 4.3)."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1262,
                    2006,
                    1652,
                    2059
                ],
                "angle": 0,
                "content": "2 Related Work"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1260,
                    2097,
                    2195,
                    3223
                ],
                "angle": 0,
                "content": "Fact-Checking. Automated fact-checking has gained significant attention in the NLP research community in recent years as a means of combatting misinformation and disinformation. Various datasets have been proposed that enable the development and the evaluation of systems for automatic fact-checking, the most popular ones being based on human-crafted claims from Wikipedia content (Thorne et al., 2018; Sathe et al., 2020; Schuster et al., 2021) and naturally occurring claims in the political or in the scientific domain (Wang, 2017; Nakov et al., 2021b, 2022; Augenstein et al., 2019; Saakyan et al., 2021; Gupta and Srikumar, 2021; Wadden et al., 2020, 2022a). Notably, most of these datasets are constructed in a way that the evidence to support or to refute a claim can be found in a single document. For example, in FEVER (Thorne et al., 2018), more than \\(87\\%\\) of the claims only require information from a single Wikipedia article (Jiang et al., 2020)."
            },
            {
                "block_id": 8,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6982"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    280,
                    298,
                    1223,
                    1094
                ],
                "angle": 0,
                "content": "To bridge this gap, datasets have been proposed to study fact-checking complex claims that require multi-step reasoning (Jiang et al., 2020; Aly et al., 2021). Graph-based models (Zhou et al., 2019; Liu et al., 2020; Zhong et al., 2020; Nguyen et al., 2020; Barnabò et al., 2022, 2023) are used to facilitate the reasoning over multiple pieces of evidence. Although such models achieve sizable performance gains, they lack explainability and they rely on large amounts of training data. To address the above problems, we propose an explainable, flexible, and data-efficient model that generates reasoning graphs as explanations and utilizes in-context learning to enable few-shot learning."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    280,
                    1143,
                    1220,
                    2329
                ],
                "angle": 0,
                "content": "Explanation Generation. Facing the complexities of real-world claims, simply giving a final veracity to a claim often fails to be persuasive (Guo et al., 2022). Previous research has proposed various approaches to provide post-hoc explanations for model predictions, such as using attention weights to highlight relevant parts of the evidence (Popat et al., 2017; Cui et al., 2019; Yang et al., 2019; Lu and Li, 2020), generating justifications with logic-based systems based on knowledge graphs (Gad-Elrab et al., 2019; Ahmadi et al., 2019), and generating a summary of the retrieved relevant evidence (Atanasova et al., 2020; Kotonya and Toni, 2020; Jolly et al., 2022). In contrast, we propose to use reasoning programs to provide explanations that consist of sub-tasks described in a program-like natural language. This offers several advantages: it allows for explanations that are not confined to the evidence, like attention weights, it is more flexible than logic-based explanations, and it is more concise than free-form summarization."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    280,
                    2381,
                    1223,
                    3227
                ],
                "angle": 0,
                "content": "Chain-of-Thought Reasoning. Moreover, unlike previous work that generates post-hoc explanations, we also use reasoning programs as guidance for predicting the veracity of the claim. This is motivated by the recent success of chain-of-thought prompting (CoT) (Wei et al., 2022; Kojima et al., 2022; Wang et al., 2022), which generates step-by-step natural language reasoning steps to guide the model in answering complex questions. We adopt this idea to fact-checking complex claims. Unlike the original CoT, which uses a single LLM for both decomposition and question answering, we use the language model only to generate reasoning programs as the blueprint for problem-solving, and we delegate each sub-task to specialized functions."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1260,
                    298,
                    2200,
                    806
                ],
                "angle": 0,
                "content": "This approach reduces the burden on the language model and allows for more flexibility in incorporating necessary components for fact-checking such as an evidence retriever. The strategy of program-guided reasoning is also in line with the recent trend of tool-augmented language models (Mialon et al., 2023; Schick et al., 2023), i.e., augmenting language models with access to external tools and resources."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    1262,
                    845,
                    1662,
                    898
                ],
                "angle": 0,
                "content": "3 PROGRAMFC"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1260,
                    936,
                    2198,
                    1105
                ],
                "angle": 0,
                "content": "We first formulate the problem of fact-checking and then we introduce our proposed model for Program-Guided Fact-Checking (PROGRAMFC)."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1262,
                    1140,
                    1803,
                    1189
                ],
                "angle": 0,
                "content": "3.1 Problem Formulation"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1260,
                    1213,
                    2195,
                    1610
                ],
                "angle": 0,
                "content": "Given a claim \\( C \\), a fact-checking model \\( \\mathcal{F} \\) aims to predict a label \\( Y \\) to evaluate the claim as TRUE or FALSE, based on a knowledge source \\( \\mathcal{K} \\). The model is also required to output an explanation \\( E \\) to justify the predicted veracity label. We summarize three different settings of fact-checking depending on the type of knowledge source \\( \\mathcal{K} \\)."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1260,
                    1620,
                    2190,
                    1845
                ],
                "angle": 0,
                "content": "- Gold evidence: For each claim, \\(\\kappa\\) is the set of gold evidence documents that can support or refute the claim. This setting is also called claim verification (Pan et al., 2021; Wright et al., 2022)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    1848,
                    2193,
                    2122
                ],
                "angle": 0,
                "content": "- Open-book setting: \\(\\kappa\\) is a large textual corpus such as Wikipedia. The model first retrieves relevant evidence from the corpus and then predicts the veracity label based on the evidence (Jiang et al., 2021; Wadden et al., 2022b)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1260,
                    2129,
                    2195,
                    2522
                ],
                "angle": 0,
                "content": "- Closed-book setting: The model does not have access to any external knowledge source (\\(\\mathcal{K} = \\emptyset\\)). It needs to leverage the knowledge stored in its parameters (acquired during pre-training and finetuning) to verify the claim. This setting was explored in work that applies large language models for fact-checking (Lee et al., 2020, 2021)."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    1260,
                    1620,
                    2195,
                    2522
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1262,
                    2560,
                    1932,
                    2613
                ],
                "angle": 0,
                "content": "3.2 Program-Guided Reasoning"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1260,
                    2631,
                    2195,
                    2971
                ],
                "angle": 0,
                "content": "Our goal is to fact-check a complex claim \\( C \\) that requires multi-step reasoning. We focus on the few-shot setting, where only a small set of in-domain examples are available to teach the model. To solve this, PROGRAMFC follows a program generation-and-execution paradigm, as shown in Figure 1."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1260,
                    3002,
                    2193,
                    3227
                ],
                "angle": 0,
                "content": "Program Generation. At this stage, given the input claim \\( C \\), a planner \\( \\mathcal{P} \\) generates a reasoning program \\( P = [S_1, \\dots, S_n] \\) for it, which consists of \\( n \\) sequentially ordered reasoning steps \\( S_i \\)."
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3304
                ],
                "angle": 0,
                "content": "6983"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    280,
                    298,
                    1215,
                    975
                ],
                "angle": 0,
                "content": "Each reasoning step \\( S_{i} \\in P \\) is an instruction in controlled natural language that directs \\( S_{i} \\) to a function in an auxiliary set of sub-task functions \\( \\mathcal{F} \\) available to the system. To be specific, we define \\( S_{i} = (f_{i}, A_{i}, V_{i}) \\), where \\( f_{i} \\) specifies the sub-task function \\( f_{i} \\in \\mathcal{F} \\), \\( A_{i} \\) is the argument passed to the function \\( f_{i} \\), and \\( V_{i} \\) is the variable that stores the returned result from the function call \\( f_{i}(A_{i}) \\). For a valid reasoning program, the return value of the last reasoning step must be a Boolean value indicating the veracity label of the claim \\( C \\), i.e., \\( V_{n} \\in \\{\\text{TRUE}, \\text{FALSE}\\} \\)."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    280,
                    1003,
                    1215,
                    2188
                ],
                "angle": 0,
                "content": "Program Execution. In the execution stage, the reasoning program \\( P \\) is run by an interpreter to derive the veracity label of the claim \\( C \\). The interpreter sequentially parses the reasoning steps in \\( P \\). For each step \\( S_{i} = (f_{i}, A_{i}, V_{i}) \\), it calls the corresponding off-the-shelf sub-task function \\( f_{i} \\) and passes the argument \\( A_{i} \\) to it. The argument \\( A_{i} \\) is either a logical expression or a natural language sentence, e.g., a question or a simple claim. The result of the function call is then stored in the variable \\( V_{i} \\). As it is common for a subsequent step to depend on the results from previous steps, we allow the argument \\( A_{i} \\) to refer to variables \\( V_{1}, \\dots, V_{i-1} \\) in previous steps. For example, in Figure 1, the argument in \\( S_{3} \\) is “{ANSWER_1} was born in Canada,” which refers to the return variable {ANSWER_1} from \\( S_{2} \\). When executing \\( S_{3} \\), the variable is replaced by its actual value, and the argument becomes “Christopher Nolan was born in Canada”. After executing the last step, the return value is the predicted veracity of the claim \\( C \\)."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    280,
                    2217,
                    1215,
                    2837
                ],
                "angle": 0,
                "content": "Aggregating Reasoning Paths. Note that there might be multiple reasoning paths that can reach the final veracity label. Therefore, we generate a diverse set of \\( N \\) candidate reasoning programs \\( \\mathcal{P} = \\{P_1, \\dots, P_N\\} \\) for the input claim. After executing all programs in \\( \\mathcal{P} \\), we take the majority vote over all \\( N \\) predicted labels as the final label. This approach is similar to how humans rely on multiple methods of validation to increase their confidence in fact-checking. It also makes the model less susceptible to errors in individual reasoning programs."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    282,
                    2873,
                    1019,
                    2925
                ],
                "angle": 0,
                "content": "3.3 Reasoning Program Generation"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    280,
                    2943,
                    1210,
                    3223
                ],
                "angle": 0,
                "content": "We base our program generator on Codex (Chen et al., 2021), a code-pretrained LLM, which can parse natural language into symbolic representations such as SQL (Cheng et al., 2022) or Python programs (Gao et al., 2022; Chen et al., 2022b)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1260,
                    298,
                    2195,
                    1375
                ],
                "angle": 0,
                "content": "However, the grammar of a reasoning program is different from the grammar of a programming language. We take advantage of Codex's few-shot generalization ability and we find that it can learn effectively from only a small number of in-context examples \\(\\mathcal{D} = \\{d_1,\\dots ,d_{|D|}\\}\\). Each example \\(d_{i}\\) consists of a claim and a program. The program has a Python-like grammar, where each reasoning step is written in the format \\(V_{i} = f_{i}(A_{i})\\). At inference time, we prompt Codex with an instruction of the task, \\(K\\) in-context examples, and the input claim \\(C\\). Codex then attempts to complete the following texts, and thereby generates a program for \\(C\\). The prompt template is shown in Figure 2. We use \\(K = 20\\) to maintain a tradeoff between the diversity of reasoning types and the model's maximum input capacity. We use sampling-based decoding (temperature of 0.7) to generate different reasoning programs for multiple runs."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1262,
                    1403,
                    1771,
                    1455
                ],
                "angle": 0,
                "content": "3.4 Sub-Task Functions"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1260,
                    1476,
                    2188,
                    1589
                ],
                "angle": 0,
                "content": "We implement three sub-task functions for the model to call during the program execution."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1260,
                    1599,
                    2193,
                    2220
                ],
                "angle": 0,
                "content": "- QUESTION: This sub-task function is a question-answering module that takes a question \\(Q\\) as the input argument and returns the answer \\(A\\) to the question. We use FLAN-T5 (Chung et al., 2022), an improved T5 model (Raffel et al., 2020) pretrained on more than 1.8K tasks with instruction tuning, which has achieved state-of-the-art zero/few-shot performance on many QA benchmarks. As shown in Figure 3, we prompt the model differently depending on the settings defined in Section 3.1. For the closed-book setting, the input prompt is"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1352,
                    2238,
                    2002,
                    2301
                ],
                "angle": 0,
                "content": "Q: QUESTION? The answer is:"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    2315,
                    2108,
                    2367
                ],
                "angle": 0,
                "content": "For the other two settings, the input prompt is"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1362,
                    2381,
                    1897,
                    2445
                ],
                "angle": 0,
                "content": "EVIDENCE Q: QUESTION?"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1357,
                    2448,
                    1682,
                    2490
                ],
                "angle": 0,
                "content": "The answer is:"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1260,
                    2515,
                    2188,
                    2795
                ],
                "angle": 0,
                "content": "- VERIFY: This is a fact verification module that takes a claim \\(C\\) as the input argument and returns a label of either TRUE or FALSE. We also use FLAN-T5 for this module, by prompting the model with the following question-answering format."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1362,
                    2813,
                    1567,
                    2862
                ],
                "angle": 0,
                "content": "EVIDENCE"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1352,
                    2869,
                    1964,
                    2929
                ],
                "angle": 0,
                "content": "Q: Is it true that CLAIM?"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1352,
                    2929,
                    2022,
                    2978
                ],
                "angle": 0,
                "content": "True or False? The answer is:"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1260,
                    2999,
                    2188,
                    3223
                ],
                "angle": 0,
                "content": "- PREDICT: This module takes as input a logical expression that performs AND, OR, NOT operations over the variables in the previous steps. Its output is returned as the predicted veracity label."
            },
            {
                "block_id": 18,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6984"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code",
                "bbox": [
                    379,
                    312,
                    2071,
                    1027
                ],
                "angle": 0,
                "content": "```\n'''Generate a python-like program that describes the reasoning steps required to verify the claim step-by-step. You can call three functions in the program: 1. Question() to answer a question; 2. Verify() to verify a simple claim; 3. Predict() to predict the veracity label.''\n# The claim is that Both James Cameron and the director of the film Interstellar were born in Canada.\ndef program():\n    fact_1 = Verify(\"James Cameron was born in Canada.\")\n    Answer_1 = Question(\"Who is the director of the film Interstellar?.\")\n    fact_2 = Verify(\"\\\\{Answer_1} was born in Canada.\")\n    label = Predict(fact_1 and fact_2)\n...\nThe claim is that <input_claim>\ndef program():\n    print('Please input your name')\nprint('Please input your phone number')\nprint('Please input your address')\nprint('Please input your state')\nprint('Please input your zip code')\nprint('Please input your state's zip code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's state code')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's statusquo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quo')\nprint('Please input your state's status quaqu);\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');\nprint('Please input your state's status quo');"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    302,
                    1220,
                    1195,
                    1596
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 3: Implementation of the question-answering sub-task function for three different settings."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    285,
                    1817,
                    645,
                    1876
                ],
                "angle": 0,
                "content": "4 Experiments"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    280,
                    1925,
                    1215,
                    3223
                ],
                "angle": 0,
                "content": "Datasets. Most fact-checking datasets consist primarily of simple claims that can be substantiated through a single piece of evidence. However, here we focus on complex claims that need multi-step reasoning. Given this context, we opt to evaluate our model on the only two datasets that, to the best of our knowledge, fulfill these criteria: HOVER (Jiang et al., 2020) and FEVEROUS (Aly et al., 2021). We use the validation sets for evaluation since the test sets are not publicly released. HOVER contains claims that require integration and reasoning over multiple Wikipedia articles. We divide its validation set into three subsets based on the number of \"hops\" required to verify the claim: 1,126 two-hop claims, 1,835 three-hop claims, and 1,039 four-hop claims. FEVEROUS focuses on fact-checking complex claims over unstructured and structured data, where each claim is annotated with evidence in the form of sentences and/or cells from tables in Wikipedia. Since we focus on textual fact-checking, we only selected claims that require exclusively sentence evidence, constituting 2,962 claims. We call this subset FEVEROUS-S."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1260,
                    1231,
                    2195,
                    1683
                ],
                "angle": 0,
                "content": "For evaluation in the open-book setting, we use the corresponding Wikipedia corpus constructed for these two datasets as the knowledge sources. HOVER uses the October 2017 Wikipedia dump processed by Yang et al. (2018), consisting of the introductory sections of 5.2 million Wikipedia pages. FEVEROUS uses the December 2020 dump, including 5.4 million full Wikipedia articles."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1260,
                    1722,
                    2195,
                    2911
                ],
                "angle": 0,
                "content": "Baselines. We compare PROGRAMFC to seven baselines, categorized into three groups. (i) Pre-trained models: BERT-FC (Soleimani et al., 2020) and LisT5 (Jiang et al., 2021) are two models that leverage BERT and T5 for fact verification, respectively. (ii) FC/NLI fine-tuned models: we choose three pretrained models that are fine-tuned on other fact-checking datasets or natural language inference (NLI) datasets. RoBERTa-NLI (Nie et al., 2020) uses fine-tuned RoBERTa-large on four NLI datasets; DeBERTaV3-NLI (He et al., 2021) fine-tunes the DeBERTaV3 model on 885,242 (claim, evidence, label) annotations from FEVER and four NLI datasets. MULTIVERS (Wadden et al., 2022b) is a LongFormer (Beltagy et al., 2020) model fine-tuned on FEVER. (iii) In-context learning models: one baseline is that we directly use the FLAN-T5 model in our VERIFY module for fact-checking. The other baseline uses the in-context learning of Codex for few-shot fact-checking. The implementation details are given in Appendix A."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1260,
                    2943,
                    2193,
                    3223
                ],
                "angle": 0,
                "content": "Few-Shot Learning. We study few-shot learning where only a few in-domain examples are available. Therefore, for a fair comparison, we restrict all models to have access to only 20 examples from HOVER or FEVERIOUS-S."
            },
            {
                "block_id": 9,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6985"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    307,
                    287,
                    2195,
                    978
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\" colspan=\"2\">Few-shot learning models</td><td colspan=\"2\">HOVER (2-hop)</td><td colspan=\"2\">HOVER (3-hop)</td><td colspan=\"2\">HOVER (4-hop)</td><td colspan=\"2\">FEVEROUS-S</td></tr><tr><td>Gold</td><td>Open</td><td>Gold</td><td>Open</td><td>Gold</td><td>Open</td><td>Gold</td><td>Open</td></tr><tr><td rowspan=\"2\">I</td><td>BERT-FC (Soleimani et al., 2020)</td><td>53.40</td><td>50.68</td><td>50.90</td><td>49.86</td><td>50.86</td><td>48.57</td><td>74.71</td><td>51.67</td></tr><tr><td>List5 (Jiang et al., 2021)</td><td>56.15</td><td>52.56</td><td>53.76</td><td>51.89</td><td>51.67</td><td>50.46</td><td>77.88</td><td>54.15</td></tr><tr><td rowspan=\"3\">II</td><td>RoBERTa-NLI (Nie et al., 2020)</td><td>74.62</td><td>63.62</td><td>62.23</td><td>53.99</td><td>57.98</td><td>52.40</td><td>88.28</td><td>57.80</td></tr><tr><td>DeBERTaV3-NLI (He et al., 2021)</td><td>77.22</td><td>68.72</td><td>65.98</td><td>60.76</td><td>60.49</td><td>56.00</td><td>91.98</td><td>58.81</td></tr><tr><td>MULTIVERS (Wadden et al., 2022b)</td><td>68.86</td><td>60.17</td><td>59.87</td><td>52.55</td><td>55.67</td><td>51.86</td><td>86.03</td><td>56.61</td></tr><tr><td rowspan=\"2\">III</td><td>Codex (Chen et al., 2021)</td><td>70.63</td><td>65.07</td><td>66.46</td><td>56.63</td><td>63.49</td><td>57.27</td><td>89.77</td><td>62.58</td></tr><tr><td>FLAN-T5 (Chung et al., 2022)</td><td>73.69</td><td>69.02</td><td>65.66</td><td>60.23</td><td>58.08</td><td>55.42</td><td>90.81</td><td>63.73</td></tr><tr><td rowspan=\"2\">IV</td><td>ProgramFC (N=1)</td><td>74.10</td><td>69.36</td><td>66.13</td><td>60.63</td><td>65.69</td><td>59.16</td><td>91.77</td><td>67.80</td></tr><tr><td>ProgramFC (N=5)</td><td>75.65</td><td>70.30</td><td>68.48</td><td>63.43</td><td>66.75</td><td>57.74</td><td>92.69</td><td>68.06</td></tr></table>",
                "caption": "Table 1: Macro-F1 scores of PROGRAMFC (IV) and baselines (I-III) on the evaluation set of HOVER and FEVEROUS-S for few-shot fact-checking. Gold and Open represent the gold evidence setting and the open book setting, respectively. I: pretrained Transformers; II: FC/NLI fine-tuned models; III: in-context learning models."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    280,
                    1252,
                    1213,
                    1585
                ],
                "angle": 0,
                "content": "We use these examples either for fine-tuning pre-trained models (BERT-FC and Li sT5), for continuous fine-tuning the FC/NLI fine-tuned models, or as in-context examples for FLAN-T5 and Codex. For PROGRAMFC, we use them as in-context examples for reasoning program generation."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    280,
                    1596,
                    1215,
                    2160
                ],
                "angle": 0,
                "content": "We evaluate both the gold evidence setting and the open-book setting. The baseline models are the same for both settings. However, during testing in the open-book setting, the models are given the retrieved evidence rather than the ground-truth evidence. We use BM25 (Robertson and Zaragoza, 2009) implemented with the Pyserini toolkit (Lin et al., 2021) as the retriever for both PROGRAMFC and the baselines. We use as evidence the top-10 paragraphs retrieved from the knowledge corpus."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    282,
                    2217,
                    659,
                    2266
                ],
                "angle": 0,
                "content": "4.1 Main Results"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    280,
                    2297,
                    1215,
                    2585
                ],
                "angle": 0,
                "content": "We report the overall results for PROGRAMFC and for the baselines for few-shot fact-checking in Table 1. PROGRAMFC achieves the best performance on 7 out of 8 evaluations, demonstrating its effectiveness. We have three more specific observations."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    282,
                    2602,
                    1178,
                    2655
                ],
                "angle": 0,
                "content": "ProgramFC is more effective on deeper claims."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    280,
                    2662,
                    1215,
                    3223
                ],
                "angle": 0,
                "content": "On the HOVER dataset, ProgramFC (N=5) outperforms the baselines on average by \\(10.38\\%\\), \\(11.37\\%\\), and \\(14.77\\%\\) on two-hop, three-hop, and four-hop claims, respectively. This suggests that ProgramFC becomes increasingly effective as the required reasoning depth increases. Among the baselines, DeBERTaV3-NLI performs comparably to ProgramFC on two-hop claims, indicating that large-scale pre-training on simpler claims can help the model generalize to more complex claims."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1260,
                    1252,
                    2195,
                    1701
                ],
                "angle": 0,
                "content": "However, this generalization becomes more challenging as the complexity of the claims increases. On HOVER, the F1 score of DeBERTaV3-NLI drops from 77.22 for 2-hop claims to 60.49 for 4-hop claims, which is a decrease of \\(21.7\\%\\). In contrast, the performance drop for ProgramFC, which uses the strategy of program-guided reasoning, is much smaller: just \\(11.7\\%\\)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1260,
                    1743,
                    2195,
                    2532
                ],
                "angle": 0,
                "content": "Decomposition is more effective than one-step prediction. The ProgramFC model, which uses the same FLAN-T5 model as the sub-task functions, outperforms the baseline of directly verifying claims with FLAN-T5 on all four datasets. On average, there is a \\(6.0\\%\\) improvement in the gold evidence setting and a \\(4.5\\%\\) improvement in the open-book setting. This suggests that decomposing a complex claim into simpler steps with a program can facilitate more accurate reasoning. This is especially evident when the required reasoning is complex: there is a \\(14.9\\%\\) improvement in the gold evidence setting and a \\(6.7\\%\\) improvement in the open-book setting for 4-hop claims."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1262,
                    2578,
                    2121,
                    2634
                ],
                "angle": 0,
                "content": "Aggregating reasoning programs is helpful."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1260,
                    2662,
                    2195,
                    3223
                ],
                "angle": 0,
                "content": "We find that aggregating the predictions of \\( N = 5 \\) reasoning programs improves the performance over using a single program by an average of \\( 1.5\\% \\). This aligns with the findings of Wang et al. (2022), where the idea was applied for question answering: if multiple different ways of thinking lead to the same answer, we can have greater confidence that the final answer is correct. This intuition also applies to fact-checking, as each program represents a unique reasoning chain to verify the claim."
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6986"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    292,
                    312,
                    885,
                    768
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 1,
                "type": "image",
                "bbox": [
                    935,
                    312,
                    1538,
                    768
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1587,
                    312,
                    2188,
                    768
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 4: F1 score for fact-checking with gold evidence using FLAN-T5 (blue line) and PROGRAMFC (green line) for language models of increasing sizes: FLAN-T5-small (80M), FLAN-T5-base (250M), FLAN-large (780M), FLAN-T5-XL (3B), and FLAN-T5-XXL (11B) on HOVER 2-hop (left), 3-hop (middle), and 4-hop (right)."
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    300,
                    1048,
                    1178,
                    1497
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 5: Retrieval recall@10 for the one-step retrieval and the iterative retrieval in PROGRAMFC."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    282,
                    1711,
                    1195,
                    1771
                ],
                "angle": 0,
                "content": "4.2 How Does the Reasoning Program Help?"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    280,
                    1806,
                    1215,
                    2876
                ],
                "angle": 0,
                "content": "To further understand how reasoning programs facilitate fact-checking, we compare the performance of PROGRAMFC with FLAN-T5 using different language model sizes: small, base, large, XL, and XXL. The results are shown in Figure 4 and indicate that program-guided reasoning is particularly effective when the model size is small. As smaller models have less capacity for complex reasoning, the performance of the end-to-end FLAN-T5 model decreases significantly with decreasing model size. However, this trend is less notable for PROGRAMFC. The high-level reasoning plan offered by reasoning programs substantially alleviates the demands on the subsequent subtask solvers. Our results show that the program-guided model using FLAN-T5-small (80M parameters) as sub-task solvers can achieve comparable performance to the 137x larger FLAN-T5-XXL (11B) model with end-to-end reasoning for 4-hop claims."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    280,
                    2887,
                    1215,
                    3227
                ],
                "angle": 0,
                "content": "In the open-domain setting, we find that reasoning programs can enhance the retrieval of relevant evidence from the knowledge source. Figure 5 compares the retrieval performance of the one-step BM25 retriever used in the baselines to the iterative step-by-step BM25 retriever in PROGRAMFC."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1260,
                    1055,
                    2195,
                    1736
                ],
                "angle": 0,
                "content": "We measure the recall of the gold paragraphs for the top-10 retrieved paragraphs (recall@10). For PROGRAMFC, we combine the retrieved paragraphs of all steps and we consider the top-10 results. We can see in Figure 5 that PROGRAMFC outperforms one-step retrieval on all datasets, with the largest improvement of \\(37.1\\%\\) on HOVER 4-hop. This is because some information may not be present in the original claim, but is only revealed during the reasoning process (e.g., “Christopher Nolan” in Figure 1). Thus, iterative retrieval guided by the reasoning program yields better results."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1260,
                    1785,
                    2148,
                    1841
                ],
                "angle": 0,
                "content": "4.3 Interpretability of Reasoning Programs"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1257,
                    1866,
                    2193,
                    2992
                ],
                "angle": 0,
                "content": "An advantage of PROGRAMFC is that it improves the interpretability of fact-checking compared to end-to-end models, as the explicit program can aid human understanding and debugging. Examples of generated reasoning programs can be found in Figure 7 of Appendix B. To assess the quality of the generated reasoning programs, we sampled 300 claims where PROGRAMFC incorrectly predicted the final veracity labels from the HOVER 2-hop, 3-hop, and 4-hop datasets, with 100 examples per dataset. We asked human annotators to analyze the error types and we classified the results into three categories: (i) Syntactic errors, where the program does not conform to the defined grammar and cannot be parsed, (ii) Semantic errors, which include incorrect or missing arguments/variables (Token), incorrect program structure (Structure), and incorrect sub-task calls (Subtask), and (iii) Incorrect execution, where the program is correct, but where the incorrect prediction is a result of its execution."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1260,
                    2999,
                    2195,
                    3227
                ],
                "angle": 0,
                "content": "We show the error analysis in Table 2. First, no syntax errors were found in our samples, indicating that Codex effectively generates executable programs through few-shot in-context learning."
            },
            {
                "block_id": 13,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6987"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code",
                "bbox": [
                    359,
                    298,
                    2116,
                    775
                ],
                "angle": 0,
                "content": "Claim: Emery, located in the same state as Edison Local School District, is a ghost town. It is near the city that lies close to the Ohio Turnpike, a 241.26 mi highway.   \nPredicted Program:   \nanswer_1 = Question(\"Which state is Emery located in?\")   \nanswer_2 = Question(\"Which state is Edison Local School District located in?\")   \nfact_1 = Verify(\" {answer_1} and {answer_2} are the same state.\")   \nfact_2 = Verify(\"Emery is a ghost town.\")   \nanswer_3 = Question(\"Which city is near Emery?\")   \nanswer_4 = Question(\"Which city lies close to the Ohio Turnpike, a 241.26 mi highway?\")   \nfact_3 = Verify(\" {answer_3} is near {answer_4}.\") \\(\\longrightarrow\\) fact_3 \\(=\\) Verify(\"Emery is near {answer_4}.\")   \nlabel \\(=\\) Predict(fact_1 and fact_2 and fact_3)"
            },
            {
                "block_id": 1,
                "type": "image_caption",
                "bbox": [
                    280,
                    817,
                    2190,
                    919
                ],
                "angle": 0,
                "content": "Figure 6: An error case from the HOVER 4-hop dataset where the generated reasoning program has an incorrect program structure. The incorrect segment(s) are marked in red, and the correct revisions are marked in green."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    297,
                    999,
                    1205,
                    1427
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Error Type</td><td colspan=\"3\">Proportion (%)</td></tr><tr><td>2-hop</td><td>3-hop</td><td>4-hop</td></tr><tr><td>Syntax error</td><td>0%</td><td>0%</td><td>0%</td></tr><tr><td>Semantic error</td><td>29%</td><td>38%</td><td>77%</td></tr><tr><td>Token</td><td>8%</td><td>20%</td><td>18%</td></tr><tr><td>Structure</td><td>19%</td><td>13%</td><td>57%</td></tr><tr><td>Subtask</td><td>2%</td><td>5%</td><td>2%</td></tr><tr><td>Incorrect execution</td><td>71%</td><td>62%</td><td>23%</td></tr></table>",
                "caption": "Table 2: Reasoning program evaluation for incorrectly-predicted examples from each hop length in HOVER."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    280,
                    1645,
                    1213,
                    1925
                ],
                "angle": 0,
                "content": "Second, for 2-hop claims, we find that \\(71\\%\\) of the programs are correct. The majority of the errors are the result of incorrect program execution, where the question answering or the fact-checking modules failed to return the correct answer."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    280,
                    1932,
                    1213,
                    2550
                ],
                "angle": 0,
                "content": "Third, as the complexity of the claims increases, the proportion of semantic errors in the programs also increases, with structural errors becoming particularly prevalent. This highlights the difficulty of generating the appropriate step-by-step reasoning strategies for claims that require long-chain reasoning. An example structural error is shown in Figure 6, where the model fails to parse the second sentence of the claim into correct program instructions. Additional error examples can be found in Appendix C."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    282,
                    2588,
                    947,
                    2648
                ],
                "angle": 0,
                "content": "4.4 Closed-Book Fact-Checking"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    280,
                    2662,
                    1215,
                    3220
                ],
                "angle": 0,
                "content": "Finally, we evaluate the closed-book setting, where the model does not have access to any knowledge source and needs to rely on its parametric knowledge only. The baseline models from groups I and II in Table 1 are trained with (evidence, claim) pairs and thus are not applicable in this setting. We compare our method to the baselines that use large language models for in-context learning, including Codex (code-davinci-002) and FLAN-T5 from Table 1."
            },
            {
                "block_id": 8,
                "type": "table",
                "bbox": [
                    1287,
                    999,
                    2190,
                    1589
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Model</td><td colspan=\"3\">HOVER</td><td rowspan=\"2\">FEVEROUS</td></tr><tr><td>2-hop</td><td>3-hop</td><td>4-hop</td></tr><tr><td>InstructGPT</td><td></td><td></td><td></td><td></td></tr><tr><td>- Direct</td><td>56.51</td><td>51.75</td><td>49.68</td><td>60.13</td></tr><tr><td>- ZS-CoT</td><td>50.30</td><td>52.30</td><td>51.58</td><td>54.78</td></tr><tr><td>- CoT</td><td>57.20</td><td>53.66</td><td>51.83</td><td>61.05</td></tr><tr><td>- Self-Ask</td><td>51.54</td><td>51.47</td><td>52.45</td><td>56.82</td></tr><tr><td>Codex</td><td>55.57</td><td>53.42</td><td>45.59</td><td>57.85</td></tr><tr><td>FLAN-T5</td><td>48.27</td><td>52.11</td><td>51.13</td><td>55.16</td></tr><tr><td>ProgramFC</td><td>54.27</td><td>54.18</td><td>52.88</td><td>59.66</td></tr></table>",
                "caption": "Table 3: Closed-book setting: macro-F1 scores for PROGRAMFC and for the baselines."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1257,
                    1810,
                    2193,
                    2431
                ],
                "angle": 0,
                "content": "We also include the 175B-parameter InstructGPT (text-davinci-002) (Ouyang et al., 2022) with four different prompts: (i) direct prompting with the claim, (ii) CoT (Wei et al., 2022) or chain-of-thought prompting with demonstrations, (iii) ZS-CoT (Kojima et al., 2022) or zero-shot chain-of-thought with the prompt \"let's think step by step\", and (iv) Self-Ask (Press et al., 2022), which is a variant of CoT that guides the model reasoning by asking a series of questions. The detailed prompting templates are given in Appendix E."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1257,
                    2434,
                    2193,
                    3223
                ],
                "angle": 0,
                "content": "Our results, presented in Table 3, show that most models achieve a Macro-F1 score only slightly above random guessing on the HOVER dataset, indicating the difficulty of solely relying on parametric knowledge of large language models for fact-checking complex claims. Similar to the observations in Section 4.1, we see a trend of improved performance as the number of the required reasoning hops increases. Chain-of-thought prompting scores an average 2.7 points higher than direct prompting, highlighting the importance of step-by-step reasoning for complex fact-checking. It outperforms our PROGRAMFC on HOVER 2-hop and FEVEROUS but performs worse on HOVER"
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6988"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    282,
                    298,
                    607,
                    350
                ],
                "angle": 0,
                "content": "3-hop and 4-hop."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    280,
                    354,
                    1210,
                    638
                ],
                "angle": 0,
                "content": "This can be due to CoT generating free-form explanations, which can lead to unpredictable errors in long reasoning chains. In contrast, our program generation-and-execution strategy is more stable for longer reasoning chains."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    282,
                    687,
                    997,
                    740
                ],
                "angle": 0,
                "content": "5 Conclusion and Future Work"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    280,
                    778,
                    1215,
                    1848
                ],
                "angle": 0,
                "content": "We proposed PROGRAMFC, a few-shot neurosymbolic model for fact-checking that learns to map input claims to a reasoning program consisting of a sequence of sub-task function calls for answering a question, for fact-checking a simple claim, and for computing a logical expression. Then fact-checking is performed by executing that program. PROGRAMFC combines the advantages of symbolic programs, such as explainability, with the flexibility of end-to-end neural models. Using Codex as the program generator, PROGRAMFC demonstrates promising performance on HOVER and FEVEROUS with only a small number of in-context demonstrations and no additional training. We also investigated the impact of model size and the benefits of programs for retrieval, and we analyzed the errors. The results indicated that PROGRAMFC effectively balances model capability, learning efficiency, and interpretability."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    280,
                    1855,
                    1215,
                    2136
                ],
                "angle": 0,
                "content": "In future work, we want to adapt PROGRAMFC to more real-world fact-checking scenarios, such as fake news detection and multi-modal fact-checking, with advanced reasoning program design and subtask functionalities."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    282,
                    2185,
                    545,
                    2234
                ],
                "angle": 0,
                "content": "Limitations"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    280,
                    2280,
                    1215,
                    2897
                ],
                "angle": 0,
                "content": "We identify two main limitations of PROGRAMFC. First, despite being complex in their surface form, the claims in the HOVER and FEVEROUS datasets mostly require only explicit multi-step reasoning, i.e., the decomposition can be derived from the claim's syntactic structure or how the claim is framed. This lowers the difficulty of generating reasoning programs. However, for many real-world complex claims, the reasoning is often implicit. For example, for the claim \"Aristotle couldn't have used a laptop\", the reasoning program is:"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    280,
                    2904,
                    1210,
                    3083
                ],
                "angle": 0,
                "content": "answer_1 = Question(\"When did Aristotle live?\");  \nanswer_2 = Question(\"When was the laptop invented?\");"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    280,
                    3097,
                    1195,
                    3223
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"answer_1 is before answer_2\");  \nlabel = Predict(fact_1)"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1260,
                    298,
                    2195,
                    855
                ],
                "angle": 0,
                "content": "Generating reasoning programs for such implicit complex claims requires a deeper understanding of the claim and also access to world and commonsense knowledge. We conducted preliminary experiments on these types of claims, but we found that our Codex-based generator struggled to produce a correct reasoning program. This highlights the gap in applying our PROGRAMFC to fact-check real-world claims. Addressing these challenges is an important direction for future work."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1260,
                    862,
                    2195,
                    1368
                ],
                "angle": 0,
                "content": "Second, PROGRAMFC incurs a higher computational cost than baseline end-to-end fact-checking models. It requires calling large language models for program generation and further calling multiple sub-task models. This results in the actual computational time that is \\(\\sim 4 - 5 \\times\\) higher than for an end-to-end FLAN-T5 model. Developing more efficient methods for program generation and execution is an important direction for future work."
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    1265,
                    1413,
                    1642,
                    1466
                ],
                "angle": 0,
                "content": "Ethics Statement"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1260,
                    1504,
                    2193,
                    1673
                ],
                "angle": 0,
                "content": "Biases. We note that there might be some biases in the data used to train the LLMs, as well as in factuality judgments. Both are beyond our control."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1260,
                    1704,
                    2193,
                    1985
                ],
                "angle": 0,
                "content": "Intended Use and Misuse Potential. Our models can be of interest to the general public and could also save a lot of time to human fact-checkers. However, they could also be misused by malicious actors. We ask researchers to exercise caution."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1260,
                    2020,
                    2193,
                    2473
                ],
                "angle": 0,
                "content": "Environmental Impact. The use of large language models requires a significant amount of energy for computation for training, which contributes to global warming. Our work performs few-shot in-context learning instead of training models from scratch, so the energy footprint of our work is less. The large language model (Codex) whose API we use for inference consumes significant energy."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1265,
                    2515,
                    1692,
                    2571
                ],
                "angle": 0,
                "content": "Acknowledgements"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1260,
                    2606,
                    2195,
                    3167
                ],
                "angle": 0,
                "content": "This work was supported in part by the National Science Foundation award #2048122 and by Singapore's Ministry of Education Tier 3 grant \"Digital Information Resilience: Restoring Trust and Nudging Behaviours in Digitalisation\". The views expressed are those of the authors and do not reflect the official policy or position of the US government. We thank Alex Mei, Xinyi Wang, Danqing Wang, Sharon Levy, Gyuwan Kim, and other members of the UCSB NLP group for their valuable feedback."
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6989"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    287,
                    298,
                    530,
                    347
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    290,
                    378,
                    1208,
                    606
                ],
                "angle": 0,
                "content": "Naser Ahmadi, Joohyung Lee, Paolo Papotti, and Mohammed Saeed. 2019. Explainable fact checking with probabilistic answer set programming. In Proceedings of the Truth and Trust Online Conference (TTO), London, UK."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    290,
                    648,
                    1208,
                    1013
                ],
                "angle": 0,
                "content": "Rami Aly, Zhijiang Guo, Michael Sejr Schlichtkrull, James Thorne, Andreas Vlachos, Christos Christodoulopoulos, Oana Cocarascu, and Arpit Mittal. 2021. FEVEROUS: Fact Extraction and VERIFICATION Over Unstructured and Structured information. In Proceedings of the Neural Information Processing Systems (NeurIPS) Track on Datasets and Benchmarks, Online."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    290,
                    1052,
                    1208,
                    1326
                ],
                "angle": 0,
                "content": "Rami Aly and Andreas Vlachos. 2022. Natural logic-guided autoregressive multi-hop document retrieval for fact verification. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 6123-6135, Abu Dhabi, United Arab Emirates."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    290,
                    1368,
                    1208,
                    1599
                ],
                "angle": 0,
                "content": "Pepa Atanasova, Jakob Grue Simonsen, Christina Lioma, and Isabelle Augenstein. 2020. Generating fact checking explanations. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics (ACL), pages 7352-7364, Online."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    290,
                    1638,
                    1208,
                    2094
                ],
                "angle": 0,
                "content": "Isabelle Augenstein, Christina Lioma, Dongsheng Wang, Lucas Chaves Lima, Casper Hansen, Christian Hansen, and Jakob Grue Simonsen. 2019. MultiFC: A real-world multi-domain dataset for evidence-based fact checking of claims. In Proceedings of the 2019 Conference on Empirical Methods in Natural Language Processing and the 9th International Joint Conference on Natural Language Processing (EMNLP-IJCNLP), pages 4685-4697, Hong Kong, China."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    290,
                    2136,
                    1208,
                    2504
                ],
                "angle": 0,
                "content": "Giorgio Barnabò, Federico Siciliano, Carlos Castillo, Stefano Leonardi, Preslav Nakov, Giovanni Da San Martino, and Fabrizio Silvestri. 2022. FbMultiLingMisinfo: Challenging large-scale multilingual benchmark for misinformation detection. In Proceedings of the 2022 International Joint Conference on Neural Networks (IJCNN), pages 1-8, Padova, Italy."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    290,
                    2543,
                    1208,
                    2816
                ],
                "angle": 0,
                "content": "Giorgio Barnabò, Federico Siciliano, Carlos Castillo, Stefano Leonardi, Preslav Nakov, Giovanni Da San Martino, and Fabrizio Silvestri. 2023. Deep active learning for misinformation detection using geometric deep learning. Online Social Networks and Media, 33:100244."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    290,
                    2855,
                    1208,
                    2995
                ],
                "angle": 0,
                "content": "Iz Beltagy, Matthew E. Peters, and Arman Cohan. 2020. Longformer: The long-document transformer. *ArXiv* preprint, abs/2004.05150."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    290,
                    3037,
                    1208,
                    3220
                ],
                "angle": 0,
                "content": "Samuel R. Bowman, Gabor Angeli, Christopher Potts, and Christopher D. Manning. 2015. A large annotated corpus for learning natural language inference. In Proceedings of the 2015 Conference on Empirical"
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    290,
                    378,
                    1208,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    1312,
                    301,
                    2188,
                    396
                ],
                "angle": 0,
                "content": "Methods in Natural Language Processing (EMNLP), pages 632-642, Lisbon, Portugal."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1270,
                    431,
                    2188,
                    1027
                ],
                "angle": 0,
                "content": "Tom B. Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, Sandhini Agarwal, Ariel Herbert-Voss, Gretchen Krueger, Tom Henighan, Rewon Child, Aditya Ramesh, Daniel M. Ziegler, Jeffrey Wu, Clemens Winter, Christopher Hesse, Mark Chen, Eric Sigler, Mateusz Litwin, Scott Gray, Benjamin Chess, Jack Clark, Christopher Berner, Sam McCandlish, Alec Radford, Ilya Sutskever, and Dario Amodei. 2020. Language models are few-shot learners. In Proceedings of the Annual Conference on Neural Information Processing Systems (NeurIPS), Online."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1062,
                    2188,
                    1336
                ],
                "angle": 0,
                "content": "Jifan Chen, Aniruddh Sriram, Eunsol Choi, and Greg Durrett. 2022a. Generating literal and implied subquestions to fact-check complex claims. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 3495-3516, Abu Dhabi, United Arab Emirates."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1371,
                    2188,
                    2332
                ],
                "angle": 0,
                "content": "Mark Chen, Jerry Tworek, Heewoo Jun, Qiming Yuan, Henrique Ponde de Oliveira Pinto, Jared Kaplan, Harrison Edwards, Yuri Burda, Nicholas Joseph, Greg Brockman, Alex Ray, Raul Puri, Gretchen Krueger, Michael Petrov, Heidy Khlaaf, Girish Sastry, Pamela Mishkin, Brooke Chan, Scott Gray, Nick Ryder, Mikhail Pavlov, Alethea Power, Lukasz Kaiser, Mohammad Bavarian, Clemens Winter, Philippe Tillet, Felipe Petroski Such, Dave Cummings, Matthias Plappert, Fotios Chantzis, Elizabeth Barnes, Ariel Herbert-Voss, William Hebgen Guss, Alex Nichol, Alex Paino, Nikolas Tezak, Jie Tang, Igor Babuschkin, Suchir Balaji, Shantanu Jain, William Saunders, Christopher Hesse, Andrew N. Carr, Jan Leike, Joshua Achiam, Vedant Misra, Evan Morikawa, Alec Radford, Matthew Knight, Miles Brundage, Mira Murati, Katie Mayer, Peter Welinder, Bob McGrew, Dario Amodei, Sam McCandlish, Ilya Sutskever, and Wojciech Zaremba. 2021. Evaluating large language models trained on code. ArXiv preprint, abs/2107.03374."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2367,
                    2188,
                    2595
                ],
                "angle": 0,
                "content": "Wenhu Chen, Xueguang Ma, Xinyi Wang, and William W. Cohen. 2022b. Program of thoughts prompting: Disentangling computation from reasoning for numerical reasoning tasks. CoRR, abs/2211.12588."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2634,
                    2188,
                    2904
                ],
                "angle": 0,
                "content": "Zhoujun Cheng, Tianbao Xie, Peng Shi, Chengzui Li, Rahul Nadkarni, Yushi Hu, Caiming Xiong, Dragomir Radev, Mari Ostendorf, Luke Zettlemoyer, Noah A. Smith, and Tao Yu. 2022. Binding language models in symbolic languages. CoRR, abs/2210.02875."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2946,
                    2188,
                    3220
                ],
                "angle": 0,
                "content": "Hyung Won Chung, Le Hou, Shayne Longpre, Barret Zoph, Yi Tay, William Fedus, Eric Li, Xuezhi Wang, Mostafa Dehghani, Siddhartha Brahma, Albert Webson, Shixiang Shane Gu, Zhuyun Dai, Mirac Suzgun, Xinyun Chen, Aakanksha Chowdhery, Sharan Narang, Gaurav Mishra, Adams Yu, Vincent Y. Zhao,"
            },
            {
                "block_id": 18,
                "type": "list",
                "bbox": [
                    1270,
                    301,
                    2188,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6990"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    334,
                    301,
                    1213,
                    533
                ],
                "angle": 0,
                "content": "Yanping Huang, Andrew M. Dai, Hongkun Yu, Slav Petrov, Ed H. Chi, Jeff Dean, Jacob Devlin, Adam Roberts, Denny Zhou, Quoc V. Le, and Jason Wei. 2022. Scaling instruction-finetuned language models. CoRR, abs/2210.11416."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    290,
                    568,
                    1208,
                    841
                ],
                "angle": 0,
                "content": "Limeng Cui, Kai Shu, Suhang Wang, Dongwon Lee, and Huan Liu. 2019. dEFEND: A system for explainable fake news detection. In Proceedings of the 28th ACM International Conference on Information and Knowledge Management (CIKM), pages 2961-2964, Beijing, China."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    290,
                    877,
                    1208,
                    1241
                ],
                "angle": 0,
                "content": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of deep bidirectional transformers for language understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL-HLT), pages 4171–4186, Minneapolis, Minnesota, USA."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    290,
                    1273,
                    1208,
                    1550
                ],
                "angle": 0,
                "content": "Mohamed H. Gad-Elrab, Daria Stepanova, Jacopo Urbani, and Gerhard Weikum. 2019. Exfakt: A framework for explaining facts over knowledge graphs and text. In Proceedings of the Twelfth ACM International Conference on Web Search and Data Mining (WSDM), pages 87–95, Melbourne, Australia."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    290,
                    1585,
                    1208,
                    1768
                ],
                "angle": 0,
                "content": "Luyu Gao, Aman Madaan, Shuyan Zhou, Uri Alon, Pengfei Liu, Yiming Yang, Jamie Callan, and Graham Neubig. 2022. PAL: program-aided language models. CoRR, abs/2211.10435."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    290,
                    1799,
                    1208,
                    2076
                ],
                "angle": 0,
                "content": "Max Glockner, Yufang Hou, and Iryna Gurevych. 2022. Missing counter-evidence renders NLP fact-checking unrealistic for misinformation. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 5916-5936, Abu Dhabi, United Arab Emirates."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    290,
                    2111,
                    1208,
                    2294
                ],
                "angle": 0,
                "content": "Zhijiang Guo, Michael Schlichtkrull, and Andreas Vlachos. 2022. A survey on automated fact-checking. Transactions of the Association for Computational Linguistics, 10:178-206."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    290,
                    2325,
                    1208,
                    2606
                ],
                "angle": 0,
                "content": "Ashim Gupta and Vivek Srikumar. 2021. X-Fact: A new benchmark dataset for multilingual fact checking. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP), pages 675-682, Online."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    290,
                    2638,
                    1208,
                    2866
                ],
                "angle": 0,
                "content": "Pengcheng He, Jianfeng Gao, and Weizhu Chen. 2021. DeBERTaV3: Improving DeBERTa using ELECTRA-style pre-training with gradient-disentangled embedding sharing. ArXiv preprint, abs/2111.09543."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    290,
                    2897,
                    1208,
                    3220
                ],
                "angle": 0,
                "content": "Kelvin Jiang, Ronak Pradeep, and Jimmy Lin. 2021. Exploring listwise evidence reasoning with T5 for fact verification. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP), pages 402-410, Online."
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    290,
                    301,
                    1213,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    1272,
                    301,
                    2185,
                    575
                ],
                "angle": 0,
                "content": "Yichen Jiang, Shikha Bordia, Zheng Zhong, Charles Dognin, Maneesh Singh, and Mohit Bansal. 2020. HoVer: A dataset for many-hop fact extraction and claim verification. In *Findings of the Association for Computational Linguistics: EMNLP* 2020, pages 3441-3460, Online."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1270,
                    613,
                    2190,
                    796
                ],
                "angle": 0,
                "content": "Shailza Jolly, Pepa Atanasova, and Isabelle Augenstein. 2022. Generating fluent fact checking explanations with unsupervised post-editing. Information, 13(10):500."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1270,
                    831,
                    2190,
                    1013
                ],
                "angle": 0,
                "content": "Takeshi Kojima, Shixiang Shane Gu, Machel Reid, Yutaka Matsuo, and Yusuke Iwasawa. 2022. Large language models are zero-shot reasoners. CoRR, abs/2205.11916."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1052,
                    2190,
                    1280
                ],
                "angle": 0,
                "content": "Neema Kotonya and Francesca Toni. 2020. Explainable automated fact-checking for public health claims. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 7740-7754, Online."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1315,
                    2190,
                    1501
                ],
                "angle": 0,
                "content": "Amrith Krishna, Sebastian Riedel, and Andreas Vlachos. 2022. Proof: Natural logic theorem proving for fact verification. Transactions of the Association for Computational Linguistics (TACL), 10:1013-1030."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1532,
                    2190,
                    1810
                ],
                "angle": 0,
                "content": "Nayeon Lee, Yejin Bang, Andrea Madotto, and Pascale Fung. 2021. Towards few-shot fact-checking via perplexity. In Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL-HLT), pages 1971-1981, Online."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1845,
                    2185,
                    2073
                ],
                "angle": 0,
                "content": "Nayeon Lee, Belinda Z. Li, Sinong Wang, Wen-tau Yih, Hao Ma, and Madian Khabsa. 2020. Language models as fact checkers? In Proceedings of the Third Workshop on Fact Extraction and VERIFICATION (FEVER), pages 36-41, Online."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2108,
                    2190,
                    2469
                ],
                "angle": 0,
                "content": "Jimmy Lin, Xueguang Ma, Sheng-Chieh Lin, Jheng-Hong Yang, Ronak Pradeep, and Rodrigo Nogueira. 2021. Pyserini: A Python toolkit for reproducible information retrieval research with sparse and dense representations. In Proceedings of the 44th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR), pages 2356-2362, Online."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2508,
                    2190,
                    2781
                ],
                "angle": 0,
                "content": "Alisa Liu, Swabha Swayamdipta, Noah A. Smith, and Yejin Choi. 2022. WANLI: Worker and AI collaboration for natural language inference dataset creation. In *Findings of the Association for Computational Linguistics: EMNLP* 2022, pages 6826-6847, Abu Dhabi, United Arab Emirates."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2820,
                    2190,
                    3051
                ],
                "angle": 0,
                "content": "Yinhan Liu, Myle Ott, Naman Goyal, Jingfei Du, Mandar Joshi, Danqi Chen, Omer Levy, Mike Lewis, Luke Zettlemoyer, and Veselin Stoyanov. 2019. RoBERTa: A robustly optimized BERT pretraining approach. ArXiv preprint, abs/1907.11692."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1270,
                    3083,
                    2185,
                    3220
                ],
                "angle": 0,
                "content": "Zhenghao Liu, Chenyan Xiong, Maosong Sun, and Zhiyuan Liu. 2020. Fine-grained fact verification with kernel graph attention network. In Proceedings"
            },
            {
                "block_id": 22,
                "type": "list",
                "bbox": [
                    1270,
                    301,
                    2190,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 23,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1287,
                    3301
                ],
                "angle": 0,
                "content": "6991"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    334,
                    301,
                    1213,
                    442
                ],
                "angle": 0,
                "content": "of the 58th Annual Meeting of the Association for Computational Linguistics (ACL), pages 7342-7351, Online."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    484,
                    1208,
                    715
                ],
                "angle": 0,
                "content": "Yi-Ju Lu and Cheng-Te Li. 2020. GCAN: Graph-aware co-attention networks for explainable fake news detection on social media. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics (ACL), pages 505-514, Online."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    290,
                    757,
                    1208,
                    1034
                ],
                "angle": 0,
                "content": "Grégoire Mialon, Roberto Dessì, Maria Lomeli, Christoforos Nalmpantis, Ramakanth Pasunuru, Roberta Raileanu, Baptiste Rozière, Timo Schick, Jane Dwivedi-Yu, Asli Celikyilmaz, Edouard Grave, Yann LeCun, and Thomas Scialom. 2023. Augmented language models: a survey. CoRR, abs/2302.07842."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    290,
                    1076,
                    1208,
                    1627
                ],
                "angle": 0,
                "content": "Preslav Nakov, Alberto Barrón-Cedeno, Giovanni Da San Martino, Firoj Alam, Julia Maria Struß, Thomas Mandl, Rubén Miguez, Tommaso Caselli, Mucahid Kutlu, Wajdi Zaghouani, Chengkai Li, Shaden Shaar, Gautam Kishore Shahi, Hamdy Mubarak, Alex Nikolov, Nikolay Babulkov, Yavuz Selim Kartal, and Javier Beltrán. 2022. The CLEF-2022 CheckThat! lab on fighting the COVID-19 infodemic and fake news detection. In Proceedings of the 44th European Conference on IR Research: Advances in Information Retrieval (ECIR), pages 416–428, Berlin, Heidelberg."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    290,
                    1669,
                    1208,
                    1989
                ],
                "angle": 0,
                "content": "Preslav Nakov, David Corney, Maram Hasanain, Firoj Alam, Tamer Elsayed, Alberto Barrón-Cedeno, Paolo Papotti, Shaden Shaar, and Giovanni Da San Martino. 2021a. Automated fact-checking for assisting human fact-checkers. In Proceedings of the Joint Conference on Artificial Intelligence (IJCAI), pages 4551-4558, Online."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    290,
                    2034,
                    1208,
                    2494
                ],
                "angle": 0,
                "content": "Preslav Nakov, Giovanni Da San Martino, Tamer Elsayed, Alberto Barrón-Cedeno, Rubén Miguez, Shaden Shaar, Firoj Alam, Fatima Haouari, Maram Hasanain, Nikolay Babulkov, Alex Nikolov, Gautam Kishore Shahi, Julia Maria Struß, and Thomas Mandl. 2021b. The CLEF-2021 CheckThat! lab on detecting check-worthy claims, previously fact-checked claims, and fake news. In Proceedings of the 43rd European Conference on Information Retrieval (ECIR), pages 639–649, Lucca, Italy."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    290,
                    2536,
                    1208,
                    2809
                ],
                "angle": 0,
                "content": "Van-Hoang Nguyen, Kazunari Sugiyama, Preslav Nakov, and Min-Yen Kan. 2020. FANG: leveraging social context for fake news detection using graph representation. In Proceedings of the 29th ACM International Conference on Information and Knowledge Management (CIKM), pages 1165-1174."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    2855,
                    1208,
                    3087
                ],
                "angle": 0,
                "content": "Yixin Nie, Haonan Chen, and Mohit Bansal. 2019. Combining fact extraction and verification with neural semantic matching networks. In Proceedings of the 33rd AAAI Conference on Artificial Intelligence (AAAI), pages 6859-6866, Honolulu, Hawaii, USA."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    290,
                    3129,
                    1208,
                    3220
                ],
                "angle": 0,
                "content": "Yixin Nie, Adina Williams, Emily Dinan, Mohit Bansal, Jason Weston, and Douwe Kiela. 2020. Adversarial"
            },
            {
                "block_id": 9,
                "type": "list",
                "bbox": [
                    290,
                    301,
                    1213,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    1312,
                    301,
                    2188,
                    487
                ],
                "angle": 0,
                "content": "NLI: A new benchmark for natural language understanding. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics (ACL), pages 4885-4901, Online."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    1270,
                    522,
                    2188,
                    887
                ],
                "angle": 0,
                "content": "Long Ouyang, Jeff Wu, Xu Jiang, Diogo Almeida, Carroll L. Wainwright, Pamela Mishkin, Chong Zhang, Sandhini Agarwal, Katarina Slama, Alex Ray, John Schulman, Jacob Hilton, Fraser Kelton, Luke Miller, Maddie Simens, Amanda Askell, Peter Welinder, Paul F. Christiano, Jan Leike, and Ryan Lowe. 2022. Training language models to follow instructions with human feedback. CoRR, abs/2203.02155."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1270,
                    929,
                    2188,
                    1252
                ],
                "angle": 0,
                "content": "Liangming Pan, Wenhu Chen, Wenhan Xiong, MinYen Kan, and William Yang Wang. 2021. Zero-shot fact verification by claim generation. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP), pages 476-483, Online."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1290,
                    2188,
                    1659
                ],
                "angle": 0,
                "content": "Alicia Parrish, William Huang, Omar Agha, Soo-Hwan Lee, Nikita Nangia, Alexia Warstadt, Karmanya Aggarwal, Emily Allaway, Tal Linzen, and Samuel R. Bowman. 2021. Does putting a linguist in the loop improve NLU data collection? In Findings of the Association for Computational Linguistics: EMNLP 2021, pages 4886-4901, Punta Cana, Dominican Republic."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1694,
                    2188,
                    1971
                ],
                "angle": 0,
                "content": "Kashyap Popat, Subhabrata Mukherjee, Jannik Strögtgen, and Gerhard Weikum. 2017. Where the truth lies: Explaining the credibility of emerging claims on the web and social media. In Proceedings of the International World Wide Web Conference (WWW), pages 1003-1012."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2010,
                    2188,
                    2192
                ],
                "angle": 0,
                "content": "Ofir Press, Muru Zhang, Sewon Min, Ludwig Schmidt, Noah A. Smith, and Mike Lewis. 2022. Measuring and narrowing the compositionality gap in language models. CoRR, abs/2210.03350."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2231,
                    2188,
                    2462
                ],
                "angle": 0,
                "content": "Colin Raffel, Noam Shazeer, Adam Roberts, Katherine Lee, Sharan Narang, Michael Matena, Yanqi Zhou, Wei Li, and Peter J. Liu. 2020. Exploring the limits of transfer learning with a unified text-to-text transformer. *J. Mach. Learn. Res.*, 21:140:1-140:67."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2501,
                    2188,
                    2683
                ],
                "angle": 0,
                "content": "Stephen E. Robertson and Hugo Zaragoza. 2009. The probabilistic relevance framework: BM25 and beyond. Foundations and Trends in Information Retrieval, 3(4):333-389."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2722,
                    2188,
                    3087
                ],
                "angle": 0,
                "content": "Arkadiy Saakyan, Tuhin Chakrabarty, and Smaranda Muresan. 2021. COVID-fact: Fact extraction and verification of real-world claims on COVID-19 pandemic. In Proceedings of the 59th Annual Meeting of the Association for Computational Linguistics and the 11th International Joint Conference on Natural Language Processing (ACL-IJCNLP), pages 2116-2129, Online."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1270,
                    3129,
                    2188,
                    3220
                ],
                "angle": 0,
                "content": "Aalog Sathe, Salar Ather, Tuan Manh Le, Nathan Perry, and Joonsuk Park. 2020. Automated fact-checking"
            },
            {
                "block_id": 20,
                "type": "list",
                "bbox": [
                    1270,
                    301,
                    2188,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 21,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6992"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    334,
                    301,
                    1213,
                    442
                ],
                "angle": 0,
                "content": "of claims from Wikipedia. In Proceedings of the Twelfth Language Resources and Evaluation Conference (LREC), pages 6874-6882, Marseille, France."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    290,
                    470,
                    1210,
                    698
                ],
                "angle": 0,
                "content": "Timo Schick, Jane Dwivedi-Yu, Roberto Dessì, Roberta Raileanu, Maria Lomeli, Luke Zettlemoyer, Nicola Cancedda, and Thomas Scialom. 2023. Toolformer: Language models can teach themselves to use tools. CoRR, abs/2302.04761."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    290,
                    726,
                    1210,
                    1045
                ],
                "angle": 0,
                "content": "Tal Schuster, Adam Fisch, and Regina Barzilay. 2021. Get your vitamin C! robust fact verification with contrastive evidence. In Proceedings of the 2021 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL-HLT), pages 624-643, Online."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    290,
                    1076,
                    1210,
                    1259
                ],
                "angle": 0,
                "content": "Amir Soleimani, Christof Monz, and Marcel Worring. 2020. BERT for evidence retrieval and claim verification. In Advances in Information Retrieval (ECIR), volume 12036, pages 359-366."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    290,
                    1290,
                    1210,
                    1518
                ],
                "angle": 0,
                "content": "James Thorne and Andreas Vlachos. 2018. Automated fact checking: Task formulations, methods and future directions. In Proceedings of the 27th International Conference on Computational Linguistics (COLING), pages 3346-3359, Santa Fe, New Mexico, USA."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    290,
                    1550,
                    1210,
                    1911
                ],
                "angle": 0,
                "content": "James Thorne, Andreas Vlachos, Christos Christodoulopoulos, and Arpit Mittal. 2018. FEVER: a large-scale dataset for fact extraction and VERIFICATION. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL-HLT), pages 809-819, New Orleans, Louisiana."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    290,
                    1943,
                    1210,
                    2266
                ],
                "angle": 0,
                "content": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention is all you need. In Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems (NeurIPS), pages 5998-6008, Long Beach, California, USA."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    290,
                    2290,
                    1210,
                    2567
                ],
                "angle": 0,
                "content": "David Wadden, Shanchuan Lin, Kyle Lo, Lucy Lu Wang, Madeleine van Zuylen, Arman Cohan, and Hannaneh Hajishirzi. 2020. Fact or fiction: Verifying scientific claims. In Proceedings of the 2020 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 7534-7550, Online."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    290,
                    2595,
                    1210,
                    2869
                ],
                "angle": 0,
                "content": "David Wadden, Kyle Lo, Bailey Kuehl, Arman Cohan, Iz Beltagy, Lucy Lu Wang, and Hannaneh Hajishirzi. 2022a. SciFact-open: Towards open-domain scientific claim verification. In Findings of the Association for Computational Linguistics: EMNLP 2022, pages 4719-4734, Abu Dhabi, United Arab Emirates."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    290,
                    2897,
                    1210,
                    3216
                ],
                "angle": 0,
                "content": "David Wadden, Kyle Lo, Lucy Wang, Arman Cohan, Iz Beltagy, and Hannaneh Hajishirzi. 2022b. MultiVerS: Improving scientific claim verification with weak supervision and full-document context. In *Findings of the Association for Computational Linguistics: NAACL* 2022, pages 61-76, Seattle, Washington, USA."
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    290,
                    301,
                    1213,
                    3216
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    1270,
                    301,
                    2188,
                    529
                ],
                "angle": 0,
                "content": "William Yang Wang. 2017. \"Liar, liar pants on fire\": A new benchmark dataset for fake news detection. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (ACL), pages 422-426, Vancouver, Canada."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1270,
                    568,
                    2188,
                    750
                ],
                "angle": 0,
                "content": "Xuezhi Wang, Jason Wei, Dale Schuurmans, Quoc V. Le, Ed H. Chi, and Denny Zhou. 2022. Self-consistency improves chain of thought reasoning in language models. CoRR, abs/2203.11171."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1270,
                    789,
                    2188,
                    971
                ],
                "angle": 0,
                "content": "Jason Wei, Xuezhi Wang, Dale Schuurmans, Maarten Bosma, Ed H. Chi, Quoc Le, and Denny Zhou. 2022. Chain of thought prompting elicits reasoning in large language models. ArXiv preprint, abs/2201.11903."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1006,
                    2188,
                    1371
                ],
                "angle": 0,
                "content": "Adina Williams, Nikita Nangia, and Samuel Bowman. 2018. A broad-coverage challenge corpus for sentence understanding through inference. In Proceedings of the 2018 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies (NAACL-HLT), pages 1112–1122, New Orleans, Louisiana, USA."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1410,
                    2188,
                    1687
                ],
                "angle": 0,
                "content": "Dustin Wright, David Wadden, Kyle Lo, Bailey Kuehl, Arman Cohan, Isabelle Augenstein, and Lucy Wang. 2022. Generating scientific claims for zero-shot scientific fact checking. In Proceedings of the 60th Annual Meeting of the Association for Computational Linguistics (ACL), pages 2448-2460, Dublin, Ireland."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1722,
                    2188,
                    2038
                ],
                "angle": 0,
                "content": "Fan Yang, Shiva K. Pentyala, Sina Mohseni, Mengnan Du, Hao Yuan, Rhema Linder, Eric D. Ragan, Shuiwang Ji, and Xia (Ben) Hu. 2019. XFake: Explainable fake news detector with visualizations. In Proceedings of the The World Wide Web Conference (WWW), pages 3600-3604, San Francisco, California, USA."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2080,
                    2188,
                    2402
                ],
                "angle": 0,
                "content": "Zhilin Yang, Peng Qi, Saizheng Zhang, Yoshua Bengio, William Cohen, Ruslan Salakhutdinov, and Christopher D. Manning. 2018. HotpotQA: A dataset for diverse, explainable multi-hop question answering. In Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing (EMNLP), pages 2369-2380, Brussels, Belgium."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2434,
                    2188,
                    2711
                ],
                "angle": 0,
                "content": "Wanjun Zhong, Jingjing Xu, Duyu Tang, Zenan Xu, Nan Duan, Ming Zhou, Jiahai Wang, and Jian Yin. 2020. Reasoning over semantic-level graph for fact checking. In Proceedings of the 58th Annual Meeting of the Association for Computational Linguistics (ACL), pages 6170-6180, Online."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2746,
                    2188,
                    3069
                ],
                "angle": 0,
                "content": "Jie Zhou, Xu Han, Cheng Yang, Zhiyuan Liu, Lifeng Wang, Changcheng Li, and Maosong Sun. 2019. GEAR: Graph-based evidence aggregating and reasoning for fact verification. In Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics (ACL), pages 892-901, Florence, Italy."
            },
            {
                "block_id": 20,
                "type": "list",
                "bbox": [
                    1270,
                    301,
                    2188,
                    3069
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 21,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6993"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    285,
                    298,
                    1099,
                    406
                ],
                "angle": 0,
                "content": "A Implementation Details about the Baselines"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    280,
                    438,
                    1215,
                    778
                ],
                "angle": 0,
                "content": "In this section, we give the implementation details for the seven baselines we used in our work. Typical ways to perform few-shot fact-checking using large language models are fine-tuning and in-context learning. Thus, we categorize the baselines into three categories."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    285,
                    813,
                    788,
                    862
                ],
                "angle": 0,
                "content": "A.1 Pre-trained Models"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    280,
                    884,
                    1215,
                    1385
                ],
                "angle": 0,
                "content": "Pre-trained models use pretrained Transformers (Vaswani et al., 2017) such as BERT (Devlin et al., 2019) and T5 (Raffel et al., 2020) for fact-checking. For few-shot learning, we fine-tune them using 20 randomly sampled training examples from HOVER or FEVEROUS. We ran the training 10 times with different random seeds and report the average performance on the validation set. We chose two models:"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    337,
                    1413,
                    1215,
                    1866
                ],
                "angle": 0,
                "content": "- BERT-FC (Soleimani et al., 2020): It uses BERT for claim verification. The claim and the evidence are concatenated ([CLS] claim [SEP] evidence) and used as input for a binary classification task to predict the veracity label of the claim. We use the bert-large-uncased (345M parameters) model provided in HuggingFace."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    337,
                    1897,
                    1215,
                    2511
                ],
                "angle": 0,
                "content": "- List5 (Jiang et al., 2021): This is a fact-checking framework built with a pretrained sequence-to-sequence transformer, namely T5 (Raffel et al., 2020), as its backbone. We adopt the “listwise concatenation” proposed in the paper for label prediction, which concatenates all candidate evidence sentences into a single input and we train the t5-large model to directly classify the claim as Supported or Refuted. We use the original implementation of this model.<sup>3</sup>"
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    337,
                    1413,
                    1215,
                    2511
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    285,
                    2543,
                    950,
                    2592
                ],
                "angle": 0,
                "content": "A.2 FC/NLI Fine-Tuned Models"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    280,
                    2613,
                    1215,
                    3065
                ],
                "angle": 0,
                "content": "These models are pretrained Transformer models that have been specifically fine-tuned on single-hop fact-checking datasets (e.g., FEVER) or natural language inference (NLI) datasets. This additional training allows these models to excel at fact-checking simple claims, and thus they can generalize better to complex claims that require multi-hop reasoning during further few-shot fine-tuning."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    337,
                    3087,
                    796,
                    3129
                ],
                "angle": 0,
                "content": "\\(^{2}\\)https://huggingface.co/"
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    337,
                    3132,
                    1166,
                    3178
                ],
                "angle": 0,
                "content": "<sup>3</sup>https://github.com/castorini/pygaggle/tree/"
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    290,
                    3181,
                    744,
                    3220
                ],
                "angle": 0,
                "content": "master/experiments/list5"
            },
            {
                "block_id": 12,
                "type": "list",
                "bbox": [
                    290,
                    3087,
                    1166,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    298,
                    2185,
                    406
                ],
                "angle": 0,
                "content": "In this category, we selected the following three fine-tuned models:"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1319,
                    445,
                    2195,
                    1006
                ],
                "angle": 0,
                "content": "- RoBERTa-NLI (Nie et al., 2020) fine-tunes RoBERTa-large (Liu et al., 2019) on a combination of four well-known NLI datasets: SNLI (Bowman et al., 2015), MNLI (Williams et al., 2018), FEVER-NLI (Nie et al., 2019), ANLI (R1, R2, R3) (Nie et al., 2020). We used the public model checkpoint available at HuggingFace and we further fine-tuned it with 20 random examples from HOVER/FEVEROUS."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1319,
                    1045,
                    2195,
                    1494
                ],
                "angle": 0,
                "content": "- DeBERTaV3-NLI (He et al., 2021) fine-tunes the DeBERTaV3-large model on 885,242 NLI hypothesis-premise pairs from FEVER and on four NLI datasets: MNLI, ANLI, LingNLI (Parrish et al., 2021), and WANLI (Liu et al., 2022). This is the best-performing NLI model on HuggingFace as of 06/06/2022."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1319,
                    1532,
                    2193,
                    1866
                ],
                "angle": 0,
                "content": "- MULTIVERS (Wadden et al., 2022b), formerly known as LongChecker, uses the LongFormer (Beltagy et al., 2020) for claim verification to address the long input evidence problem. We use a model checkpoint fine-tuned on FEVER.<sup>6</sup>"
            },
            {
                "block_id": 17,
                "type": "list",
                "bbox": [
                    1319,
                    445,
                    2195,
                    1866
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 18,
                "type": "title",
                "bbox": [
                    1262,
                    1908,
                    1947,
                    1960
                ],
                "angle": 0,
                "content": "A.3 In-Context Learning Models"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1257,
                    1982,
                    2193,
                    2371
                ],
                "angle": 0,
                "content": "These models have recently shown strong few-shot learning ability in various NLP tasks. By prompting a large language model with a few in-context examples, the model can quickly learn a task from demonstrations. To make a fair comparison to our model, we choose two in-context learning baselines as follows."
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    1319,
                    2409,
                    2195,
                    2974
                ],
                "angle": 0,
                "content": "- Codex (Chen et al., 2021) is used in our model to generate reasoning programs. One straightforward baseline directly uses it for fact-checking. To this end, we prompt Codex (code-davinci-002) as follows: “<Evidence> Based on the above information, is it true that <Claim>? True or False? The answer is:”. We prefix the same 20 in-context examples for our model before the prompt as demonstrations."
            },
            {
                "block_id": 21,
                "type": "page_footnote",
                "bbox": [
                    1262,
                    2999,
                    2160,
                    3083
                ],
                "angle": 0,
                "content": "4https://huggingface.co/ynie/ roberta-large-snli_mnli_fever_anli_R1_R2_R3-nli"
            },
            {
                "block_id": 22,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3087,
                    2093,
                    3171
                ],
                "angle": 0,
                "content": "<sup>5</sup>https://huggingface.co/MoritzLaurer/DeBERTa-v3-large-mnli-fever-anli-ling-wanli"
            },
            {
                "block_id": 23,
                "type": "page_footnote",
                "bbox": [
                    1324,
                    3174,
                    2017,
                    3220
                ],
                "angle": 0,
                "content": "\\(^{6}\\)https://github.com/dwadden/multivers"
            },
            {
                "block_id": 24,
                "type": "list",
                "bbox": [
                    1262,
                    2999,
                    2160,
                    3220
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 25,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6994"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    339,
                    298,
                    1215,
                    1087
                ],
                "angle": 0,
                "content": "- FLAN-T5 (Chung et al., 2022) is an improved version of T5, which is fine-tuned on 1.8K tasks phrased as instructions, with and without exemplars, i.e., zero-shot and few-shot. The model has shown strong performance in various in-context few-shot learning NLP tasks, such as reasoning, and question-answering. We prompt the model with the same format as we used in Section 3.4: “<Evidence> Q: <Claim> Is it true that <Claim?> True or False? The answer is:”, prefixing with the same 20 in-context examples. We also use the same model size (FLAN-T5-XXL 3B) with our model for fair comparison."
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    285,
                    1133,
                    1116,
                    1248
                ],
                "angle": 0,
                "content": "B Examples of Generated Reasoning Programs"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    282,
                    1283,
                    1215,
                    1452
                ],
                "angle": 0,
                "content": "Figure 7 shows six examples of generated reasoning programs by PROGRAMFC that cover diverse reasoning chains."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    285,
                    1494,
                    1009,
                    1613
                ],
                "angle": 0,
                "content": "C Error Analysis for Reasoning Programs"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    282,
                    1645,
                    1213,
                    1866
                ],
                "angle": 0,
                "content": "Figure 8 shows five examples of erroneous cases where the generated reasoning programs are incorrect. We provide explanations for each of the error cases below:"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    282,
                    1904,
                    1213,
                    2129
                ],
                "angle": 0,
                "content": "Example 1 It generates a wrong logical reasoning operator for the final step. The correct logic should be “not (fact_1 and fact_2)” instead of “fact_1 and fact_2”."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    282,
                    2164,
                    1213,
                    2504
                ],
                "angle": 0,
                "content": "Example 2 It fails to perform co-reference resolution for the arguments in the third and the fourth reasoning steps. “This album” should be replaced with “The bluegrass” to make the sub-task context-independent. “This musical” should be replaced with the variable “answer_1” from the first step."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    282,
                    2536,
                    1213,
                    2708
                ],
                "angle": 0,
                "content": "Example 3 It fails to create a meaningful problem decomposition for the claim. It generates a trivial program that simply repeats the original claim."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    282,
                    2739,
                    1213,
                    2964
                ],
                "angle": 0,
                "content": "Example 4 It fails to generate a fine-grained reasoning structure for the input claim. It also generates a trivial program that simply separates the claim into sentences."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    282,
                    2999,
                    1213,
                    3223
                ],
                "angle": 0,
                "content": "Example 5 It generates a redundant reasoning step “Question(“When was the musician born?”)”, which does not add any new information to the reasoning chain."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1262,
                    294,
                    2004,
                    357
                ],
                "angle": 0,
                "content": "D Program Generation Prompts"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1260,
                    382,
                    2188,
                    554
                ],
                "angle": 0,
                "content": "Our manually written prompts for the HOVER and the FEVERIOUS-S datasets are given in Listings 1 and 2, respectively."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1262,
                    592,
                    1902,
                    712
                ],
                "angle": 0,
                "content": "E Prompts for Closed-Book Fact-Checking"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1260,
                    743,
                    2195,
                    912
                ],
                "angle": 0,
                "content": "Below we show the templates for the four prompting methods used for InstructGPT for the closed-book fact-checking setting in Section 4.4."
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    1309,
                    926,
                    1667,
                    978
                ],
                "angle": 0,
                "content": "Direct Prompting"
            },
            {
                "block_id": 15,
                "type": "code",
                "bbox": [
                    1267,
                    999,
                    2198,
                    1350
                ],
                "angle": 0,
                "content": "Answer the following true/false questions:   \nIs it true that The woman the story behind Girl Crazy is credited to is older than Ted Kotcheff?   \nThe answer is: False.   \n... more in-context examples here ...   \nIs it true that <input_claim?>   \nThe answer is:"
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1309,
                    1382,
                    1701,
                    1434
                ],
                "angle": 0,
                "content": "ZS-CoT Prompting"
            },
            {
                "block_id": 17,
                "type": "code",
                "bbox": [
                    1267,
                    1459,
                    2024,
                    1599
                ],
                "angle": 0,
                "content": "Answer the following true/false question: Is it true that <input_claim?> True or False? Let us think step-by-step. The answer is:"
            },
            {
                "block_id": 18,
                "type": "title",
                "bbox": [
                    1312,
                    1638,
                    1630,
                    1694
                ],
                "angle": 0,
                "content": "CoT Prompting"
            },
            {
                "block_id": 19,
                "type": "code",
                "bbox": [
                    1267,
                    1711,
                    2198,
                    2196
                ],
                "angle": 0,
                "content": "# Answer the following true/false questions:  \nIs it true that The woman the story behind Girl Crazy is credited to is older than Ted Kotcheff? Let's think step by step.  \nGirl Crazy's story is credited to Hampton Del Ruth. Hampton Del Ruth was born on September 7, 1879. Ted Kotcheff was born on April 7, 1931. Therefore, the answer is: False.  \n(… more in-context examples here ...)  \nIs it true that <input_claim?> Let's think step by step."
            },
            {
                "block_id": 20,
                "type": "title",
                "bbox": [
                    1309,
                    2227,
                    1711,
                    2283
                ],
                "angle": 0,
                "content": "Self-Ask Prompting"
            },
            {
                "block_id": 21,
                "type": "code",
                "bbox": [
                    1267,
                    2304,
                    2198,
                    2753
                ],
                "angle": 0,
                "content": "Answer the following true/false questions:   \nIs it true that The woman the story behind Girl Crazy is credited to is older than Ted Kotcheff?   \nQ: The story behind Girl Crazy is credited to whom?   \nA: Hampton Del Ruth   \nQ: Is Hampton Del Ruth older than Ted Kotcheff?   \nA: No   \nSo the final answer is: False.   \n(.. more in-context examples here ..)   \nIs it true that <input_claim?>"
            },
            {
                "block_id": 22,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1290,
                    3301
                ],
                "angle": 0,
                "content": "6995"
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    364,
                    547,
                    476,
                    578
                ],
                "angle": 0,
                "content": "Claim:"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    364,
                    582,
                    1349,
                    624
                ],
                "angle": 0,
                "content": "Tritonia and Phyteuma are both names for a plant genus."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    364,
                    663,
                    689,
                    701
                ],
                "angle": 0,
                "content": "Predicted Program:"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    701,
                    1369,
                    740
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"Tritonia is a name for a plant genus.\")"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    364,
                    740,
                    1369,
                    775
                ],
                "angle": 0,
                "content": "fact_2 = Verify(\"Phyteuma is a name for a plant genus.\")"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    775,
                    979,
                    810
                ],
                "angle": 0,
                "content": "label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    364,
                    845,
                    476,
                    877
                ],
                "angle": 0,
                "content": "Claim:"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    362,
                    877,
                    2101,
                    954
                ],
                "angle": 0,
                "content": "The country that Fujairah College is located in had a 2013 population of 9.2 million until it was hit by the plague in 1483 when the population was halved."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    364,
                    996,
                    689,
                    1034
                ],
                "angle": 0,
                "content": "Predicted Program:"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    364,
                    1031,
                    1582,
                    1069
                ],
                "angle": 0,
                "content": "answer_1 = Question(\"Which country is Fujairah College located in?\")"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    364,
                    1069,
                    1565,
                    1105
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"answer_1\" had a 2013 population of 9.2 million.\")"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    364,
                    1105,
                    1441,
                    1140
                ],
                "angle": 0,
                "content": "fact_2 = Verify(\"answer_1\" was hit by the plague in 1483.\")"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    364,
                    1140,
                    1563,
                    1175
                ],
                "angle": 0,
                "content": "fact_3 = Verify(\"The population of {answer_1} was halved in 1483.\")"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    364,
                    1175,
                    1173,
                    1213
                ],
                "angle": 0,
                "content": "label = Predict(fact_1 and fact_2 and fact_3)"
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    364,
                    1248,
                    476,
                    1283
                ],
                "angle": 0,
                "content": "Claim:"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    362,
                    1283,
                    2061,
                    1329
                ],
                "angle": 0,
                "content": "The first female board member for the Liberal Party, she was born in Vestfold county in Norway."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    364,
                    1364,
                    689,
                    1403
                ],
                "angle": 0,
                "content": "Predicted Program:"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    364,
                    1403,
                    1848,
                    1441
                ],
                "angle": 0,
                "content": "answer_1 = Question(\"Who was the first female board member for the Liberal Party?\")"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    364,
                    1441,
                    1582,
                    1476
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"answer_1\" was born in Vestfold county in Norway.\")"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    364,
                    1476,
                    783,
                    1511
                ],
                "angle": 0,
                "content": "label = Predict(fact_1)"
            },
            {
                "block_id": 20,
                "type": "title",
                "bbox": [
                    364,
                    1561,
                    476,
                    1596
                ],
                "angle": 0,
                "content": "Claim:"
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    364,
                    1596,
                    1994,
                    1634
                ],
                "angle": 0,
                "content": "The solicitor who won the show Back to Reality ahead of Maureen Rees and Craig Phillips is"
            },
            {
                "block_id": 22,
                "type": "text",
                "bbox": [
                    364,
                    1634,
                    1687,
                    1673
                ],
                "angle": 0,
                "content": "English. The solicitor that was a chair of Global Witness is also English."
            },
            {
                "block_id": 23,
                "type": "title",
                "bbox": [
                    364,
                    1711,
                    689,
                    1750
                ],
                "angle": 0,
                "content": "Predicted Program:"
            },
            {
                "block_id": 24,
                "type": "text",
                "bbox": [
                    364,
                    1750,
                    2101,
                    1789
                ],
                "angle": 0,
                "content": "answer_1 = Question(\"Which solicitor won the show Back to Reality ahead of Maureen Rees and Craig"
            },
            {
                "block_id": 25,
                "type": "text",
                "bbox": [
                    364,
                    1789,
                    560,
                    1824
                ],
                "angle": 0,
                "content": "Phillips?\""
            },
            {
                "block_id": 26,
                "type": "text",
                "bbox": [
                    364,
                    1824,
                    1600,
                    1859
                ],
                "angle": 0,
                "content": "answer_2 = Question(\"Which solicitor was a chair of Global Witness?\")"
            },
            {
                "block_id": 27,
                "type": "text",
                "bbox": [
                    364,
                    1859,
                    1101,
                    1894
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"\\\\{\"answer_1} is English.\")"
            },
            {
                "block_id": 28,
                "type": "text",
                "bbox": [
                    364,
                    1890,
                    1101,
                    1929
                ],
                "angle": 0,
                "content": "fact_2 = Verify(\"answer_2\" is English.\")"
            },
            {
                "block_id": 29,
                "type": "text",
                "bbox": [
                    364,
                    1929,
                    977,
                    1964
                ],
                "angle": 0,
                "content": "label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 30,
                "type": "title",
                "bbox": [
                    364,
                    2006,
                    476,
                    2041
                ],
                "angle": 0,
                "content": "Claim:"
            },
            {
                "block_id": 31,
                "type": "text",
                "bbox": [
                    364,
                    2041,
                    2012,
                    2080
                ],
                "angle": 0,
                "content": "Anthony Burgess addressed the novelist and essayist, the author of Grimus, in a lengthy love"
            },
            {
                "block_id": 32,
                "type": "text",
                "bbox": [
                    364,
                    2080,
                    1545,
                    2118
                ],
                "angle": 0,
                "content": "letter. The author is of the same nationality as Raj Koothrappali."
            },
            {
                "block_id": 33,
                "type": "title",
                "bbox": [
                    364,
                    2157,
                    689,
                    2196
                ],
                "angle": 0,
                "content": "Predicted Program:"
            },
            {
                "block_id": 34,
                "type": "text",
                "bbox": [
                    364,
                    2196,
                    2046,
                    2231
                ],
                "angle": 0,
                "content": "answer_1 = Question(\"Which novelist and essayist did Anthony Burgess address in a lengthy love"
            },
            {
                "block_id": 35,
                "type": "text",
                "bbox": [
                    364,
                    2231,
                    530,
                    2266
                ],
                "angle": 0,
                "content": "letter?\""
            },
            {
                "block_id": 36,
                "type": "text",
                "bbox": [
                    364,
                    2266,
                    1332,
                    2304
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"\\\\{answer_1} is the author of Grimus.\")"
            },
            {
                "block_id": 37,
                "type": "text",
                "bbox": [
                    364,
                    2304,
                    1563,
                    2339
                ],
                "angle": 0,
                "content": "answer_2 = Question(\"What is the nationality of Raj Koothrappali?\")"
            },
            {
                "block_id": 38,
                "type": "text",
                "bbox": [
                    364,
                    2339,
                    1634,
                    2374
                ],
                "angle": 0,
                "content": "fact_2 = Verify({'answer_1} is of the same nationality as {answer_2}.\")"
            },
            {
                "block_id": 39,
                "type": "text",
                "bbox": [
                    364,
                    2374,
                    977,
                    2413
                ],
                "angle": 0,
                "content": "label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 40,
                "type": "title",
                "bbox": [
                    364,
                    2473,
                    476,
                    2508
                ],
                "angle": 0,
                "content": "Claim:"
            },
            {
                "block_id": 41,
                "type": "text",
                "bbox": [
                    362,
                    2508,
                    2026,
                    2546
                ],
                "angle": 0,
                "content": "The critically acclaimed film, that Buddy Baker scored in 1975, is a Walt Disney film. It was"
            },
            {
                "block_id": 42,
                "type": "text",
                "bbox": [
                    364,
                    2546,
                    1724,
                    2585
                ],
                "angle": 0,
                "content": "produced first before the film that featured Bruce M. Fischer as Mr. Coogar."
            },
            {
                "block_id": 43,
                "type": "title",
                "bbox": [
                    364,
                    2623,
                    689,
                    2662
                ],
                "angle": 0,
                "content": "Predicted Program:"
            },
            {
                "block_id": 44,
                "type": "text",
                "bbox": [
                    364,
                    2662,
                    1883,
                    2697
                ],
                "angle": 0,
                "content": "answer_1 = Question(\"Which critically acclaimed film did Buddy Baker score in 1975?\")"
            },
            {
                "block_id": 45,
                "type": "text",
                "bbox": [
                    364,
                    2697,
                    1297,
                    2732
                ],
                "angle": 0,
                "content": "fact_1 = Verify(\"answer_1\" is a Walt Disney film.\")"
            },
            {
                "block_id": 46,
                "type": "text",
                "bbox": [
                    364,
                    2732,
                    1684,
                    2771
                ],
                "angle": 0,
                "content": "answer_2 = Question(\"Which film featured Bruce M. Fischer as Mr. Coogar?\")"
            },
            {
                "block_id": 47,
                "type": "text",
                "bbox": [
                    364,
                    2771,
                    1563,
                    2806
                ],
                "angle": 0,
                "content": "fact_2 = Verify(\"answer_1\" was produced first before {answer_2}.\")"
            },
            {
                "block_id": 48,
                "type": "text",
                "bbox": [
                    364,
                    2806,
                    977,
                    2844
                ],
                "angle": 0,
                "content": "label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 49,
                "type": "image_caption",
                "bbox": [
                    630,
                    2915,
                    1838,
                    2967
                ],
                "angle": 0,
                "content": "Figure 7: Examples of generated reasoning programs by PROGRAMFC."
            },
            {
                "block_id": 50,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6996"
            }
        ]
    },
    {
        "page_id": 16,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    349,
                    413,
                    2123,
                    2946
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 8: Example error cases where the generated reasoning programs are incorrect. The incorrect segment(s) are marked in red, and the correct revisions are marked in green."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1290,
                    3301
                ],
                "angle": 0,
                "content": "6997"
            }
        ]
    },
    {
        "page_id": 17,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code",
                "bbox": [
                    287,
                    326,
                    2198,
                    3209
                ],
                "angle": 0,
                "content": "'Generate a python-like program that describes the reasoning steps required to verify the claim step-by-step. You can call three functions in the program: 1. Question () to answer a question; 2. Verify () to verify a simple claim; 3. Predict() to predict the veracity label.'   \n# The claim is that Howard University Hospital and Providence Hospital are both located in Washington, D.C. def program(): fact_1 = Verify(\"Howard University Hospital is located in Washington, D.C.\") fact_2 = Verify(\"Providence Hospital is located in Washington, D.C.\")\nlabel = Predict(fact_1 and fact_2)   \n# The claim is that WWE Super Tuesday took place at an arena that currently goes by the name TD Garden. def program(): answer_1 = Question(\"Which arena the WWE Super Tuesday took place?\")\nfact_1 = Verify(f{\"answer_1} currently goes by the name TD Garden.\")\nlabel = Predict(fact_1)   \n# The claim is that Talking Heads, an American rock band that was \"one of the most critically acclaimed bands of the 80's\" is featured in KSPN's AAA format. def program(): fact_1 = Verify(\"Talking Heads is an American rock band that was 'one of the most critically acclaimed bands of the 80's'.\")\nfact_2 = Verify(\"Talking Heads is featured in KSPN's AAA format.\")\nlabel = Predict(fact_1 and fact_2)   \n# The claim is that An IndyCar race driver drove a Formula 1 car designed by Peter McCool during the 2007 Formula One season. def program(): answer_1 = Question(\"Which Formula 1 car was designed by Peter McCool during the 2007 Formula One season?\"\nfact_1 = Verify(f{\"An IndyCar race driver drove the car {answer_1}.})\nlabel = Predict(fact_1)   \n# The claim is that Gina Bramhill was born in a village. The 2011 population of the area that includes this village was 167,446. def program(): answer_1 = Question(\"Which village was Gina Bramhill born in?\")\nfact_1 = Verify(f\"The 2011 population of the area that includes {answer_1} was 167,446.\")\nlabel = Predict(fact_1)   \n# The claim is that Don Ashley Turlington graduated from Saint Joseph's College, a private Catholic liberal arts college in Standish. def program(): fact_1 = Verify(\"Saint Joseph's College is a private Catholic liberal arts college is located in Standish.\")\nfact_2 = Verify(f\"Don Ashley Turlington graduated from Saint Joseph's College.\")\nlabel = Predict(fact_1 and fact_2)   \n# The claim is that Gael and Fitness are not published in the same country. def program(): answer_1 = Question(\"Which country was Gael published in?\")\nanswer_2 = Question(\"Which country was Fitness published in?\")\nfact_1 = Verify(f{\"answer_1} and {answer_2} are not the same country.\")\nlabel = Predict(fact_1)   \n# The claim is that Blackstar is the name of the album released by David Bowie that was recorded in secret. def program(): fact_1 = Verify(\"David Bowie released an album called Blackstar.\")\nfact_2 = Verify(\"David Bowie recorded an album in secret.\")\nlabel = Predict(fact_1 and fact_2)   \n# The claim is that In the 2004 Hockey film produced by a former major league baseball pitcher Kurt Russell played the USA coach. def program(): answer_1 = Question(\"Which 2004 Hockey film was produced a former major league"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1290,
                    3301
                ],
                "angle": 0,
                "content": "6998"
            }
        ]
    },
    {
        "page_id": 18,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code",
                "bbox": [
                    287,
                    301,
                    2195,
                    3213
                ],
                "angle": 0,
                "content": "baseball pitcher?\") fact_1 = Verify(\"Kurt Russell played the USA coach in the film {answer_1}.\") label = Predict(fact_1)   \n# The claim is that Along with the New York Islanders and the New York Rangers, the New Jersey Devils NFL franchise is popular in the New York metropolitan area. def program(): fact_1 = Verify(\"The New York Islanders and the New York Rangers are popular in the New York metropolitan area.\") fact_2 = Verify(\"The New Jersey Devils NFL franchise is popular in the New York metropolitan area.\") label = Predict(fact_1 and fact_2)   \n# The claim is that Jack McFarland is the best known role of the host of the 64th Annual Tony Awards.   \ndef program(): answer_1 = Question(\"Who is the host of the 64th Annual Tony Awards?\") fact_1 = Verify(f\\\\\"Jack McFarland is the best known role of {answer_1}.\") label = Predict(fact_1)   \n# The claim is that The song recorded by Fergie that was produced by Polow da Don and was followed by Life Goes On was M.I.L.F.\\$.   \ndef program(): fact_1 = Verify(\"M.I.L.F.\\$ was recorded by Fergie that was produced by Polow da Don.\" ) fact_2 = Verify(\"M.I.L.F.\\$ was was followed by Life Goes On.\") label = Predict(fact_1 and fact_2)   \n# The claim is that Eatza Pizza and Your Pie were not founded in the same state.   \ndef program(): answer_1 = Question(\"Which state was Eatza Pizza founded in?\" ) answer_2 = Question(\"Which state was Your Pie founded in?\") fact_1 = Verify(f\"\\{answer_1\\} and {answer_2} are not the same state.\") label = Predict(fact_1)   \n# The claim is that Gregg Rolie and Rob Tyner, are not a keyboardist.   \ndef program(): fact_1 = Verify(\"Gregg Rolie is not a keyboardist.\") fact_2 = Verify(\"Rob Tyner is not a keyboardist.\") label = Predict(fact_1 and fact_2)   \n# The claim is that Maria Esther Andion Bueno, not Jimmy Connors, is the player that is from Brazil.   \ndef program(): fact_1 = Verify(\"Maria Esther Andion Bueno is from Brazil.\") fact_2 = Verify(\"Jimmy Connors is not from Brazil.\")\n label = Predict(fact_1 and fact_2)   \n# The claim is that Vladimir Igorevich Arnold died after Georg Cantor.   \ndef program(): answer_1 = Question(\"When did Vladimir Igorevich Arnold die?\") answer_2 = Question(\"When did Georg Cantor die?\") fact_1 = Verify(f\"\\{answer_1\\} is after {answer_2}.\") label = Predict(fact_1)   \n# The claim is that Barton Mine was halted by a natural disaster not Camlaren Mine.   \ndef program(): fact_1 = Verify(\"Barton Mine was halted by a natural disaster.\")\n fact_2 = Verify(\"Camlaren Mine was not halted by a natural disaster.\")\n label = Predict(fact_1 and fact_2)   \n# The claim is that John O'Hara and Rabindranath Tagore are not the same nationality.   \ndef program(): answer_1 = Question(\"What is the nationality of John O'Hara?\") answer_2 = Question(\"What is the nationality of Rabindranath Tagore?\") fact_1 = Verify(f\"\\{answer_1\\} and {answer_2} are not the same nationality.\")\n label = Predict(fact_1)"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "6999"
            }
        ]
    },
    {
        "page_id": 19,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code",
                "bbox": [
                    285,
                    301,
                    2195,
                    1196
                ],
                "angle": 0,
                "content": "The claim is that Thomas Loren Friedman has won more Pulitzer Prizes than Colson Whitehead.   \ndef program(): answer_1 \\(=\\) Question(\"How many Pulitzer Prizes has Thomas Loren Friedman won?\") answer_2 \\(=\\) Question(\"How many Pulitzer Prizes has Colson Whitehead won?\") fact_1 \\(=\\) Verify(f{\"answer_1} is more than {answer_2}.\") label \\(=\\) Predict(fact_1)   \n# The claim is that The model of car Trevor Bayne drives was introduced for model year 2006. The Rookie of The Year in the 1997 CART season drives it in the NASCAR Sprint Cup.   \ndef program(): answer_1 \\(=\\) Question(\"Which model of car is driven by Trevor Bayne?\") fact_1 \\(=\\) Verify(f{\"answer_1} was introduced for model year 2006.\"). answer_2 \\(=\\) Question(\"Who is the Rookie of The Year in the 1997 CART season?\") fact_2 \\(=\\) Verify(f{\"answer_2} drives the model of car Trevor Bayne drives in the NASCAR Sprint Cup.\" label \\(=\\) predict(fact_1 and fact_2)   \n# The claim is that <input_claim>   \ndef program():",
                "caption": "Listing 1: The prompt used for Program Generation for HOVER."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "7000"
            }
        ]
    },
    {
        "page_id": 20,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    290,
                    371,
                    2123,
                    547
                ],
                "angle": 0,
                "content": "'''Generate a python-like program that describes the reasoning steps required to verify the claim step-by-step. You can call three functions in the program: 1. Question () to answer a question; 2. Verify () to verify a simple claim; 3. Predict() to predict the veracity label.'''"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    287,
                    578,
                    2175,
                    750
                ],
                "angle": 0,
                "content": "The claim is that In 1959, former Chilean boxer Alfredo Cornejo Cuevas (born June 6, 1933) won the gold medal in the welterweight division at the Pan American Games (held in Chicago, United States, from August 27 to September 7) in Chicago, United States, and the world amateur welterweight title in Mexico City."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    287,
                    754,
                    2183,
                    1129
                ],
                "angle": 0,
                "content": "def program():\n    fact_1 = Verify(\"Alfredo Cornejo Cuevas was born in June 6, 1933.\")\n    fact_2 = Verify(\"Alfredo Cornejo Cuevas won the gold medal in the welterweight division at the Pan American Games in 1959.\")\n    fact_3 = Verify(\"The Pan American Games in 1959 was held in Chicago, United States, from August 27 to September 7.\")\n    fact_4 = Verify(\"Alfredo Cornejo Cuevas won the world amateur welterweight title in Mexico City.\")\n    label = Predict(fact_1 and fact_2 and fact_3 and fact_4)"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    287,
                    1164,
                    2133,
                    1287
                ],
                "angle": 0,
                "content": "The claim is that The Footwork FA12, which was intended to start the season, finally debuted at the San Marino Grand Prix, a Formula One motor race held at Imola on 28 April 1991."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    287,
                    1290,
                    2173,
                    1585
                ],
                "angle": 0,
                "content": "def program():\n    fact_1 = Verify(\"The Footwork FA12, which was intended to start the season.\")\n    fact_2 = Verify(\"The Footwork FA12 finally debuted at the San Marino Grand Prix.\"\n    fact_3 = Verify(\"The San Marino Grand Prix was a Formula One motor race held at Imola on 28 April 1991.\")\n    label = Predict(fact_1 and fact_2 and fact_3)"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    287,
                    1620,
                    2133,
                    1704
                ],
                "angle": 0,
                "content": "The claim is that SkyHigh Mount Dandenong (formerly Mount Dandenong Observatory) is a restaurant located on top of Mount Dandenong, Victoria, Australia."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    287,
                    1708,
                    2180,
                    1960
                ],
                "angle": 0,
                "content": "def program():\n    fact_1 = Verify(\"SkyHigh Mount Dandenong is a restaurant located on top of Mount Dandenong, Victoria, Australia.\")\n    fact_2 = Verify(\"SkyHigh Mount Dandenong is formerly known as Mount Dandenong Observatory.\")\n    label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    287,
                    1996,
                    2175,
                    2080
                ],
                "angle": 0,
                "content": "The claim is that Before the first Europeans arrived or copra companies leased it, Maupihaa was home to Inca's in ancient times."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    287,
                    2083,
                    2163,
                    2290
                ],
                "angle": 0,
                "content": "def program():\n    fact_1 = Verify(\"Maupihaa was home to Inca's in ancient times.\")\n    fact_2 = Verify(\"Maupihaa was home to Inca's before the first Europeans arrived or copra companies leased it.\")\n    label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    287,
                    2325,
                    2155,
                    2448
                ],
                "angle": 0,
                "content": "The claim is that Shulin, a 33.1288 km (12.7911 sq mi) land located in New Taipei City, China, a country in East Asia, has a total population of 183,946 in December 2018."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    287,
                    2455,
                    2113,
                    2662
                ],
                "angle": 0,
                "content": "def program():\n    fact_1 = Verify(\"Shulin is a 33.1288 km (12.7911 sq mi) land located in New Taipei City, China.\")\n    fact_2 = Verify(\"Shulin has a total population of 183,946 in December 2018.\")\n    label = Predict(fact_1 and fact_2)"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    287,
                    2701,
                    2180,
                    2781
                ],
                "angle": 0,
                "content": "The claim is that Sumo wrestler Toyozakura Toshiaki committed match-fixing, ending his career in 2011 that started in 1989."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    290,
                    2785,
                    2113,
                    3037
                ],
                "angle": 0,
                "content": "def program():\n    fact_1 = Verify(\"Toyozakura Toshiaki ended his career in 2011 that started in 1989.\")\n    fact_2 = Verify(\"Toyozakura Toshiaki is a Sumo wrestler.\")\n    fact_3 = Verify(\"Toyozakura Toshiaki committed match-fixing.\")\n    label = Predict(fact_1 and fact_2 and fact_3)"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    287,
                    3073,
                    2173,
                    3202
                ],
                "angle": 0,
                "content": "The claim is that In 1959, former Chilean boxer Alfredo Cornejo Cuevas (born June 6, 1933) won the gold medal in the welterweight division at the Pan American Games (held in Chicago, United States, from August 27 to September 7) in Chicago"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1290,
                    3301
                ],
                "angle": 0,
                "content": "7001"
            }
        ]
    },
    {
        "page_id": 21,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code",
                "bbox": [
                    287,
                    301,
                    2195,
                    2729
                ],
                "angle": 0,
                "content": "def program(   ): fact_1 = Verify(\"Alfredo Cornejo Cuevas is a former Chilean boxer.\") fact_2 = Verify(\"Alfredo Cornejo won the gold medal in the welterweight division at the Pan American Games.\") fact_3 = Verify(\"The Pan American Games was held in Chicago, United States, from August 27 to September 7. \") fact_4 = Verify(\"Alfredo Cornejo won the world amateur welterweight title in Mexico City. \") label = Predict(fact_1 and fact_2 and fact_3 and fact_4) # The claim is that Adductor hiatus is associated with nine structures, seven of which enter and leave through hiatus. def program(   ): fact_1 = Verify(\"Adductor hiatus is associated with nine structures. \") fact_2 = Verify(\"Seven of the nine structures associated with Adductor hiatus enter and leave through hiatus. \") label = Predict(fact_1 and fact_2) # The claim is that Ifor Bowen Lloyd was educated at Winchester (an independent boarding school for boys in the British public school tradition) and Exeter College, Oxford where he was a member of the Library Committee of the Oxford Union Society, as well as, received a BA in Modern History in 1924. def program(   ): fact_1 = Verify(\"Ifor Bowen Lloyd was educated at Winchester and Exeter College, Oxford. \") fact_2 = Verify(\"Winchester is an independent boarding school for boys in the British public school tradition.\" ) fact_3 = Verify(\"While at Oxford, Ifor Bowen Lloyd was a member of the Library Committee of the Oxford Union Society.\" ) fact_4 = Verify(\"Ifor Bowen Lloyd received a BA in Modern History in 1924 at Oxford. \") label = Predict(fact_1 and fact_2 and fact_3 and fact_4) # The claim is that In the 2001 Stanley Cup playoffs Eastern Conference Semifinals Devils' Elias scored and Maple Leafs' left Devils player Scott Neidermayer hurt. def program(   ): fact_1 = Verify(\"In the 2001 Stanley Cup playoffs Eastern Conference Semifinals Devils' Elias scored. \") fact_2 = Verify(\"Maple Leafs' left Devils player Scott Neidermayer hurt. \") label = Predict(fact_1 and fact_2) # The claim is that Teldenia helena is a moth first described in 1967 by Wilkinson. def program(   ): fact_1 = Verify(\"Teldenia helena is a moth.\" ) fact_2 = Verify(\"Teldenia helena was first described by Wilkinson in 1967.\" ) label = Predict(fact_1 and fact_2) # The claim is that Born December 30, 1974, William Frick was a dark horse candidate in the Maryland House of Delegates appointment process. def program(   ): fact_1 = Verify(\"William Frick was born in December 30, 1974.\" ) fact_2 = Verify(\"William Frick was a dark horse candidate in the Maryland House of Delegates appointment process.\" ) label = Predict(fact_1 and fact_2) # The claim is that <input_claim> def program(   ):"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    632,
                    2750,
                    1838,
                    2799
                ],
                "angle": 0,
                "content": "Listing 2: The prompt used for Program Generation for FEVERIOUS-S."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "7002"
            }
        ]
    },
    {
        "page_id": 22,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    329,
                    298,
                    1079,
                    350
                ],
                "angle": 0,
                "content": "ACL 2023 Responsible NLP Checklist"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    287,
                    378,
                    801,
                    431
                ],
                "angle": 0,
                "content": "A For every submission:"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    325,
                    445,
                    1322,
                    554
                ],
                "angle": 0,
                "content": "A1. Did you describe the limitations of your work? Line 587 - 620"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    325,
                    592,
                    1371,
                    705
                ],
                "angle": 0,
                "content": "A2. Did you discuss any potential risks of your work? Line 626 - 630"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    325,
                    747,
                    1726,
                    855
                ],
                "angle": 0,
                "content": "A3. Do the abstract and introduction summarize the paper's main claims? Line 67 - 86"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    322,
                    898,
                    1659,
                    1010
                ],
                "angle": 0,
                "content": "A4. Have you used AI writing assistants when working on this paper? Left blank."
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    322,
                    445,
                    1726,
                    1010
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1048,
                    1213,
                    1108
                ],
                "angle": 0,
                "content": "B Did you use or create scientific artifacts?"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    329,
                    1126,
                    607,
                    1175
                ],
                "angle": 0,
                "content": "Line 327 - 352"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    325,
                    1213,
                    1314,
                    1326
                ],
                "angle": 0,
                "content": "B1. Did you cite the creators of artifacts you used? Line 328 - 329"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    320,
                    1371,
                    2188,
                    1483
                ],
                "angle": 0,
                "content": "B2. Did you discuss the license or terms for use and / or distribution of any artifacts? Not applicable. The datasets used in this paper are publicly available datasets from existing works."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    322,
                    1515,
                    2188,
                    1796
                ],
                "angle": 0,
                "content": "B3. Did you discuss if your use of existing artifact(s) was consistent with their intended use, provided that it was specified? For the artifacts you create, do you specify intended use and whether that is compatible with the original access conditions (in particular, derivatives of data accessed for research purposes should not be used outside of research contexts)? Line 327 - 344"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    320,
                    1841,
                    2188,
                    2062
                ],
                "angle": 0,
                "content": "B4. Did you discuss the steps taken to check whether the data that was collected / used contains any information that names or uniquely identifies individual people or offensive content, and the steps taken to protect / anonymize it? Not applicable. Left blank."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    320,
                    2104,
                    2185,
                    2269
                ],
                "angle": 0,
                "content": "B5. Did you provide documentation of the artifacts, e.g., coverage of domains, languages, and linguistic phenomena, demographic groups represented, etc.? Not applicable. Left blank."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    322,
                    2308,
                    2188,
                    2641
                ],
                "angle": 0,
                "content": "B6. Did you report relevant statistics like the number of examples, details of train / test / dev splits, etc. for the data that you used / created? Even for commonly-used benchmark datasets, include the number of examples in train / validation / test splits, as these provide necessary context for a reader to understand experimental results. For example, small differences in accuracy on large test sets may be significant, while on small test sets they may not be. Line 327 - 344"
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    320,
                    1213,
                    2188,
                    2641
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    285,
                    2683,
                    1225,
                    2743
                ],
                "angle": 0,
                "content": "C Did you run computational experiments?"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    332,
                    2760,
                    511,
                    2809
                ],
                "angle": 0,
                "content": "Section 4"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    322,
                    2852,
                    2188,
                    3020
                ],
                "angle": 0,
                "content": "C1. Did you report the number of parameters in the models used, the total computational budget (e.g., GPU hours), and computing infrastructure used? Figure 4; Appendix A"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    282,
                    3048,
                    2178,
                    3132
                ],
                "angle": 0,
                "content": "The Responsible NLP Checklist used at ACL 2023 is adopted from NAACL 2022, with the addition of a question on AI writing assistance."
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1290,
                    3301
                ],
                "angle": 0,
                "content": "7003"
            }
        ]
    },
    {
        "page_id": 23,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    322,
                    294,
                    2183,
                    466
                ],
                "angle": 0,
                "content": "C2. Did you discuss the experimental setup, including hyperparameter search and best-found hyperparameter values? Appendix A"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    322,
                    501,
                    2185,
                    729
                ],
                "angle": 0,
                "content": "C3. Did you report descriptive statistics about your results (e.g., error bars around results, summary statistics from sets of experiments), and is it transparent whether you are reporting the max, mean, etc. or just a single run?  \nAppendix A"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    320,
                    768,
                    2185,
                    992
                ],
                "angle": 0,
                "content": "C4. If you used existing packages (e.g., for preprocessing, for normalization, or for evaluation), did you report the implementation, model, and parameter settings used (e.g., NLTK, Spacy, ROUGE, etc.)? Not applicable. Left blank."
            },
            {
                "block_id": 3,
                "type": "list",
                "bbox": [
                    320,
                    294,
                    2185,
                    992
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    282,
                    1031,
                    2178,
                    1161
                ],
                "angle": 0,
                "content": "D Did you use human annotators (e.g., crowdworkers) or research with human participants? Left blank."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    317,
                    1196,
                    2185,
                    1364
                ],
                "angle": 0,
                "content": "D1. Did you report the full text of instructions given to participants, including e.g., screenshots, disclaimers of any risks to participants or annotators, etc.? Not applicable. Left blank."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    317,
                    1403,
                    2185,
                    1627
                ],
                "angle": 0,
                "content": "D2. Did you report information about how you recruited (e.g., crowdsourcing platform, students) and paid participants, and discuss if such payment is adequate given the participants' demographic (e.g., country of residence)? Not applicable. Left blank."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    317,
                    1666,
                    2185,
                    1894
                ],
                "angle": 0,
                "content": "D3. Did you discuss whether and how consent was obtained from people whose data you're using/curating? For example, if you collected data via crowdsourcing, did your instructions to crowdworkers explain how the data would be used? Not applicable. Left blank."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    317,
                    1929,
                    2170,
                    2041
                ],
                "angle": 0,
                "content": "D4. Was the data collection protocol approved (or determined exempt) by an ethics review board? Not applicable. Left blank."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    317,
                    2080,
                    2185,
                    2248
                ],
                "angle": 0,
                "content": "D5. Did you report the basic demographic and geographic characteristics of the annotator population that is the source of the data? Not applicable. Left blank."
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    317,
                    1196,
                    2185,
                    2248
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1193,
                    3258,
                    1292,
                    3301
                ],
                "angle": 0,
                "content": "7004"
            }
        ]
    }
]