[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    290,
                    310,
                    520,
                    491
                ],
                "angle": 0,
                "content": "LAW"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    290,
                    491,
                    726,
                    669
                ],
                "angle": 0,
                "content": "LIBRARY"
            },
            {
                "block_id": 2,
                "type": "header",
                "bbox": [
                    293,
                    669,
                    724,
                    712
                ],
                "angle": 0,
                "content": "LIBRARY OF CONGRESS"
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    464,
                    1125,
                    2080,
                    1369
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    683,
                    1692,
                    1866,
                    1758
                ],
                "angle": 0,
                "content": "Australia • Canada • Estonia • European Union"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    920,
                    1762,
                    1629,
                    1828
                ],
                "angle": 0,
                "content": "Lithuania • United Kingdom"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1127,
                    2085,
                    1410,
                    2154
                ],
                "angle": 0,
                "content": "June 2021"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1025,
                    2620,
                    1522,
                    2669
                ],
                "angle": 0,
                "content": "LL File No. 2021-020338"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1065,
                    2676,
                    1481,
                    2722
                ],
                "angle": 0,
                "content": "LRA-D-PUB-002618"
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    673,
                    3045,
                    1879,
                    3098
                ],
                "angle": 0,
                "content": "The Law Library of Congress, Global Legal Research Directorate"
            },
            {
                "block_id": 10,
                "type": "footer",
                "bbox": [
                    777,
                    3098,
                    1769,
                    3154
                ],
                "angle": 0,
                "content": "(202) 707-5080 \\(\\cdot\\) law@loc.gov \\(\\cdot\\) http://www.law.gov"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    578,
                    1455,
                    1963,
                    1765
                ],
                "angle": 0,
                "content": "This report is provided for reference purposes only. It does not constitute legal advice and does not represent the official opinion of the United States Government. The information provided reflects research undertaken as of the date of writing. It has not been updated."
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    290,
                    303,
                    563,
                    372
                ],
                "angle": 0,
                "content": "Contents"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    293,
                    495,
                    2254,
                    554
                ],
                "angle": 0,
                "content": "Introduction 1"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    293,
                    610,
                    2254,
                    666
                ],
                "angle": 0,
                "content": "Australia 3"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    290,
                    722,
                    2256,
                    778
                ],
                "angle": 0,
                "content": "Canada. 5"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    290,
                    834,
                    2254,
                    894
                ],
                "angle": 0,
                "content": "Estonia & Lithuania. 7"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    290,
                    950,
                    2254,
                    1009
                ],
                "angle": 0,
                "content": "European Union 9"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    290,
                    1062,
                    2254,
                    1125
                ],
                "angle": 0,
                "content": "United Kingdom 13"
            },
            {
                "block_id": 7,
                "type": "list",
                "bbox": [
                    290,
                    495,
                    2256,
                    1125
                ],
                "angle": 0,
                "content": null
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1065,
                    303,
                    1484,
                    376
                ],
                "angle": 0,
                "content": "Introduction"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    991,
                    409,
                    1555,
                    521
                ],
                "angle": 0,
                "content": "Eduardo Soares Senior Foreign Law Specialist"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    293,
                    643,
                    2254,
                    927
                ],
                "angle": 0,
                "content": "This report surveys the existence of legal frameworks or mechanisms for determinations to be made on genocide in jurisdictions around the globe. The focus of our research was whether countries have enacted legislation defining the legal requirements and processes for making genocide determinations and the possible outcomes of that process in terms of actions that a government must or may take in response to genocide."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    293,
                    986,
                    2254,
                    1326
                ],
                "angle": 0,
                "content": "Among the countries surveyed for this report, none of them have this type of separate or distinct legal framework. However, Australia, Canada, the European Union, Estonia, Lithuania, and the United Kingdom have, or are in the process of adopting, legislation similar to the United States Global Magnitsky Human Rights Accountability Act, which authorizes the President to impose economic sanctions and deny entry into the country to any foreign person identified as engaging in human rights abuses or corruption."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    293,
                    1386,
                    2254,
                    1669
                ],
                "angle": 0,
                "content": "Australia is currently considering the adoption of legislation enabling Magnitsky-style targeted sanctions, which a parliamentary committee recommended include a broad definition of human rights abuses. Canada has enacted the \"Sergei Magnitsky Law,\" which grants the government the ability to restrict dealings in property and freeze assets of foreign nationals responsible for gross violations of internationally recognized human rights."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    293,
                    1725,
                    2254,
                    1897
                ],
                "angle": 0,
                "content": "The European Union very recently enacted the Global Human Rights Sanctions Regime, which is also referred to as the European Magnitsky Act, to enable sanctions to be imposed for serious human rights abuses and violations, which specifically includes genocide."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    293,
                    1953,
                    2254,
                    2237
                ],
                "angle": 0,
                "content": "Following the Sergei Magnitsky case and the actions taken by the United States, Estonia has enacted legislation to permanently prohibit the entry of a person who participated or contributed to violations of human rights. Similarly, Lithuania has enacted a law that prohibits a person involved in human rights abuses, money laundering, and corruption to enter the country for five years."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    293,
                    2293,
                    2254,
                    2580
                ],
                "angle": 0,
                "content": "The United Kingdom has recently enacted a trade law that includes a process for a parliamentary committee to investigate credible reports of genocide in countries with which the UK has entered into negotiations for bilateral trade agreements. It has also amended legislation to enable sanctions to be imposed for gross human rights abuses or violations, based on the United States Magnitsky Act."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    293,
                    2643,
                    2254,
                    2811
                ],
                "angle": 0,
                "content": "Notwithstanding the absence of a formal framework or requirement for making genocide determinations, it seems that governments or legislatures of many jurisdictions around the world have the ability to make such declarations."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    293,
                    2871,
                    2254,
                    2986
                ],
                "angle": 0,
                "content": "In addition to those referred to above, the jurisdictions surveyed for this report included examples from all regions in the world, including 11 countries in Europe; 12 jurisdictions in Asia;"
            },
            {
                "block_id": 10,
                "type": "footer",
                "bbox": [
                    293,
                    3095,
                    867,
                    3148
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    2223,
                    3102,
                    2249,
                    3138
                ],
                "angle": 0,
                "content": "1"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    665,
                    151,
                    1879,
                    198
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: Introduction"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    298,
                    300,
                    2256,
                    468
                ],
                "angle": 0,
                "content": "various countries in the Middle East and North Africa, including Israel; Kenya, South Africa, and several French-speaking countries in Africa; several Caribbean countries; and Mexico and six jurisdictions in South America."
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    298,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    2223,
                    3102,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "2"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1116,
                    303,
                    1430,
                    376
                ],
                "angle": 0,
                "content": "Australia"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    958,
                    409,
                    1593,
                    574
                ],
                "angle": 0,
                "content": "Kelly Buchanan  \nChief, Foreign, Comparative, and International Law Division II"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    293,
                    702,
                    2256,
                    1445
                ],
                "angle": 0,
                "content": "Australia does not have a legal mechanism or framework for making determinations with respect to whether certain acts constitute genocide. In terms of sanctions for such acts, however, in December 2020, the Human Rights Sub-committee of the Joint Standing Committee on Foreign Affairs, Defence and Trade of the Australian Parliament published a report in which it recommended that Australia enact legislation enabling \"Magnitsky-style targeted sanctions\" for serious human rights abuses and serious corruption.\\(^{1}\\) The subcommittee considered that such legislation should include a broad definition of human rights abuses with \"further guidance on thresholds and applicable conduct provided in the preamble.\"\\(^{2}\\) It received a draft bill that had been prepared by Geoffrey Robertson AO QC at its request,\\(^{3}\\) which included reference to provisions in the Criminal Code Act 1995 (Cth) establishing the offenses of genocide, crimes against humanity, war crimes, and slavery.\\(^{4}\\) The subcommittee considered that the inclusion of these references is \"consistent with the document's object of deterring 'grave' or 'gross' human rights abuses,\"\\(^{5}\\) but did not refer to the specific inclusion of these offenses in its recommendations."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    293,
                    1501,
                    2256,
                    2016
                ],
                "angle": 0,
                "content": "Under the draft bill, and the subcommittee's recommendations, the minister for foreign affairs would be empowered to designate and take certain actions against a person if satisfied that the person is or has been involved in \"Magnitsky conduct.\"6 The subcommittee recommended that \"an independent advisory body be created to receive nominations, consider them and make recommendations to the Minister for a decision.\"7 It also recommended that the minister \"be able to impose sanctions without a recommendation by the advisory body,\"8 and have broad discretion in deciding whether to do so, rather than being required to apply express considerations in the legislation.9 The subcommittee recommended that the sanctions available under the legislation include \"visa/travel restrictions, limit access to assets, and restrict access to"
            },
            {
                "block_id": 4,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2131,
                    2210,
                    2333
                ],
                "angle": 0,
                "content": "<sup>1</sup> Press Release, Parliament of Australia, Australian Magnitsky-Style Law Recommended (Dec. 7, 2020), https://perma.cc/V4SJ-L98K. See also Joint Standing Committee on Foreign Affairs, Defence and Trade, Criminality, Corruption and Impunity: Should Australia Join the Global Magnitsky Movement? xxi & 98 (Dec. 2020), https://perma.cc/2KH6-9858 (\"Magnitsky Report\")."
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2356,
                    1634,
                    2405
                ],
                "angle": 0,
                "content": "2 Magnitsky Report, supra note 1, at xxi & 98. See id. at 68-69 for discussion."
            },
            {
                "block_id": 6,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2428,
                    474,
                    2475
                ],
                "angle": 0,
                "content": "3 Id. at 89."
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2501,
                    2213,
                    2597
                ],
                "angle": 0,
                "content": "<sup>4</sup> Id. Appendix D, proposed section 6; Criminal Code Act 1995 (Cth) divs 268 & 270, https://perma.cc/69UN-MG76."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2626,
                    989,
                    2679
                ],
                "angle": 0,
                "content": "Magnitsky Report, supra note 1, at 91."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2699,
                    1218,
                    2755
                ],
                "angle": 0,
                "content": "\\(^{6}\\) Id. at xxi, xxiii & Appendix D, proposed section 15."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2775,
                    805,
                    2821
                ],
                "angle": 0,
                "content": "7 Id. at 77. See also id. at xxii."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2851,
                    474,
                    2894
                ],
                "angle": 0,
                "content": "\\(^{8}\\) Id. at 78."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2923,
                    816,
                    2973
                ],
                "angle": 0,
                "content": "9 Id. at 81. See also id. at xxiii."
            },
            {
                "block_id": 13,
                "type": "list",
                "bbox": [
                    285,
                    2131,
                    2213,
                    2973
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 14,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    2221,
                    3098,
                    2251,
                    3141
                ],
                "angle": 0,
                "content": "3"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    696,
                    148,
                    1848,
                    207
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: Australia"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    283,
                    300,
                    2254,
                    478
                ],
                "angle": 0,
                "content": "Australia's financial systems\\(^{10}\\) and should be applicable to \"all entities, including natural persons, corporate entities and both state and non-state organisations.\"\\(^{11}\\) It also recommended that the legislation include a right for the sanctioned person to request a review of the decision.\\(^{12}\\)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    528,
                    2256,
                    765
                ],
                "angle": 0,
                "content": "The Australian government has not yet formally responded to the subcommittee's report. The original referral of the question as to whether to enact Magnitsky-style legislation was made by the minister for foreign affairs, who told a Senate committee in March 2021 that the government is still considering the matter.[13]"
            },
            {
                "block_id": 3,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2649,
                    634,
                    2699
                ],
                "angle": 0,
                "content": "10 Id. at xxiv & 103."
            },
            {
                "block_id": 4,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2725,
                    601,
                    2768
                ],
                "angle": 0,
                "content": "11 Id. at xxii & 99."
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2801,
                    711,
                    2844
                ],
                "angle": 0,
                "content": "12 Id. at xxiv, 85 & 103."
            },
            {
                "block_id": 6,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2874,
                    2119,
                    2979
                ],
                "angle": 0,
                "content": "\\(^{13}\\) Senate, Foreign Affairs, Defence and Trade Legislation Committee, Estimates Hearing, Department of Foreign Affairs and Trade, March 25, 2021, https://perma.cc/3ZMK-UD86."
            },
            {
                "block_id": 7,
                "type": "list",
                "bbox": [
                    288,
                    2649,
                    2119,
                    2979
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 8,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3154
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 9,
                "type": "page_number",
                "bbox": [
                    2221,
                    3098,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "4"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1139,
                    303,
                    1405,
                    376
                ],
                "angle": 0,
                "content": "Canada"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    1055,
                    409,
                    1494,
                    528
                ],
                "angle": 0,
                "content": "Tariq Ahmad Foreign Law Specialist"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    646,
                    2261,
                    933
                ],
                "angle": 0,
                "content": "Canada does not appear to have a specific law or legislative framework for the government to make declarations or determinations of the international crime of genocide. Individual cases are highlighted politically, however, as part of a parliamentary declaration or dealt with more concretely through Canada's human rights sanctions regime and other forms of economic or trade sanctions.[1]"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    293,
                    986,
                    2266,
                    1788
                ],
                "angle": 0,
                "content": "Canada, like other major countries, \"has a broad range of economic and financial sanctions targeting foreign states and their nationals,\"[2] including for gross violations of human rights. The Special Economic Measures Act (SEMA)[3] enables the Government of Canada to impose sanctions on foreign states and persons when certain circumstances have occurred, including if the government is of the opinion that \"gross and systematic human rights violations have been committed in a foreign state.\"[4] The Justice for Victims of Corrupt Foreign Officials Act (commonly known as the Sergei Magnitsky Law or SML)[5] gives the Government of Canada the authority to impose targeted measures, \"to make orders and regulations to restrict dealings in property and freeze the assets\"[6] of foreign nationals who, in the government's opinion, \"are responsible for, or complicit in, gross violations of internationally recognized human rights.\"[7] Designations under SML are made through the Justice for Victims of Corrupt Foreign Officials Regulations.[8] Although these laws do not mention genocide specifically, they are written in language sufficiently general to include it. For example, section 4(1.1) of SEMA outlines the following circumstances under which the government can impose sanctions:"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    1841,
                    2093,
                    1999
                ],
                "angle": 0,
                "content": "(a) an international organization of states or association of states, of which Canada is a member, has made a decision or a recommendation or adopted a resolution calling on its members to take economic measures against a foreign state;"
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2158,
                    2221,
                    2362
                ],
                "angle": 0,
                "content": "<sup>1</sup> John W. Boscariol, Canada Announces Human Rights Sanctions Against China, McCarthy Tetrault LLP (Mar. 23, 2021), https://perma.cc/4MYM-TRPZ. Canada also has a domestic statute criminalizing genocide and other international crimes and implementing its obligations under the Rome statute known as the Crimes Against Humanity and War Crimes Act, S.C. 2000, c 24, https://perma.cc/2Q8V-STUD."
            },
            {
                "block_id": 6,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2376,
                    1869,
                    2481
                ],
                "angle": 0,
                "content": "<sup>2</sup> Greg Kanargelidis et al., A Primer on Canadian Sanctions Legislation, Blakes (Apr. 7, 2021), https://perma.cc/D3BS-YT97."
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2501,
                    1881,
                    2557
                ],
                "angle": 0,
                "content": "<sup>3</sup> Special Economic Measures Act (SEMA), S.C. 1992, c 17, https://perma.cc/Z9AC-CPUY."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2577,
                    563,
                    2633
                ],
                "angle": 0,
                "content": "\\(^{4}\\) Id. \\(\\S 4(1.1)(c)\\)."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2649,
                    2024,
                    2755
                ],
                "angle": 0,
                "content": "<sup>5</sup> Justice for Victims of Corrupt Foreign Officials Act (Sergei Magnitsky Law, SML), S.C. 2017, c 21, https://perma.cc/6G9V-QCP9."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2772,
                    2244,
                    2831
                ],
                "angle": 0,
                "content": "\\(^{6}\\) Justice for Victims of Corrupt Foreign Officials Act, Gov't Canada, (Oct. 16, 2019), https://perma.cc/X6WJ-LLSV."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2847,
                    795,
                    2904
                ],
                "angle": 0,
                "content": "7 Kanargelidis, supra note 2."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2923,
                    2205,
                    2979
                ],
                "angle": 0,
                "content": "<sup>8</sup> Justice for Victims of Corrupt Foreign Officials Regulations, SOR/2017-233, https://perma.cc/N9U8-9TYZ."
            },
            {
                "block_id": 13,
                "type": "list",
                "bbox": [
                    283,
                    2158,
                    2244,
                    2979
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 14,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    2221,
                    3098,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "5"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    714,
                    151,
                    1828,
                    204
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: Canada"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    436,
                    300,
                    2080,
                    399
                ],
                "angle": 0,
                "content": "(b) a grave breach of international peace and security has occurred that has resulted in or is likely to result in a serious international crisis;"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    405,
                    1945,
                    508
                ],
                "angle": 0,
                "content": "(c) gross and systematic human rights violations have been committed in a foreign state. . . . 9"
            },
            {
                "block_id": 3,
                "type": "list",
                "bbox": [
                    436,
                    300,
                    2080,
                    508
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    541,
                    2119,
                    653
                ],
                "angle": 0,
                "content": "Section 4(2) of Canada's SML sets out the circumstances under which the government can impose sanctions:"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    436,
                    679,
                    2042,
                    834
                ],
                "angle": 0,
                "content": "(a) a foreign national is responsible for, or complicit in, extrajudicial killings, torture or other gross violations of internationally recognized human rights committed against individuals in any foreign state who seek"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    589,
                    887,
                    1846,
                    943
                ],
                "angle": 0,
                "content": "(i) to expose illegal activity carried out by foreign public officials, or"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    586,
                    993,
                    2027,
                    1194
                ],
                "angle": 0,
                "content": "(ii) to obtain, exercise, defend or promote internationally recognized human rights and freedoms, such as freedom of conscience, religion, thought, belief, opinion, expression, peaceful assembly and association, and the right to a fair trial and democratic elections;"
            },
            {
                "block_id": 8,
                "type": "list",
                "bbox": [
                    586,
                    887,
                    2027,
                    1194
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    436,
                    1250,
                    2093,
                    1353
                ],
                "angle": 0,
                "content": "(b) a foreign national acts as an agent of or on behalf of a foreign state in a matter relating to an activity described in paragraph (a). . . . 10"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    1389,
                    2256,
                    1623
                ],
                "angle": 0,
                "content": "The laws do not set to define gross violation of human rights but Section 4(2) and the preamble to Canada's SML does make reference to \"international recognized human rights\" and Canada's commitment to \"promoting international justice and respect for human rights\" and \"obligations and responsibilities set out in\" international human rights agreements.[11]"
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2772,
                    594,
                    2824
                ],
                "angle": 0,
                "content": "9 SEMA, § 4(1.1)."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    298,
                    2851,
                    650,
                    2900
                ],
                "angle": 0,
                "content": "10 SML, § 4(2)(a)-(b)."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    295,
                    2927,
                    510,
                    2976
                ],
                "angle": 0,
                "content": "11 Id. prmbl."
            },
            {
                "block_id": 14,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    2221,
                    3102,
                    2251,
                    3141
                ],
                "angle": 0,
                "content": "6"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1139,
                    303,
                    1402,
                    376
                ],
                "angle": 0,
                "content": "Estonia"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    1109,
                    412,
                    1438,
                    488
                ],
                "angle": 0,
                "content": "Lithuania"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    1144,
                    521,
                    1399,
                    570
                ],
                "angle": 0,
                "content": "Peter Roudik"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1025,
                    577,
                    1522,
                    633
                ],
                "angle": 0,
                "content": "Director of Legal Research"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1150,
                    689,
                    1392,
                    735
                ],
                "angle": 0,
                "content": "Iana Fremer"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1050,
                    742,
                    1496,
                    798
                ],
                "angle": 0,
                "content": "Legal Research Analyst"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    930,
                    2256,
                    1161
                ],
                "angle": 0,
                "content": "Generally recognized principles and rules of international law are considered a part of the Estonian legal system,\\(^{1}\\) and crimes against humanity, including genocide, are prosecuted under Estonian criminal legislation regardless of the time and place of commission of the crime, in line with Estonian international obligations.\\(^{2}\\)"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    283,
                    1214,
                    2256,
                    1392
                ],
                "angle": 0,
                "content": "Estonian legislation does not specifically provide a means for determining whether particular actions constitute genocide or for determining when sanctions need to be imposed on perpetrators of genocide."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    283,
                    1442,
                    2256,
                    1841
                ],
                "angle": 0,
                "content": "However, in 2016, following the \"Sergei Magnitsky case and the actions of the U.S. authorities [that] have started a global movement to hold individual perpetrators accountable for their human rights violations,\"<sup>3</sup> Estonia adopted amendments to the national Obligation to Leave and Prohibition on Entry Act, allowing it to permanently prohibit entry into Estonia to a foreigner if there is good reason to believe that the person has participated in or contributed to violations of human rights in a foreign country.<sup>4</sup> The entry ban applies to a person who committed a human rights violation that resulted in"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    290,
                    1904,
                    739,
                    1960
                ],
                "angle": 0,
                "content": "death of a person,"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    288,
                    1966,
                    902,
                    2019
                ],
                "angle": 0,
                "content": "serious injury of a person,"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    288,
                    2022,
                    2024,
                    2079
                ],
                "angle": 0,
                "content": "- unfounded conviction of a person in an offense inspired by political motives, and"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    290,
                    2082,
                    956,
                    2135
                ],
                "angle": 0,
                "content": "- other serious consequences.5"
            },
            {
                "block_id": 13,
                "type": "list",
                "bbox": [
                    288,
                    1904,
                    2024,
                    2135
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 14,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2432,
                    1354,
                    2488
                ],
                "angle": 0,
                "content": "<sup>1</sup> Estonia Const. 1992 art. 3, https://perma.cc/7NEV-FEM7."
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2504,
                    2147,
                    2560
                ],
                "angle": 0,
                "content": "2 Penal Code arts. 8, 90, Riigi Teataja 2001, No. 61, Item 364, as amended, https://perma.cc/W75P-HP7W."
            },
            {
                "block_id": 16,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2580,
                    2170,
                    2682
                ],
                "angle": 0,
                "content": "<sup>3</sup> Truth Hounds, Civic Solidarity & Coalition for the International Criminal Court, Magnitsky Laws: Practical Guide to Sanctioning Human Rights Violators 4, https://perma.cc/5UB7-6W2P."
            },
            {
                "block_id": 17,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2706,
                    2144,
                    2808
                ],
                "angle": 0,
                "content": "\\(^{4}\\) Law No. 262-SE of December 8, 2016, on Amendments to the Law of Estonia on Obligation to Leave and Prohibition on Entry, art. 4, https://perma.cc/GHU5-SE7U (in Estonian)."
            },
            {
                "block_id": 18,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2824,
                    2249,
                    2927
                ],
                "angle": 0,
                "content": "<sup>5</sup> Obligation to Leave and Prohibition on Entry Act, art. 29-6-1, Riigi Teataja 1998, No. 98, Item 1575, as amended, https://perma.cc/XA6K-RYUU."
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    285,
                    2432,
                    2249,
                    2927
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 20,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 21,
                "type": "page_number",
                "bbox": [
                    2221,
                    3098,
                    2251,
                    3138
                ],
                "angle": 0,
                "content": "7"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    594,
                    148,
                    1948,
                    207
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: Estonia & Lithuania"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    283,
                    300,
                    2254,
                    534
                ],
                "angle": 0,
                "content": "The decision to include a person in the no-entry list is made by the Minister of Interior upon review of a request submitted by any government authority or state agency.6 The Ministry of Interior maintains a list of those who are banned from entry in Estonia. As of 2018, this list included 49 names of people accused of committing serious human rights violations.7"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    584,
                    2254,
                    759
                ],
                "angle": 0,
                "content": "In Lithuania, a similar law that prevents persons involved in human rights abuses, money laundering and corruption from entering the country during a five-year period was passed in 2017. The law specifies that the entry ban applies to aliens who have"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    433,
                    815,
                    2108,
                    1181
                ],
                "angle": 0,
                "content": "committed a serious or grave crime against a person in a foreign state thus violating the universal human rights and freedoms, or has committed a criminal act of a corruptive nature or a criminal act with indications of money laundering as defined in laws or international treaties of the Republic of Lithuania, or has instigated or otherwise participated in committing such criminal acts and/or for these reasons the alien is placed on the national no-entry list of another EU Member State, member country of the European Free Trade Association or country of the North Atlantic Treaty Organisation.[9]"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1230,
                    2254,
                    1353
                ],
                "angle": 0,
                "content": "The ban can be extended beyond the five-year period. The determination is made by the Minister of Interior based on information provided by the Ministry of Foreign Affairs.[10]"
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2577,
                    612,
                    2626
                ],
                "angle": 0,
                "content": "\\(^{6}\\) Id. arts. 31, 31-1."
            },
            {
                "block_id": 6,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2653,
                    1068,
                    2706
                ],
                "angle": 0,
                "content": "Truth Hounds et al., supra note 3, annex 1."
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2725,
                    1958,
                    2824
                ],
                "angle": 0,
                "content": "\\(^{8}\\) Law XIII-742 Amending Article 133 of Law No IX-2206 on the Legal Status of Aliens, Nov. 16, 2017, https://perma.cc/KZA2-6FYH."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2851,
                    752,
                    2900
                ],
                "angle": 0,
                "content": "9 Id. art. 1, art. 133 para. 4."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2923,
                    767,
                    2976
                ],
                "angle": 0,
                "content": "\\(^{10}\\) Id. art. 1, art. 133 para. 8."
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    283,
                    2577,
                    1958,
                    2976
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    2221,
                    3095,
                    2251,
                    3141
                ],
                "angle": 0,
                "content": "8"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1004,
                    303,
                    1542,
                    392
                ],
                "angle": 0,
                "content": "European Union"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    1055,
                    409,
                    1489,
                    524
                ],
                "angle": 0,
                "content": "Jenny Gesley  \nForeign Law Specialist"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    293,
                    660,
                    2261,
                    1366
                ],
                "angle": 0,
                "content": "SUMMARY The European Union (EU) Global Human Rights Sanctions Regime, enacted in December 2020, provides a formal legal framework to hold perpetrators of serious human rights violations and abuses accountable by implementing targeted restrictive measures. Genocide is explicitly listed as one of the offenses to which the framework applies. To make the determination that genocide has taken place, the law provides that \"regard should be had to customary international law and widely accepted instruments of international law....\" Proposals for inclusion in the sanctions list may be submitted by the EU Member States and the High Representative of the Union for Foreign Affairs and Security Policy to the Council of the European Union (Council). The Council establishes and amends the list by unanimous decision. Two types of measures comprise the sanctions regime: financial sanctions, such as asset freezes and bans on making funds and economic resources available, and restrictions on movement (travel bans)."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    298,
                    1494,
                    657,
                    1551
                ],
                "angle": 0,
                "content": "I. Introduction"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    293,
                    1603,
                    2261,
                    2121
                ],
                "angle": 0,
                "content": "On December 7, 2020, the European Union (EU) enacted its Global Human Rights Sanctions Regime, also referred to as the \"European Magnitsky Act,\"<sup>1</sup> to hold perpetrators of serious human rights violations and abuses accountable. It consists of two acts, Council Regulation (EU) 2020/1998 (Regulation) and Council Decision (CFSP) 2020/1999 (Decision).<sup>2</sup> Genocide is explicitly listed as one of the offenses to which the framework applies.<sup>3</sup> The sanctions regime enables the EU to implement targeted restrictive measures no matter who is responsible for the respective infringements or where they occur. The EU Global Human Rights Sanctions Regime is in addition to the existing geographic sanctions regimes that address human rights violations and abuses."
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    298,
                    2626,
                    2244,
                    2732
                ],
                "angle": 0,
                "content": "<sup>1</sup> Martin Russell, *Legislative Train Schedule: A European Magnitsky Act*, European Parliament Members' Res. Serv. (May 21, 2021), https://perma.cc/2MPU-UPDF."
            },
            {
                "block_id": 6,
                "type": "page_footnote",
                "bbox": [
                    295,
                    2748,
                    2226,
                    2904
                ],
                "angle": 0,
                "content": "\\(^{2}\\) Consolidated Version of Council Regulation (EU) 2020/1998 (Regulation), 2020 O.J. (L 410I) 1, https://perma.cc/2RN8-UU6G; Consolidated Version of Council Decision (CFSP) 2020/1999 (Decision), 2020 O.J. (L 410I) 13, https://perma.cc/AC9Y-W7Q9."
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2923,
                    1282,
                    2983
                ],
                "angle": 0,
                "content": "<sup>3</sup> Decision, art. 1, para. 1(a); Regulation, art. 2, para. 1(a)."
            },
            {
                "block_id": 8,
                "type": "list",
                "bbox": [
                    293,
                    2626,
                    2244,
                    2983
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    298,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    2223,
                    3102,
                    2249,
                    3138
                ],
                "angle": 0,
                "content": "9"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    624,
                    151,
                    1917,
                    204
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: European Union"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    288,
                    359,
                    1458,
                    419
                ],
                "angle": 0,
                "content": "II. Legal Framework for Genocide Determinations"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    288,
                    475,
                    504,
                    528
                ],
                "angle": 0,
                "content": "A. Scope"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    587,
                    2256,
                    1095
                ],
                "angle": 0,
                "content": "The EU sanctions framework applies to serious human rights violations or abuses worldwide.\\(^{4}\\) The sanctions regime provides a nonexhaustive list of offenses that qualify as such—in particular, genocide and crimes against humanity.\\(^{5}\\) Other human rights violations or abuses fall under the regime's provisions if they \"are widespread, systematic or are otherwise of serious concern\" as regards article 21 of the Treaty on European Union (TEU).\\(^{6}\\) To make the determination that genocide has taken place, the law provides that \"regard should be had to customary international law and widely accepted instruments of international law, such as . . . the Convention on the Prevention and Punishment of the Crime of Genocide [and] the Rome Statute of the International Criminal Court.\"\\(^{7}\\)"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1155,
                    2256,
                    1435
                ],
                "angle": 0,
                "content": "The sanctions regime covers natural and legal persons, entities, or bodies that may include state actors, other actors exercising effective control or authority over a territory, or other non-state actors. Anyone who provides financial, technical, or material support, or is otherwise involved in a human rights abuse or violation or associated with the perpetrators may also be targeted with restrictive measures."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    288,
                    1498,
                    594,
                    1547
                ],
                "angle": 0,
                "content": "B. Procedure"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    1610,
                    2256,
                    2006
                ],
                "angle": 0,
                "content": "Persons, entities, or bodies that are subject to sanctions because they committed serious human rights violations or abuses are listed in the annex to the Decision and the Regulation. Proposals for inclusion in the list may be submitted by the EU Member States and the High Representative of the Union for Foreign Affairs and Security Policy (High Representative)\\(^{10}\\) to the Council of the European Union (Council). The Council is the co-legislator of the EU together with the European Parliament. It is made up of a government minister from each EU country according to the policy area to be discussed.\\(^{11}\\)"
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2207,
                    930,
                    2257
                ],
                "angle": 0,
                "content": "4 Decision, art. 1, para. 1, sentence 1."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2283,
                    1188,
                    2333
                ],
                "angle": 0,
                "content": "\\(^{5}\\) Decision, art. 1, para. 1; Regulation, art. 2, para. 1."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2356,
                    2147,
                    2458
                ],
                "angle": 0,
                "content": "\\(^{6}\\) Decision, art. 1, para. 1(d). Regulation, art. 2, para. 1(d). Consolidated Version of the Treaty on European Union (TEU), art. 18, 2016 O.J. (C 202) 1, https://perma.cc/9PVJ-BW5W."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2478,
                    1188,
                    2531
                ],
                "angle": 0,
                "content": "7 Decision, art. 1, para. 2; Regulation, art. 2, para. 2."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2554,
                    1167,
                    2603
                ],
                "angle": 0,
                "content": "\\(^{8}\\) Decision art. 1, para. 3; Regulation art. 2, para. 3."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2626,
                    1389,
                    2679
                ],
                "angle": 0,
                "content": "\\(^{9}\\) Decision, art. 2, para. 1(b)-(c); Regulation art. 3, para. 3(b)-(c)."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2699,
                    2249,
                    2904
                ],
                "angle": 0,
                "content": "<sup>10</sup> The High Representative presides over the Foreign Affairs Council of the Council of the European Union and is one of the vice-presidents of the European Commission, the EU's executive body. He or she conducts the EU's common foreign and security policy. See Consolidated Version of the Treaty on European Union (TEU), art. 18, 2016 O.J. (C 202) 1, https://perma.cc/9PVJ-BW5W."
            },
            {
                "block_id": 14,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2923,
                    550,
                    2973
                ],
                "angle": 0,
                "content": "11 TEU, art. 16."
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    283,
                    2207,
                    2249,
                    2973
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    2200,
                    3095,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "10"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    624,
                    151,
                    1917,
                    204
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: European Union"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    283,
                    300,
                    2264,
                    590
                ],
                "angle": 0,
                "content": "The Council establishes and amends the list by unanimous decision.\\(^{12}\\) The Council Implementing Regulation that contains the amendment of the list is published in the Official Journal of the European Union (O.J.). In addition, the names and identifying information of the listed persons/entities are added to the EU Sanctions Map and the Financial Sanctions Database, both of which are publicly available online free of charge.\\(^{13}\\)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    643,
                    2256,
                    881
                ],
                "angle": 0,
                "content": "The grounds for the listing must be communicated to the person, entity, or body concerned, followed by an opportunity for them to present their observations.\\(^{14}\\) Such a communication can be made either directly if the address is known or by public notice.\\(^{15}\\) A revision of the list must take place at least every 12 months.\\(^{16}\\) The grounds for the listing are also included in the annex.\\(^{17}\\)"
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    288,
                    927,
                    581,
                    980
                ],
                "angle": 0,
                "content": "C. Sanctions"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1039,
                    2256,
                    1435
                ],
                "angle": 0,
                "content": "Two types of measures comprise the sanctions regime: financial sanctions, such as asset freezes and bans on making funds and economic resources available, and restrictions on movement (travel bans). The Regulation deals with financial sanctions, whereas the Decision deals with travel bans. EU sanctions are applied by the EU Member States. They are obligated to inform each other and the European Commission of measures taken, in particular regarding the freezing of funds or any national enforcement problems. The European Commission monitors the enforcement and uniform implementation of sanctions by the Member States."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    283,
                    1494,
                    2254,
                    1722
                ],
                "angle": 0,
                "content": "The competent authorities in the EU Member States may derogate (make an exception) from the sanctions imposed in certain cases and release frozen funds or economic resources, such as when there is a specific need, for humanitarian aid, in relation with arbitral, judicial, or administrative decisions, or in connection with a prior contract.[20]"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    1778,
                    2254,
                    2013
                ],
                "angle": 0,
                "content": "With regard to travel bans, certain exemptions are possible as well—for example, if the Member State is bound by an obligation under international law or the entry is necessary for judicial proceedings.[21] The Member State must inform the Council about any granted exemptions and, in certain cases, Council members can raise objections in writing within two working days of"
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2204,
                    744,
                    2260
                ],
                "angle": 0,
                "content": "12 Decision, art. 5, para. 1."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2277,
                    2238,
                    2382
                ],
                "angle": 0,
                "content": "<sup>13</sup> EU Sanctions Map, EU, https://perma.cc/LJK2-79GH (last updated June 3, 2021); Financial Sanctions Database, European Commission (last updated May 28, 2021), https://perma.cc/G956-2W6L."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2399,
                    1208,
                    2458
                ],
                "angle": 0,
                "content": "14 Regulation art. 14, para. 2; Decision, art. 5, para. 2."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2478,
                    382,
                    2524
                ],
                "angle": 0,
                "content": "15 Id."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2554,
                    795,
                    2607
                ],
                "angle": 0,
                "content": "16 Regulation art. 14, para. 4."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2626,
                    1081,
                    2679
                ],
                "angle": 0,
                "content": "17 Regulation, art. 15; Decision, art. 6, para. 1."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2699,
                    1048,
                    2755
                ],
                "angle": 0,
                "content": "18 Regulation art. 3; Decision art. 2, para. 1."
            },
            {
                "block_id": 14,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2775,
                    657,
                    2828
                ],
                "angle": 0,
                "content": "19 Regulation art. 13."
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2847,
                    540,
                    2897
                ],
                "angle": 0,
                "content": "20 Id. arts. 4-7."
            },
            {
                "block_id": 16,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2923,
                    856,
                    2976
                ],
                "angle": 0,
                "content": "\\(^{21}\\) Decision art. 2, paras. 3-4, 6-7."
            },
            {
                "block_id": 17,
                "type": "list",
                "bbox": [
                    285,
                    2204,
                    2238,
                    2976
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 18,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    2200,
                    3095,
                    2249,
                    3141
                ],
                "angle": 0,
                "content": "11"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    624,
                    151,
                    1917,
                    204
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: European Union"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    283,
                    300,
                    2254,
                    419
                ],
                "angle": 0,
                "content": "receiving notice of the exemption.[22] In such a case, the Council decides by a qualified majority whether the proposed exemption is granted.[23]"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    468,
                    2256,
                    702
                ],
                "angle": 0,
                "content": "Member States must also determine penalties for EU economic operators that do not comply with the sanctions imposed under the sanctions regime.[24] The penalties provided for must be \"effective, proportionate and dissuasive.\"[25] Non-EU operators are not obligated to comply with the sanctions imposed, unless their business is conducted at least partly within the EU.[26]"
            },
            {
                "block_id": 3,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2626,
                    688,
                    2679
                ],
                "angle": 0,
                "content": "22Id.art.2,paras.5,8."
            },
            {
                "block_id": 4,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2702,
                    627,
                    2752
                ],
                "angle": 0,
                "content": "23 Id. art. 2, para. 8."
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2778,
                    663,
                    2824
                ],
                "angle": 0,
                "content": "24 Regulation, art. 19."
            },
            {
                "block_id": 6,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2851,
                    510,
                    2894
                ],
                "angle": 0,
                "content": "25Id.art.16."
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2927,
                    510,
                    2966
                ],
                "angle": 0,
                "content": "26Id.art.19."
            },
            {
                "block_id": 8,
                "type": "list",
                "bbox": [
                    290,
                    2626,
                    688,
                    2966
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    2200,
                    3095,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "12"
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    994,
                    303,
                    1552,
                    392
                ],
                "angle": 0,
                "content": "United Kingdom"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    991,
                    405,
                    1555,
                    521
                ],
                "angle": 0,
                "content": "Clare Feikert-Ahalt Senior Foreign Law Specialist"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    293,
                    660,
                    2259,
                    1366
                ],
                "angle": 0,
                "content": "SUMMARY There is no formal framework in the United Kingdom (UK) to make a determination about a genocide. The government's policy is that competent courts are the only body that can make a determination about a genocide. There are other mechanisms by which genocide may be recognized, such as parliamentary motions, but these are symbolic in nature. The UK recently enacted the Trade Act, which provides for a parliamentary committee to publish a report stating there are credible reports of a genocide committed by a prospective bilateral trade partner. The secretary of state must respond to the report and, if the select committee is not satisfied with the response, the committee may insist on a parliamentary debate and a vote on a motion. The Trade Act does not specify what happens if the secretary of state, or any subsequent motion, agrees with the finding of the report. Because the procedure does not occur in a competent court, it is likely that any such result would be merely symbolic. The impact, if any, it would have on any trade negotiations or treaties is unclear."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    298,
                    1494,
                    645,
                    1547
                ],
                "angle": 0,
                "content": "I. Introduction"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    295,
                    1613,
                    2256,
                    1953
                ],
                "angle": 0,
                "content": "The United Kingdom (UK) is a signatory to the Convention on the Prevention and Punishment of the Crime of Genocide (the Genocide Convention) and thus has an obligation to prevent and punish genocide.<sup>1</sup> The UK has also enacted the International Criminal Court Act 2001, which incorporates the Rome Statute of the International Criminal Court into domestic law and creates a criminal offense of genocide, which has extraterritorial jurisdiction for British citizens and residents.<sup>2</sup>"
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    298,
                    2013,
                    1552,
                    2072
                ],
                "angle": 0,
                "content": "II. Government Policy on Determinations of Genocide"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    295,
                    2128,
                    2256,
                    2356
                ],
                "angle": 0,
                "content": "There is no formal framework for determinations to be made about the fact of a genocide in the UK.\\(^{3}\\) The long-standing policy of the UK government is that genocide can only be determined by a competent court.\\(^{4}\\) Secretary of State for Foreign, Commonwealth and Development Affairs Dominic Raab stated in 2020 that competent courts \"include international courts, such as the"
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2550,
                    2124,
                    2649
                ],
                "angle": 0,
                "content": "<sup>1</sup> Convention on the Prevention and Punishment of the Crime of Genocide, Dec. 9, 1948, 78 U.N.T.S. 277, https://perma.cc/F9CE-J954."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2676,
                    2195,
                    2821
                ],
                "angle": 0,
                "content": "\\(^{2}\\) International Criminal Court Act 2001, c. 17, https://perma.cc/3MWZ-R54C; Rome Statute of the International Criminal Court, July 17, 1998, 2187 U.N.T.S. 3, https://perma.cc/MSW2-8WVB. See also Claire Brader, Genocide: Bringing Perpetrators to Justice, HL Libr. (May 21, 2021), https://perma.cc/2EPS-NXCB."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2847,
                    1647,
                    2894
                ],
                "angle": 0,
                "content": "3 792 Parl. Deb. HL (5th ser.) (2018) col. 2451, https://perma.cc/FH2W-67DF."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    288,
                    2923,
                    1662,
                    2970
                ],
                "angle": 0,
                "content": "4 692 Parl. Deb. HC (6th ed.) (2021) col. 1212, https://perma.cc/W3R4-XNWB."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    285,
                    2550,
                    2195,
                    2970
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "footer",
                "bbox": [
                    298,
                    3095,
                    864,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 13,
                "type": "page_number",
                "bbox": [
                    2203,
                    3095,
                    2249,
                    3141
                ],
                "angle": 0,
                "content": "13"
            }
        ]
    },
    {
        "page_id": 16,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    622,
                    148,
                    1927,
                    207
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: United Kingdom"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    300,
                    2264,
                    419
                ],
                "angle": 0,
                "content": "International Criminal Court,[5] the International Court of Justice, and national criminal courts that meet international standards of due process.[6]"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    465,
                    2256,
                    587
                ],
                "angle": 0,
                "content": "This approach has been criticized by members of parliament (MPs). An MP asserted during debate that"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    433,
                    636,
                    2111,
                    956
                ],
                "angle": 0,
                "content": "it has become clear to all of us that the Government's policy on genocide is untenable. They cannot continue to insist that the determination of genocide is for the courts, knowing that there is no court that can actually hear these cases. The current policy far predates the current Government. We should be honest about this and look beyond party politics. It has become an embarrassment to Ministers. It is patently absurd to insist on this being a matter for courts, which will be blocked from acting.[7]"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    288,
                    1006,
                    1343,
                    1065
                ],
                "angle": 0,
                "content": "The government has defended its approach, noting"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    433,
                    1118,
                    2111,
                    1382
                ],
                "angle": 0,
                "content": "[g]enocide and crimes against humanity are subject to a restrictive legal framework under international law. In particular, a finding of genocide requires proof that relevant acts were carried out with the intent to destroy, in whole or in part, a national, ethnic, racial or religious group. Proving such intent to the required legal standard can be incredibly difficult to achieve in practice.[8]"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    1432,
                    2264,
                    1890
                ],
                "angle": 0,
                "content": "While there is no formal, legal framework for a determination of genocide, there are other mechanisms by which genocide can be recognized in the UK. However, these are largely political and symbolic in nature. The government can recognize genocide through a written or oral statement, or a response to a parliamentary question. A select committee could report that killings were a genocide, and the government response could include its views; an “early day motion” could be laid before parliament stating that killings amount to genocide, or parliament could pass a motion recognizing that killings were a genocide.[9] A parliamentary motion occurred on April 22, 2021, when the House of Commons passed a motion declaring"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    433,
                    1947,
                    2111,
                    2211
                ],
                "angle": 0,
                "content": "[t]hat this House believes that Uyghurs and other ethnic and religious minorities in the Xinjiang Uyghur Autonomous Region are suffering crimes against humanity and genocide; and calls on the Government to act to fulfil its obligations under the Convention on the Prevention and Punishment of Genocide and all relevant instruments of international law to bring it to an end.[10]"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2263,
                    2259,
                    2385
                ],
                "angle": 0,
                "content": "MPs have stated that the motion instructs the government to carry out the duties contained in the Genocide Convention, which are to take reasonable steps to punish and prevent genocide;"
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2451,
                    1218,
                    2501
                ],
                "angle": 0,
                "content": "5 International Criminal Court Act 2001, c. 17, sch. 8."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2527,
                    2210,
                    2630
                ],
                "angle": 0,
                "content": "\\(^{6}\\) Letter from the Rt. Hon. Dominic Raab, MP, Secretary of State for Foreign, Commonwealth & Development Affairs, to the Rt. Hon. Tom Tugendhat, MP, Dec. 8, 2020, https://perma.cc/KG9E-2J9P."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2653,
                    818,
                    2699
                ],
                "angle": 0,
                "content": "7 692 Parl. Deb. HC, col. 1214."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2725,
                    540,
                    2772
                ],
                "angle": 0,
                "content": "\\(^{8}\\) Id. col. 1245."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2798,
                    2198,
                    2904
                ],
                "angle": 0,
                "content": "9 Arabella Lang & Ben Smith, Briefing Paper CBP 7561, Declaring Daesh Massacres 'Genocide' 9, HC Libr. (Apr. 15, 2016), https://perma.cc/P4KD-45JR."
            },
            {
                "block_id": 14,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2923,
                    828,
                    2973
                ],
                "angle": 0,
                "content": "10 692 Parl. Deb. HC, col. 1246."
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    285,
                    2451,
                    2210,
                    2973
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    872,
                    3154
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    2200,
                    3098,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "14"
            }
        ]
    },
    {
        "page_id": 17,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    624,
                    151,
                    1922,
                    204
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: United Kingdom"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    283,
                    300,
                    2264,
                    646
                ],
                "angle": 0,
                "content": "however, the motion is considered largely symbolic.[11] Foreign Secretary Raab was asked by the House of Lords Select Committee on International Relations and Defence whether he would accept this motion from the House of Commons. He responded: \"Parliament should hold the executive to account on all these matters. That has been our position all along. Our long-standing position is that a court should make judgments on genocide. Fundamentally, genocide creates obligation at the state level.\"[12]"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    288,
                    696,
                    1048,
                    759
                ],
                "angle": 0,
                "content": "III. Laws Recognizing Genocide"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    811,
                    2264,
                    1382
                ],
                "angle": 0,
                "content": "On April 29, 2021, the UK enacted the Trade Act. This Act includes a process for a parliamentary committee to investigate credible reports of genocide in the territory of a country with which the UK has entered into formal negotiations for a bilateral free trade agreement.[13] The process involves multiple steps. The first is for the relevant committee in the House of Commons to publish a report stating credible reports of genocide exist. The secretary of state is then required to respond in writing to the committee. If the committee is not satisfied by the response, it may insist on a parliamentary debate and vote on a motion. A similar process is provided for in the House of Lords if a committee in the Lords publishes a report stating credible reports of genocide exist. The term genocide used in the Trade Act has the same meaning as article 2 of the Genocide Convention.[14]"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1438,
                    2256,
                    1788
                ],
                "angle": 0,
                "content": "The result of any findings, statements or motions from this process is not clear, as the implications for continuing negotiations with any country determined to have committed genocide in accordance with this process are not specified in the Trade Act. As the committee that reviews the evidence, or the secretary of state who responds, is not a competent court, the actions do not meet the threshold set by the UK government that genocide must be determined by a competent court."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    288,
                    1838,
                    930,
                    1897
                ],
                "angle": 0,
                "content": "IV. Responses to Genocide"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    1953,
                    2256,
                    2187
                ],
                "angle": 0,
                "content": "Where a determination of genocide has been made by a competent court, the UK may take action to \"prevent and punish\" such conduct in accordance with the terms of the Genocide Convention.[15] Criminal actions may be taken in the domestic criminal courts against British citizens and residents who have committed acts of genocide overseas.[16]"
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2501,
                    670,
                    2554
                ],
                "angle": 0,
                "content": "11 Id. cols. 1233, 1241."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2574,
                    1685,
                    2633
                ],
                "angle": 0,
                "content": "12 812 Parl. Deb. HL (5th ser.) (2021) col. 167GC, https://perma.cc/3U4E-EQ82."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2653,
                    1341,
                    2706
                ],
                "angle": 0,
                "content": "\\(^{13}\\) Trade Act 2021, c. 10, § 3, https://perma.cc/2ZG4-HPAS."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2725,
                    385,
                    2772
                ],
                "angle": 0,
                "content": "14 Id."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2801,
                    2215,
                    2904
                ],
                "angle": 0,
                "content": "15 Convention on the Prevention and Punishment of the Crime of Genocide, supra note 1. See also Huma Haider, International Legal Frameworks for Humanitarian Action, GSDRC (2013), https://perma.cc/5HPG-4RC5."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    290,
                    2923,
                    1188,
                    2976
                ],
                "angle": 0,
                "content": "16 International Criminal Court Act 2001, c. 17 § 53."
            },
            {
                "block_id": 13,
                "type": "list",
                "bbox": [
                    285,
                    2501,
                    2215,
                    2976
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 14,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    869,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    2200,
                    3095,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "15"
            }
        ]
    },
    {
        "page_id": 18,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    622,
                    148,
                    1927,
                    207
                ],
                "angle": 0,
                "content": "Legal Mechanisms for Genocide Determinations: United Kingdom"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    283,
                    300,
                    2261,
                    933
                ],
                "angle": 0,
                "content": "The UK has also amended its domestic legislation to introduce elements modeled after the United States's Magnitsky Act.[17] The Proceeds of Crime Act 2002 was amended to include gross human rights abuses or violations in the definition of unlawful conduct and applies the provisions with extraterritorial application, enabling the UK to undertake a variety of actions relating to the proceeds of a crime, such as recovering or freezing them.[18] The Sanctions and Anti-Money Laundering Act 2018 also include Magnitsky elements, enabling the UK to impose sanctions, including financial, trade, and immigration sanctions, against individuals or entities that have engaged in gross human rights abuses or violations.[19] The House of Lords noted that, while the government deserves credit for introducing these provisions, the \"sanctions are not a response to genocide . . . [and] the sanctions regime is too opaque and liable to be used against soft targets rather than the worst villains.\"[20]"
            },
            {
                "block_id": 2,
                "type": "page_footnote",
                "bbox": [
                    283,
                    2649,
                    2108,
                    2758
                ],
                "angle": 0,
                "content": "<sup>17</sup> Ben Smith & Joanna Dawson, Briefing Paper CBP 8374, Magnitsky Legislation, HC Libr. (July 13, 2020), https://perma.cc/4WYY-L932."
            },
            {
                "block_id": 3,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2768,
                    1828,
                    2831
                ],
                "angle": 0,
                "content": "<sup>18</sup> Proceeds of Crime Act 2002, c. §§ 241, 241A, and pt. 5, https://perma.cc/E9U9-L9B5."
            },
            {
                "block_id": 4,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2841,
                    1920,
                    2904
                ],
                "angle": 0,
                "content": "19 Sanctions and Anti-Money Laundering Act 2018, c. 13 § 1, https://perma.cc/3XGD-TNAJ."
            },
            {
                "block_id": 5,
                "type": "page_footnote",
                "bbox": [
                    293,
                    2917,
                    867,
                    2976
                ],
                "angle": 0,
                "content": "20 812 Parl. Deb. HL, col. 167GC."
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    283,
                    2649,
                    2108,
                    2976
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    290,
                    3095,
                    872,
                    3154
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 8,
                "type": "page_number",
                "bbox": [
                    2200,
                    3095,
                    2254,
                    3141
                ],
                "angle": 0,
                "content": "16"
            }
        ]
    }
]