[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    290,
                    310,
                    520,
                    491
                ],
                "angle": 0,
                "content": "LAW"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    290,
                    495,
                    724,
                    669
                ],
                "angle": 0,
                "content": "LIBRARY"
            },
            {
                "block_id": 2,
                "type": "header",
                "bbox": [
                    293,
                    673,
                    721,
                    712
                ],
                "angle": 0,
                "content": "LIBRARY OF CONGRESS"
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    497,
                    1128,
                    2032,
                    1386
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1093,
                    1448,
                    1456,
                    1521
                ],
                "angle": 0,
                "content": "August 2023"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1025,
                    2580,
                    1519,
                    2626
                ],
                "angle": 0,
                "content": "LL File No. 2023-022541"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1068,
                    2633,
                    1479,
                    2679
                ],
                "angle": 0,
                "content": "LRA-D-PUB-002627"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    645,
                    3039,
                    1904,
                    3095
                ],
                "angle": 0,
                "content": "The Law Library of Congress, Global Legal Research Directorate"
            },
            {
                "block_id": 8,
                "type": "footer",
                "bbox": [
                    757,
                    3095,
                    1792,
                    3151
                ],
                "angle": 0,
                "content": "(202) 707-5080 \\(\\cdot\\) law@loc.gov \\(\\cdot\\) http://www.law.gov"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    578,
                    1455,
                    1963,
                    1765
                ],
                "angle": 0,
                "content": "This report is provided for reference purposes only. It does not constitute legal advice and does not represent the official opinion of the United States Government. The information provided reflects research undertaken as of the date of writing. It has not been updated."
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    290,
                    303,
                    563,
                    369
                ],
                "angle": 0,
                "content": "Contents"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    293,
                    495,
                    2254,
                    554
                ],
                "angle": 0,
                "content": "Comparative Summary 1"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    293,
                    610,
                    2254,
                    666
                ],
                "angle": 0,
                "content": "Jurisdictional Table 4"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    293,
                    726,
                    2254,
                    778
                ],
                "angle": 0,
                "content": "International Organizations Table 22"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    892,
                    303,
                    1652,
                    392
                ],
                "angle": 0,
                "content": "Comparative Summary"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    1055,
                    409,
                    1489,
                    524
                ],
                "angle": 0,
                "content": "Kayahan Cantekin  \nForeign Law Specialist"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    298,
                    643,
                    650,
                    702
                ],
                "angle": 0,
                "content": "I. Introduction"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    293,
                    765,
                    2254,
                    1221
                ],
                "angle": 0,
                "content": "This report, prepared by the research staff of the Law Library of Congress, provides a list of jurisdictions in the world where legislation that specifically refers to artificial intelligence (AI) or systems utilizing AI have been adopted or proposed. Researchers of the Law Library surveyed all jurisdictions in their research portfolios to find such legislation, and those encountered have been compiled in the annexed list with citations and brief descriptions of the relevant legislation. Only adopted or proposed instruments that have legal effect are reported for national and subnational jurisdictions and the European Union (EU); guidance or policy documents that have no legal effect are not included for these jurisdictions."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    298,
                    1277,
                    2249,
                    1392
                ],
                "angle": 0,
                "content": "Major international organizations have also been surveyed and documents adopted or proposed by these organizations that specifically refer to AI are reported in the list."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    298,
                    1455,
                    515,
                    1518
                ],
                "angle": 0,
                "content": "II. Scope"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    298,
                    1574,
                    2249,
                    1745
                ],
                "angle": 0,
                "content": "The list only includes adopted or proposed legislation (and documents for international organizations) that specifically refers to AI. Binding decisions of regulatory agencies and relevant case law that specifically refers to AI are also included where encountered."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    295,
                    1801,
                    2254,
                    2148
                ],
                "angle": 0,
                "content": "While various rules that do not specifically refer to AI in diverse areas of the law such as intellectual property, civil and administrative procedure, criminal law, and data protection and data security law are presumably applicable to the utilization of AI systems in the relevant regulated fields, the limitation of the scope of the list to specific references prevents the list from being overinclusive or underinclusive, given that the extent to which the legacy legal frameworks apply to novel uses of AI may not yet be sufficiently or clearly determined in many jurisdictions."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    295,
                    2204,
                    2254,
                    2488
                ],
                "angle": 0,
                "content": "Nevertheless, the role of existing personal data protection frameworks in the regulation of processes utilizing AI appears to be particularly significant. Provisions governing automated decision making that are frequently incorporated in personal data protection laws are likely to be applicable in cases where AI systems are used to make decisions producing legal effects for individuals, although these provisions typically do not refer to AI specifically."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    295,
                    2541,
                    2254,
                    2943
                ],
                "angle": 0,
                "content": "In the EU, article 22 of the General Data Protection Regulation (GDPR) regulates automated decision making and profiling with regard to individuals. The GDPR is directly applicable and binding for all European Union member states; however, member states have adopted national legislation that is compliant with the GDPR that may include parallel provisions regarding automated decision making. Such national legislation, where the laws do not specifically refer to AI, are accordingly left out of the list. Only the GDPR itself, with its full citation and a brief description of its relevant article 22, is provided in the list's entry for the European Union."
            },
            {
                "block_id": 10,
                "type": "footer",
                "bbox": [
                    298,
                    3095,
                    867,
                    3151
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    2226,
                    3105,
                    2249,
                    3141
                ],
                "angle": 0,
                "content": "1"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    504,
                    155,
                    2040,
                    204
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Comparative Summary"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    298,
                    300,
                    2249,
                    518
                ],
                "angle": 0,
                "content": "National personal data protection legislation that include provisions governing automated decision making in non-EU jurisdictions, such as data protection laws in Turkey or the United Kingdom, its territories, and British crown dependencies, are for the same reason left out of the list."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    298,
                    584,
                    2249,
                    808
                ],
                "angle": 0,
                "content": "Also significant in this context is the Council of Europe (CoE) 1981 Convention for the Protection of Individuals with Regard to Automatic Processing of Personal Data, which entered into force in 1985 and is the first international treaty on personal data protection. The convention and its proposed protocol, which has not entered into force yet, are also cited in the list."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    298,
                    874,
                    599,
                    937
                ],
                "angle": 0,
                "content": "III. Findings"
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    298,
                    996,
                    1213,
                    1049
                ],
                "angle": 0,
                "content": "A. National and Sub-National Jurisdictions"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    298,
                    1098,
                    2249,
                    1438
                ],
                "angle": 0,
                "content": "The survey found adopted legislation that specifically refers to AI in the following national and sub-national jurisdictions: Argentina, Belarus, China, Denmark, Egypt, Estonia, Finland, Greece, Hungary, Iceland, Kazakhstan, Kyrgyzstan, Lithuania, Macau, Mauritius, Norway, Peru, Poland, Portugal, Qatar, the Republic of Ireland, the Russian Federation, Saudi Arabia, Serbia, the Slovak Republic, Spain, Sweden, Taiwan, the United Arab Emirates, the United Kingdom, and Uzbekistan."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    298,
                    1501,
                    2249,
                    1725
                ],
                "angle": 0,
                "content": "Legislation referring to AI has been proposed and is at various stages of the legislative process in the following national jurisdictions: Argentina, Belgium, Brazil, Canada, Chile, Colombia, Costa Rica, Israel, Mexico, Panama, the Philippines, South Korea, Thailand, and the United Kingdom."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    298,
                    1782,
                    2249,
                    2296
                ],
                "angle": 0,
                "content": "The scope of the legislation that has been found in our survey varies greatly among jurisdictions. Some laws, for example, those adopted in Argentina, Belarus, Egypt, Iceland, Kazakhstan, Peru, Portugal, Qatar, the Republic of Ireland, the Russian Federation, Saudi Arabia, Serbia, Uzbekistan, and legislation proposed in Brazil, Chile, China, Colombia, Costa Rica, Israel, Mexico, Panama, the Philippines, Taiwan, and Thailand, provide for general frameworks, such as those governing the development and commercialization of AI systems, laying down ethics and fundamental rights principles applicable to development and utilization of AI, or establishing regulatory or advisory government bodies that will oversee the advances and proliferation of the technology."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    298,
                    2352,
                    2249,
                    2752
                ],
                "angle": 0,
                "content": "Other laws govern specific applications of AI systems, for example, in regard to payment systems, employment-related decision making by public or private actors, self-driving road vehicles, illegal online content, text or image generation, and speech-signal processing. Such legislation has been enacted in jurisdictions such as China, Estonia, Greece, Hungary, Lithuania, Poland, the United Arab Emirates, the United Kingdom, and Uzbekistan, and it has been proposed in Kyrgyzstan. Some of these laws establish registration or licensing requirements for certain applications of AI, such as rules adopted in Greece and Mauritius, and a bill proposed in Canada."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    298,
                    2808,
                    2249,
                    2979
                ],
                "angle": 0,
                "content": "Some jurisdictions have adopted laws that specifically relate to the use of decision making by public bodies and impose measures to ensure transparency and prevent bias, some of which require impact assessments to be filed for systems used by public administrators or the"
            },
            {
                "block_id": 10,
                "type": "footer",
                "bbox": [
                    298,
                    3095,
                    864,
                    3148
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    2226,
                    3105,
                    2249,
                    3138
                ],
                "angle": 0,
                "content": "2"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    504,
                    155,
                    2040,
                    204
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Comparative Summary"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    298,
                    300,
                    2261,
                    696
                ],
                "angle": 0,
                "content": "registration of systems. Such legislation is enacted, for example, in Greece, Finland, Norway, Spain, and Sweden, and it is proposed in Belgium. The survey also found legislation that relates to AI in other contexts, such as a law enacted in the United Kingdom that authorizes the government to intervene in acquisitions of companies developing AI that could harm the national security, a law enacted in Macau that provides tax benefits to companies engaging in AI-related innovation, and laws proposed in Chile that specifically criminalize use of AI in the commission of certain types of fraud."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    298,
                    759,
                    1397,
                    811
                ],
                "angle": 0,
                "content": "B. European Union and International Organizations"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    298,
                    864,
                    2261,
                    1148
                ],
                "angle": 0,
                "content": "In the EU, a proposal for a regulation that incorporates transparency rules for low-risk AI systems and prohibitions and mandatory requirements for certain high-risk ones was introduced in 2021. In addition, last year, a directive establishing uniform rules for certain aspects of noncontractual civil liability for damage caused by AI systems was introduced. EU regulations are directly applicable in EU member states, whereas directives have to be transposed into national law."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    298,
                    1207,
                    2261,
                    1432
                ],
                "angle": 0,
                "content": "With regard to international organizations, our survey found that documents specifically referring to AI have been adopted by the CoE, North Atlantic Treaty Organization (NATO), OECD, and various bodies, organs, and specialized agencies of the United Nations (UN) such as UNESCO and the International Telecommunication Union (ITU)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    298,
                    1491,
                    2261,
                    2003
                ],
                "angle": 0,
                "content": "In 2018, the CoE opened to signature a protocol to its 1981 Convention for the Protection of Individuals with regard to Automatic Processing of Personal Data that modernizes the convention and incorporates amendments establishing the right of an individual to have his or her views considered when being subjected to certain decisions based solely on automated processing of data. The protocol is not yet in force. Recently at the CoE, a proposal was made for a common framework convention for the design, development, and application of AI systems throughout their life cycle that would cover uses by both public or private actors, with the exclusion of uses related to national defense. This proposed framework convention takes a risk-based approach to AI systems, similar to the proposed EU regulation."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    298,
                    2059,
                    2261,
                    2286
                ],
                "angle": 0,
                "content": "NATO adopted an Artificial Intelligence Strategy in 2021, laying down strategy points for NATO members and their allies and establishing principles of responsible use. Another NATO document establishes a Data and Artificial Intelligence Review Board responsible for the implementation of such principles."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    298,
                    2346,
                    2261,
                    2458
                ],
                "angle": 0,
                "content": "The OECD adopted a Recommendation on AI that provides principles on responsible stewardship of AI and recommendations for their implementation."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    298,
                    2517,
                    2261,
                    2854
                ],
                "angle": 0,
                "content": "Within the UN System, the UN Secretary-General issued a report providing a road map for implementing the recommendations of the High-level Panel on Digital Cooperation convened by the secretary-general, which refers to certain aspects of AI-related policymaking and governance. In 2021, UNESCO adopted a recommendation covering a selection of areas for policy action and including monitoring and evaluation standards. In 2022, the ITU published a report on the UN's activities on AI."
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    298,
                    3095,
                    867,
                    3148
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    2223,
                    3102,
                    2249,
                    3141
                ],
                "angle": 0,
                "content": "3"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1764,
                    303,
                    2427,
                    387
                ],
                "angle": 0,
                "content": "Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    281,
                    520,
                    3910,
                    2062
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td>Argentina</td><td>Yes</td><td>Yes</td><td>Marco Legal para la Regulación del Desarrollo y uso de laintelligence Artificial (Proyecto de ley), June 8, 2023, https://perma.cc/PDY6-2JMY.Ley de Regulación y Uso de la Inteligencia Artificial en la Educación (Proyecto de ley), June 8, 2023, https://perma.cc/3958-YQDS.Modificación Ley Nacional 25.467 (Proyecto de ley), Apr. 17, 2023, https://perma.cc/39K5-RSC7.Disposión No. 2 Anexo I, June 2, 2023, [DI-2023-2-APN-SSTI#JGM], Boletin Oficial [B.O.] 35182 (Arg.), https://perma.cc/SX6Z-E3UZ.</td><td>Establishes the legal framework for research, development, use, and regulation of artificial intelligence in Argentina to protect human rights, privacy rights, and national security. Establishes regulations and guidelines for the development and use of artificial intelligence in education. It applies to all type of educational or education-related organizations/institutions in the public and private sector.Incorporates art. 3 bis, art. 8 bis, and art. 8 ter to Law 25.467. It establishes principles for the ethical functioning of artificial intelligence (art. 3 bis), stipulates the registration of artificial intelligence systems (art. 8 bis), and incorporates the ability to file complaints with the SETCIP for anyone affected by these systems (art. 8 ter). Approves the Recommendations for a reliable use of artificial intelligence. (Note: The Recommendations have no legal force).</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3872,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "4"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1365,
                    147,
                    2830,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td>Belarus</td><td>Yes</td><td>No</td><td>Decree of the President of Belarus No. 8 on Development of the Digital Economy, Dec. 17, 2017, https://perma.cc/CK79-QPU8 (in Russian). Resolution of Council of Ministers of Belarus No. 438 on the List of State Programs of Scientific Research for 2021-2025, July 28, 2020, https://perma.cc/23V9-5KFA (in Russian).</td><td>The decree introduced the special legal regime of the Park of High Technologies (PHT) with the right to carry out activity in the sphere of artificial intelligence. (Id. art. 1.) PHT was created to attract more legal residents who are engaged in artificial intelligence and the training of cars.The resolution establishes the objective of achieving global benchmarks in digital transformation within the country, particularly in the fields of economy, robotics and artificial intelligence, public administration, and the utilization of digital technologies for scientific research.</td></tr><tr><td>Belgium</td><td>No</td><td>Yes</td><td>Proposition de Loi modifiant la loi relative à la publicité de l&#x27;administration du 11 avril 1994 afin d&#x27;introduire une plus grande transparence dans l&#x27;usage des algorithms par les administrations, 1904/001, DOC 55, Apr. 6, 2021, https://perma.cc/HMX9-CVTS.</td><td>The proposed law aims to improve transparency in the use of AI systems by public administrations, particularly when they are used to make administrative decisions.</td></tr><tr><td>Brazil</td><td>No</td><td>Yes</td><td>Câmara dos Deputados, PL 21/2020, https://perma.cc/Y7BE-KQNS.Senado Federal, PL 2338/2023, https://perma.cc/3BHV-FQBN.</td><td>Establishes foundations, principles and guidelines for the development and application of artificial intelligence in Brazil.Provides for the use of artificial intelligence.</td></tr><tr><td>Canada</td><td>No</td><td>Yes</td><td>Bill C-27 An Act to Enact the Consumer Privacy Protection Act, the Personal Information and Data</td><td>The proposed legislation AIDA would impose certain obligations concerning the design, development, and use of AI systems and</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3872,
                    2351,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "5"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1365,
                    147,
                    2830,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>Protection Tribunal Act, and the Artificial Intelligence and Data Act (AIDA), and to Make Consequential and Related Amendments to Other Acts, https://perma.cc/J2BZ-5EX4.</td><td>their associated harms, including requiring an assessment of whether a system is high impact, record keeping, and publication of certain information on AI systems, among other obligations.</td></tr><tr><td rowspan=\"4\">Chile</td><td rowspan=\"4\">No</td><td rowspan=\"4\">Yes</td><td>Boletín 15869-19 (Proyecto de ley), Apr. 24, 2023, https://perma.cc/E5PP-792M.</td><td>Establishes a legal framework for the development, commercialization, distribution, and use of artificial intelligence to protect fundamental rights in Chile.</td></tr><tr><td>Boletín 15935-07 (Proyecto de ley), May 15, 2023, https://perma.cc/TLQ6-3A7R.</td><td>Replaces art. 468 of the Chilean Criminal Code to include the use of artificial intelligence in frauds as a crime.</td></tr><tr><td>Boletín 16021-07 (Proyecto de ley), June 13, 2023, https://perma.cc/G8UH-T44R.</td><td>Incorporates para. 23 in art. 12 of the Chilean Criminal Code. It specifies that the use of artificial intelligence to commit a crime is an aggravating circumstance.</td></tr><tr><td>Boletín 16112-07 (Proyecto de ley), July 17, 2023, https://perma.cc/EA9X-WFGD.</td><td>Substitutes art. 214 of the Chilean Criminal Code. It modifies the crime of identity theft to include the context of artificial intelligence.</td></tr><tr><td>China</td><td>Yes</td><td>Yes</td><td>Cyberspace Administration of China, Interim Measures for the Management of Generative AI Services (July 10, 2023), https://perma.cc/RV8G-9RRE (in Chinese), https://perma.cc/7THZ-FF43 (unofficial English translation).</td><td>The measures regulate the use of generative AI technology to provide services that generate any text, image, audio, video, or other such content to the public within mainland China. &quot;Generative AI technology&quot; refers to &quot;models and related technology that have the ability to generate text, image, audio, videos, or other such content.&quot;</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3872,
                    2353,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "6"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2246
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>2023 Legislative Work Plan of the State Council (May 31, 2023), https://perma.cc/H9XX-J7SY (in Chinese).</td><td>China&#x27;s State Council is drafting a comprehensive national AI Law, a copy of which has not been released.</td></tr><tr><td>Colombia</td><td>No</td><td>Yes</td><td>Proyecto de Ley No. 059, Aug. 1, 2023, https://perma.cc/JZAY-KY2F.</td><td>Establishes the guidelines of public policy for the development, use, and implementation of artificial intelligence.</td></tr><tr><td>Costa Rica</td><td>No</td><td>Yes</td><td>Proyecto de Ley No. 23.771, May 30, 2023, https://perma.cc/PUJ2-K86K.</td><td>Regulates the development, implementation, and use of artificial intelligence in Costa Rica.</td></tr><tr><td>Egypt</td><td>Yes</td><td>No</td><td>Prime Ministerial Resolution No. 2889 of 2019 on the establishment of the National Council of the Artificial Intelligence, al-Jaridah al-Rasmiyah (Official Gazette), vol. 47 duplicate, 24 November 2019, https://perma.cc/3ZQW-LTR6.</td><td>The resolution defines the mission, objectives, functions and structure of the National Council of the Artificial Intelligence. The council has the power to issue guidelines on the usage of artificial intelligence and prohibitions related to such usage.</td></tr><tr><td>Estonia</td><td>Yes</td><td>No</td><td>Code of Civil Procedure § 4892 (Passed Apr. 20, 2005, RT I 2005, 26, 197, https://perma.cc/3ND6-HMZX (in Estonian).</td><td>These provisions allow for the validity and acceptance in civil procedures of machine-generated documents related to ordering and processing payments if these documents meet the requirements for standard e-documents and can be verified in an automated manner.</td></tr><tr><td>European Union</td><td>Yes</td><td>Yes</td><td>General Data Protection Regulation (GDPR), art. 22, 2016 O.J. (L 119) 1, https://perma.cc/7Y47-L7XX.</td><td>Article 22 of the GDPR specifically addresses profiling and automated individual decision-making. It prohibits decisions based solely on automated processing, including profiling, which produce legal effects concerning the data subject or similarly significantly affects him or her, with exceptions. “Solely” means that the decision is totally automated and there is no human</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3872,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "7"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1365,
                    147,
                    2830,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2215
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>Proposal for a Regulation of the European Parliament and of the Council Laying Down Harmonised Rules on Artificial Intelligence (Artificial Intelligence Act) and Amending Certain Union Legislative Acts, COM (2021) 206 final (Apr. 21, 2021), https://perma.cc/RWT9-9D97.Proposal for a Directive of the European Parliament and of the Council on Adapting Non-contractual Civil Liability Rules to Artificial Intelligence (AI Liability Directive), COM (2022) 496 final (Sept. 28, 2022), https://perma.cc/SR7R-SLKJ.</td><td>review. “Legal or similarly significant effects” means that the decision affects a person&#x27;s legal status or rights or it is something that has an equivalent impact on an individual&#x27;s circumstances, behavior, choices, or leads to exclusion/discrimination of the individual. Examples are social benefits, voting, online, credit applications, or university admissions.The proposed AI Act addresses the risks posed by AI systems to the safety or fundamental rights of citizens by following a risk-based approach ranging from complete prohibition or mandatory requirements for certain high-risk AI systems to transparency rules or voluntary compliance with the rules for low-risk AI systems. The AI Act as an EU regulation would be directly applicable in the EU member states once it enters into force, which is expected by the end of 2023.The proposed AI Liability Directive would establish uniform rules for certain aspects of noncontractual civil liability for damage caused by AI systems, where such claims are brought under fault-based liability regimes. Among other things, it would regulate the burden of proof and disclosure of evidence, and it would create rebuttable presumptions of noncompliance and causation. As a directive, the AI Liability Directive would have to be transposed into national law by the EU Member States.</td></tr><tr><td>Finland</td><td>Yes</td><td>No</td><td>Chapter 8b of the Administrative Law (Hallintolaki (6.6.2003/434), https://perma.cc/T3JZ-6GQ7 (in</td><td>The law allows government agencies to use automated decision making.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3872,
                    2351,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "8"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>Finnish); Förvalningslag, https://perma.cc/ERF6-PRX2 (in Swedish) (automated decision making amendment entered into force in 2023: Hallituksen esitys (HE) 145/2022 vp, https://perma.cc/HW9P-5WPH (in Finnish)).</td><td>In addition, EU law applies. For AI and the EU, see EU entry.</td></tr><tr><td>Greece</td><td>Yes</td><td>No</td><td>Law 4961/2022 on Emerging Information and Communication Technologies, Strengthening Digital Governance, and Other Provisions, E.K.E.D. 2022, A:146, as amended by Law 5039/2023, E.K.E.D. 2023, A:83, https://perma.cc/R4GT-FCJQ (in Greek).</td><td>Chapter B of this law incorporates provisions requiring public sector bodies using AI systems for making decisions to undertake an algorithmic impact assessment before using the system and implement transparency-related measures. Private actors that use AI systems for making employment-related decisions are also subject to transparency requirements. The law establishes an inter-ministerial Steering Committee on AI and a supervisory committee for national strategy for the development of AI under the Ministry of Digital Governance to act as an executive body for the Steering Committee.</td></tr><tr><td rowspan=\"2\">Hungary</td><td rowspan=\"2\">Yes</td><td rowspan=\"2\">No</td><td>2014 Law LXXVI on Scientific Research, Development and Innovation, art. 4g, https://perma.cc/QW7L-KTWD (in Hungarian).</td><td>Requires the government to take measures to create open scientific digital data files and data warehouses to complete research, development, and innovation tasks of national economic importance, with particular regard to dissemination of artificial intelligence.</td></tr><tr><td>Government Decree 451/2016 on Detailed Rules for Electronic Administration, arts. 7/B(4), 68/B(k),(l),(m), &amp; 134/I-L, https://perma.cc/Z64T-D996 (in Hungarian).</td><td>Regulates the usage of AI-supported services within electronic administrative processes, including converting text to speech, speech to text, and using an AI communication assistant. The involvement of human interaction, the validation of electronic</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3872,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "9"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1365,
                    150,
                    2830,
                    206
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>Hungary Data Protection Authority, Decision on Application of the AI-Based Speech-Signal Processing Technology, Reported Apr. 7, 2022, https://perma.cc/D2JK-4G4J.</td><td>signatures, and the obligation to provide written documents when required are also emphasized.The National data protection agency of Hungary (NAIH) imposed a fine equal to EUR 676,000 on a bank due to deficiencies in its AI based evaluation of customer service call recordings. This evaluation encompassed aspects such as gauging the speaker&#x27;s emotional condition and other traits. The bank claimed that it used this information to avert grievances, assess work quality, and enhance the productivity of their call-handling personnel. The NAIH stated that a “freely and actively given informed consent” is required for data processing operations.</td></tr><tr><td>Iceland</td><td>Yes</td><td>No</td><td>Electronic Communications Office of Iceland Act 12 § (Lög um Fjarskiptastofu (2021 nr. 75 25. júni), https://perma.cc/C7HC-TXP7 (in Icelandic).</td><td>Specifies the role of the Electronic Communications Office of Iceland in relation to artificial intelligence, specifically listing that it must monitor the development of and develop the technical abilities to face challenges related to artificial intelligence.</td></tr><tr><td>Ireland</td><td>Yes</td><td>No</td><td>European Union (Open Data and Re-Use of Public Sector Information) Regulations 2021, SI 376/2021, https://perma.cc/M9UM-UBDD.Statistics (Information and Communication Technologies Survey) Order 2021, SI 94/2021, https://perma.cc/S98H-FT24.See also European Union entry.</td><td>The European Union (Open Data and Re-Use of Public Sector Information) Regulations 2021 gives effect to Directive (EU) 2019/1024 and aims to help stimulate digital innovation, particularly with regard to AI.The Statistics (Information and Communication Technologies Survey) Order 2021 gives effect to article 6(2) of Regulation (EU) 2019/2152 and requires undertakings covered by the order to respond to a survey conducted by the Central Statistics Office and</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "10"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td></td><td>include information about the general use of AI, along with other topics, in relation to the years 2021-2025.</td></tr><tr><td>Israel</td><td>No</td><td>Yes</td><td>Regulatory Policy and Ethics in the Field of Artificial Intelligence in Israel, Ministry of Innovation, Science and Technology (Oct. 30, 2022), https://perma.cc/95JR-PZYL.</td><td>Former Minister of Innovation, Science and Technology published draft guidelines for public comments on regulation and ethical policies for the development and use of artificial intelligence. The main policy principles proposed include the use of “soft” regulation tools instead of legislation of a broad framework, the adoption of ethical principles similar to what is accepted around the world, the formulation of a risk management tool for the regulator, and the establishment of a dedicated knowledge center within the government.</td></tr><tr><td>Kazakhstan</td><td>Yes</td><td>No</td><td>Decree of the President No. 674 on Approval of the Concept for a Legal Policy of the RK until 2030, Oct. 15, 2021, https://perma.cc/V34F-GVW3 (in Russian).</td><td>Chapter 4 introduced the public policy guideline for the development and implementation of innovative digital technologies. Section 4.13 requires improvements in the regulation of the field of information and communication technologies, digital assets, machine learning and artificial intelligence, industrial automation, and information security. (Id. ch. 4, sec. 4.13.)</td></tr><tr><td>Kyrgyzstan</td><td>No</td><td>Yes</td><td>The Draft Digital Code of the Kyrgyz Republic, submitted for public discussion on Aug. 5, 2023, Ministry of Digital Development of the Kyrgyz Republic, https://perma.cc/23QY-WNNU (in Russian).</td><td>The Draft Code aims at creating a unified regulatory system for digital technologies. Digital assets, artificial intelligence, robotics, and blockchain are listed in the code as modern innovative solutions. Chapter 23 of the draft code specifies the principles of design, development, and application of artificial intelligence systems; provides for limitations and responsibilities; and</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "11"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2830,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2170
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td></td><td>establishes requirements for designating AI models as high-risk systems. (Id. arts. 187-194.) The code combines provisions presently found in all pieces of technology related legislation.</td></tr><tr><td>Lithuania</td><td>Yes</td><td>No</td><td>Law No. VIII - 2043 on Road Traffic Safety (Passed Dec. 10, 2000, arts. 2, 10, 13, 20, &amp; 25, https://perma.cc/VEQ6-G82K.</td><td>The law permits the use of self-driving cars in public traffic without human intervention. Direct or remote control of autonomous cars by a person is allowed if such a possibility has been foreseen by the car manufacturer.</td></tr><tr><td>Macau</td><td>Yes</td><td>No</td><td>Law No. 1/2021, Tax Benefits Regime for Companies Engaged in Scientific and Technological Innovation Activities (Feb. 1, 2021) art. 2, https://perma.cc/M4VB-D6V4 (in Chinese).</td><td>Providing tax benefits to companies that engage in scientific and technological innovation activities, particularly in areas including next-generation information technology and AI.</td></tr><tr><td>Mauritius</td><td>Yes</td><td>No</td><td>Financial Services (Robotic and Artificial Intelligence Enabled Advisory Services) Rules 2021 (June 12, 2021), https://perma.cc/B6WV-X8ZD.</td><td>Section 2 defines the term robotic and artificial intelligence enabled advisory services (RAIEAS) as “the provision of digital and personalised advisory services through a computer program and/or artificial intelligence enabled algorithms with limited human intervention.”Section 4 requires that any person who engages in RAIEAS first obtain a RAIEAS license from the Financial Services Commission.Section 5 mandates that a licensee must always:(a) have its principal bank account in Mauritius;</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "12"
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    281,
                    290,
                    3906,
                    2203
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td></td><td>(b) establish an office and relevant infrastructure for the carrying out of its Robotic and Artificial Intelligence Enabled Advisory Services in Mauritius; \n(c) implement adequate internal controls, risk management (including cyber risk management), as well as, governance policies and procedures; \n(d) put in place a business continuity and disaster recovery plan; \n(e) preserve the integrity and privacy of its clients&#x27; information in conformity with the applicable Data Protection Laws of Mauritius; \n(f) be managed by a board of directors consisting of a minimum of three directors, one of whom shall be an independent director and a resident of Mauritius; \n(g) employ an adequate number of officers with adequate competence, experience and proficiency, and commensurate with the size, nature and complexity of its services; and \n(h) have in place such code of conduct and ethics which shall be binding on its officers in relation to the provision of its services.</td></tr><tr><td></td><td></td><td></td><td></td><td>Sections 6 and 7 set the minimum amounts of capital and indemnity insurance a licensee must maintain.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "13"
            }
        ]
    },
    {
        "page_id": 16,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2142
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td>Mexico</td><td>No</td><td>Yes</td><td>Iniciativa con Proyecto de Decreto por el Que Se Expide la Ley para la Regulación Ética de la Inteligencia Artificial y la Robótica, May 24, 2023, https://perma.cc/PY6J-QM2Z.</td><td>This bill proposes to establish public policy guidelines for the ethical regulation of artificial intelligence and robotics and to enact a regulatory framework to achieve this goal.</td></tr><tr><td>Norway</td><td>Yes</td><td>No</td><td>National Insurance Act § 21-11 a (Folketrygdloven), https://perma.cc/69YC-MFDC (in Norwegian). \nAct amending the Health Personnel Act and the Patient Journal Act (use of health information to better coordinate and use of artificial intelligence in the health and care service) (Lov om endringer i helsepersonelloven og pasientjournalloven (bruk av helseopplysninger for Å lette samarbeid, læring og bru k kunstig intelligens i helse- og omsorgstjenesten mv), https://perma.cc/NE27-JPFR (in Norwegian).</td><td>Provides that the government, through issued regulations, may regulate automated decision making in relation to national health insurance. \nProvides legal basis for use of artificial intelligence (kunstig intelligense) in the health and care service.</td></tr><tr><td>Panama</td><td>No</td><td>Yes</td><td>Proyecto de Ley Que Regula la Inteligencia Artificial en la Republica, July 6, 2023, https://perma.cc/BVP8-QFQ6.</td><td>This bill proposes guidelines on the development and application of artificial intelligence in order to foster innovation and protect personal privacy rights.</td></tr><tr><td>Peru</td><td>Yes</td><td>No</td><td>Ley No. 31814, July 5, 2023, https://perma.cc/Y88S-HY7X.</td><td>Promotes the use of artificial intelligence in the framework of the national process of digital transformation. It aims to protect</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "14"
            }
        ]
    },
    {
        "page_id": 17,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td></td><td>human rights and promote economic and social development in the country.</td></tr><tr><td>Philippines</td><td>No</td><td>Yes</td><td>House Bill No. 7396, proposing to enact an Act Promoting the Development and Regulation of Artificial Intelligence in The Philippines, Mar. 1, 2023, https://perma.cc/6SSP-24GS.</td><td>The bill “outlines the principles of responsible AI development, including transparency, fairness, accountability, and privacy ... [and] requires organizations that develop or deploy AI technologies to adhere to these principles and to conduct risk assessments and impact analyses before deploying their technologies.” It “includes provisions to protect the privacy and personal data of individuals, to prevent discrimination and bias in AI technologies, and to ensure that AI systems are safe and secure. ... To undertake the foregoing tasks, duties and responsibilities, the bill provides for the establishment of an agency to be known as the Artificial Intelligence Development Authority (AIDA) which will be responsible for the development and implementation of a national AI strategy.” (Id. explanatory note.)</td></tr><tr><td>Poland</td><td>Yes</td><td>No</td><td>Law 317/2018 of Jan. 11, 2018, on Electromobility and Alternative Fuels, art. 65K, https://perma.cc/W54G-3LNE (in Polish).</td><td>The law outlines the concept of an autonomous vehicle as a vehicle equipped with systems that manage its movement and allow it to operate without the need for driver involvement. It permits research on autonomous vehicles for transportation, provided that safety requirements are met and necessary permits are acquired.</td></tr><tr><td>Portugal</td><td>Yes</td><td>No</td><td>Lei No. 27/2021, de 17 de Maio, art. 9(1), https://perma.cc/9865-SCJJ.</td><td>The use of artificial intelligence must be guided by respect for fundamental rights, guaranteeing a fair balance between the principles of expliculdade (clarity), security, transparency, and responsibility, taking into account the circumstances of each</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "15"
            }
        ]
    },
    {
        "page_id": 18,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td></td><td>specific case and establishing procedures aimed at avoiding any prejudices and forms of discrimination.</td></tr><tr><td>Qatar</td><td>Yes</td><td>No</td><td>Cabinet Resolution No. 10 of 2021 on the establishment of the National Commission for Artificial Intelligence, al-Jaridah al-Rasmiyah (Official Gazette), vol. 11, Sept. 14, 2021, https://perma.cc/5F9S-Q5PY.</td><td>The resolution defines the mission, objectives, functions and structure of the National Commission for the Artificial Intelligence. The commission has the power to issue guidelines on the usage of artificial intelligence and prohibitions related to such usage.</td></tr><tr><td rowspan=\"3\">Russian Federation</td><td rowspan=\"3\">Yes</td><td rowspan=\"3\">No</td><td>Decree of the President No. 490, on the Development of Artificial Intelligence, Oct. 10, 2019, https://perma.cc/5HMW-GRXX (in Russian).</td><td>Prescribes measures for accelerated development of AI, conducting scientific research in the field of AI, increasing the availability of information and computing resources for users, and improving personnel training in this area.</td></tr><tr><td>Federal Law No. 123-FZ on Conducting an Experiment to Establish Special Regulation in Order to Create the Necessary Conditions for the Development and Implementation of Artificial Intelligence Technologies in the City of Moscow, and amending articles 6 and 10 of the Federal Law on Personal Data, adopted on Apr. 14, 2020, https://perma.cc/FK8R-4MCA (in Russian).</td><td>The law contains definitions for AI. (Id. art.2, para.1(1).) It provides an experimental legal regime to develop AI projects in Moscow and, subsequently, throughout Russia, and it introduces a special legal framework for “digital sandboxes” in Moscow. (Id. art. 2, para. 1(1).)</td></tr><tr><td>Federal Law No. 258-FZ on Experimental Legal Regimes in the Sphere of Digital Innovations in the</td><td>The law regulates the establishment, modification, and termination of an experimental legal regime in the field of digital innovations (a “regulatory sandbox”) and creates a procedural</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "16"
            }
        ]
    },
    {
        "page_id": 19,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td rowspan=\"2\"></td><td rowspan=\"2\"></td><td rowspan=\"2\"></td><td>Russian Federation, adopted on July 16, 2020, https://perma.cc/34MC-M9DN (in Russian).</td><td>mechanism for establishing, changing, canceling, and monitoring sandboxes (id. art. 2), to lessen regulatory limitations on developers of digital innovations during the defined experimental period for solution applications. (Id. art. 3.) Specified areas for development, approval, and implementation of digital innovations include medical activities; transportation; agriculture; financial markets; online sale of goods, works and services; architectural and building design and construction; rendering of governmental and municipal services; and industrial production. (Id. art. 1, para. 2(1-9).)</td></tr><tr><td>Federal Law No. 331-FZ on Amendments to Certain Legislative Acts of the Russian Federation in Connection with the Adoption of the Federal Law on Experimental Legal Regimes in the Sphere of Digital Innovations, adopted on June 16, 2021, https://perma.cc/6YGF-GQ7S (in Russian).</td><td>These amendments introduced a number of exceptions to the legislation governing communications, the use of personal data, and certain digital innovative projects.</td></tr><tr><td>Saudi Arabia</td><td>Yes</td><td>No</td><td>Cabinet Resolution No. 195, issued on 15/3/1444 Hijri corresponding to October 11, 2022, on the establishment of the Saudi Authority for Information and Artificial Intelligence, https://perma.cc/TA3F-DAYQ.</td><td>The resolution defines the mission, objectives, functions and structure of the Saudi Authority for Information and Artificial Intelligence. The authority has the power to issue guidelines on the usage of artificial intelligence and prohibitions related to such usage.</td></tr><tr><td>Serbia</td><td>Yes</td><td>No</td><td>Decision of the Government of Serbia on Guidelines for the Development, Implementation, and Use of</td><td>The guidelines set out a framework for activities within the AI ecosystem. The document outlines the general principles and</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "17"
            }
        ]
    },
    {
        "page_id": 20,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2091
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>Reliable and Responsible AI, Mar. 23, 2023, Sl. Glasnik RS, br. 23/2023, https://perma.cc/7GLU-88PT (in Serbian).</td><td>conditions for the harmonizing Serbia&#x27;s legislative framework with the EU. It provides for the creation of “reliable and responsible” AI, and sets rules that all individuals and legal entities developing, applying or using AI systems must observe.</td></tr><tr><td>Slovak Republic</td><td>Yes</td><td>No</td><td>Constitutional Court of the Slovak Republic PL. US 25 / 2019-117 (eKasa case) in David Hardwick, “Error 404-Match Not Found,” Tax Enforcement and Law Enforcement in the EU Artificial Intelligence Act, in 1 Eucrim 56 (2023), https://perma.cc/3WX2-UPJ8.</td><td>The Constitutional Court ruled that the use of machine learning to enhance surveillance had reached a point where it necessitated a dedicated structure and customized measures to counteract the potential dangers of abuse.</td></tr><tr><td>South Korea</td><td>No</td><td>Yes</td><td>Ten bills are pending at the National Assembly, https://perma.cc/RPD4-VD5W. The most recent one is the Artificial Intelligence Responsibility and Regulation Bill, Bill No. 2123709 (Aug. 8, 2023), https://perma.cc/MH5R-5RGQ (in Korean).</td><td>The most recent bill defines “prohibited artificial intelligence” and allows the development and use of low-risk artificial intelligence with conditions.</td></tr><tr><td>Spain</td><td>Yes</td><td>No</td><td>Ley 15/2022, de 12 de julio, integral para la igualdad de trato y la no discriminación, art. 23, https://perma.cc/78J8-WBMV.</td><td>Article 23 relates to the use of AI and automated decision-making mechanisms. It refers to the need for public administrations to implement mechanisms so that algorithms take into account bias minimization criteria, transparency, and accountability, and requires public administrations and companies to promote the use of ethical, reliable, and respectful AI with fundamental rights, especially following the recommendations of the EU in this regard.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "18"
            }
        ]
    },
    {
        "page_id": 21,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1365,
                    147,
                    2830,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    2152
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td>Sweden</td><td>Yes</td><td>No</td><td>28 § Administrative Act (Föraltningslagen (2017:900), https://perma.cc/QHZ4-L8JL (in Swedish).</td><td>The law allows government agency staff to use automated decision making. In addition, EU law applies. For AI and the EU, see EU entry.</td></tr><tr><td>Thailand</td><td>No</td><td>Yes</td><td>The text of the Draft Artificial Intelligence Innovation Promotion Act is not available. See Radeemada Mungkardee &amp; Dharin Nantananate, Thailand&#x27;s Draft Laws for the Regulation and Promotion of AI Products and Services, LEXEL (June 22, 2023), https://lexel.co.th/thailands-draft-laws-for-the-regulation-and-promotion-of-al-products-and-services/.</td><td>The draft legislation would establish an AI sandbox, promote data sharing, and establish an AI standard certification system.</td></tr><tr><td>Taiwan</td><td>Yes</td><td>Yes</td><td>Statute for Industrial Innovation (as amended Jan. 19, 2023) art. 10-1, https://perma.cc/W6LT-QU4B (in Chinese), https://perma.cc/F8RL-LY5N (English translation); Act for the Development of Biotech and Pharmaceutical Industry (as amended Dec. 30, 2021) art. 4, https://perma.cc/6QFC-5CVC (in Chinese), https://perma.cc/27MC-GWPJ (English translation). Draft Basic AI Act (proposed by Hsu Yu-jen and 20 other Legislative Yuan members, May 15, 2019), https://perma.cc/V3E5-YUFW (in Chinese).</td><td>Regulations provide incentives to encourage and promote high-tech industries, which include AI as one of the technologies. Various drafts of Basic AI Act have been proposed by members of Legislative Yuan and other parties. The government is considering its own draft Basic AI Act, which has not been released. (Executive Yuan Announces Artificial Intelligence Plan (June 4, 2023), https://perma.cc/HA2G-6NSJ.)</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "19"
            }
        ]
    },
    {
        "page_id": 22,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1360,
                    147,
                    2826,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3901,
                    2208
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td>United Arab Emirates (UAE)</td><td>Yes</td><td>No</td><td>Decree No. 32 of 2020, issued by the head of the Judicial Department of Abu Dhabi, concerning a guide to use artificial intelligence in legal services and judicial operations, al-Jarīdah al-Rasmiyah (Official Gazette), vol. 11, Nov. 30, 2020, https://perma.cc/2VB9-KM6D.Decree promulgating Federal Law No. 25 of 2018 on allowing futuristic projects, issued on September 23, 2018, posted on the official website of the UAE Cabinet, https://perma.cc/99K6-8UQD.</td><td>The decree allows the usage of artificial intelligence in legal translation, research, arbitration, and making necessary decisions in judicial proceedings.The law allows the UAE Cabinet to grant permission to foreign and domestic corporations using the technology of artificial intelligence to operate in the country.</td></tr><tr><td>United Kingdom</td><td>Yes</td><td>Yes</td><td>National Security and Investment Act 2021, c. 25, https://perma.cc/9VHY-B8UB, and the National Security and Investment Act 2021 (Notifiable Acquisition) (Specification of Qualifying Entities) Regulations 2021, SI 2021/1264, https://perma.cc/3TPH-Y6YK.Online Safety Bill, HL Bill 164, https://perma.cc/ZU5J-UPMC.</td><td>The National Security and Investment Act 2021 provides the government with the authority to intervene in acquisitions that could harm the national security of the UK, including companies that develop AI.The Online Safety Bill aims to regulate proactive technologies, which includes AI. The bill places a duty of care on a number of platforms to protect all users from illegal content and keep children safe online. To comply with the duties, the companies must conduct risk assessments identifying risks and explain how the risks are mitigated, which can be through human moderators or AI tools.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2404
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "20"
            }
        ]
    },
    {
        "page_id": 23,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1365,
                    147,
                    2830,
                    214
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: Jurisdictional Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3901,
                    2045
                ],
                "angle": 0,
                "content": "<table><tr><td>Jurisdiction</td><td>References to AI in current legislation? (Yes/No)</td><td>References to AI in proposed legislation? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>Artificial Intelligence (Regulation and Workers&#x27; Rights), Bill 309, 732 Parl. Deb. (5th ser.) (HC) 2023, https://perma.cc/BA46-E3QJ.</td><td>The Artificial Intelligence (Regulation and Workers&#x27; Rights) Bill was introduced as a private members&#x27; bill, which usually serves to highlight a topic and typically does not become a law. The proposed bill aims to regulate AI in the workplace, particularly with regard to worker and trade union rights.</td></tr><tr><td rowspan=\"3\">Uzbekistan</td><td rowspan=\"3\">Yes</td><td rowspan=\"3\">No</td><td>Decree of the President on Measures to Create Conditions for the Accelerated Introduction of Artificial Intelligence Technologies, No. PP-4996, Feb. 17, 2021, https://perma.cc/25P8-D832 (in Russian).</td><td>The decree prescribes measures for all national science and research organizations, higher educational institutions, and organizations in the field of information technology to develop innovative products for management and automation of production processes based on artificial intelligence technologies, models, algorithms, and software. It provides for the creation of an open data portal and digital data platform.</td></tr><tr><td>Resolution of the Cabinet of Ministers No. 475, on the Organization of the Research Institute for the Development of Digital Technologies and Artificial Intelligence, July 31, 2021, https://perma.cc/PF38-H7X3 (in Uzbek).</td><td>The resolution provides for the carrying out of fundamental and applied scientific research in the field of artificial intelligence and the formation of a scientific ecosystem for the development of digital technologies.</td></tr><tr><td>Decree of the President on Measures to Implement a Special Regime for the Application of Artificial Intelligence Technologies, No. PP-5234, Aug. 26, 2021, https://perma.cc/Q24F-ZKNR (in Russian).</td><td>The decree introduces a special regime that provides for the necessary organizational and legal conditions for legal entities and scientific organizations engaged in activities related to the conduct of experimental work based on artificial intelligence technologies.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2394
                ],
                "angle": 0,
                "content": "21"
            }
        ]
    },
    {
        "page_id": 24,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1533,
                    303,
                    2658,
                    392
                ],
                "angle": 0,
                "content": "International Organizations Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    525,
                    3906,
                    2226
                ],
                "angle": 0,
                "content": "<table><tr><td>Organization</td><td>Final document related to AI? (Yes/No)</td><td>Proposed document related to AI? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td rowspan=\"2\">Council of Europe</td><td rowspan=\"2\">No</td><td rowspan=\"2\">Yes</td><td>Consolidated Text of the Convention for the Protection of Individuals with Regard to Automatic Processing of Personal Data, ETS No. 108, art. 9, para. 1(a), https://perma.cc/B828-4W7B.</td><td>Convention No. 108, which entered into force in 1985, was the first international treaty on personal data protection. A 2018 amendment, which has not yet entered into force, modernized the convention and established, among other things, the right of an individual not to be subject to a decision significantly affecting him or her based solely on an automated processing of data without having his or her views taken into consideration.</td></tr><tr><td>Committee on Artificial Intelligence [CAI], Revised Zero Draft [Framework] Convention on Artificial Intelligence, Human Rights, Democracy, and the Rule of Law (Jan. 6, 2023), https://perma.cc/PS8F-9M5L.</td><td>The proposed framework convention would provide a common framework for the design, development, and application of AI systems throughout their life cycle, regardless of whether these activities are undertaken by public or private actors, with the exclusion of national defense. It would be based on the Council of Europe&#x27;s standards on human rights, democracy, and the rule of law. Similar to the EU&#x27;s proposed AI Act, it would adopt a risk-based approach to AI systems, but would not establish redlines for certain AI uses. It would be open for accession by nonmembers of the Council of Europe after entry into force.</td></tr><tr><td>NATO</td><td>Yes</td><td>No</td><td>NATO, Summary of the Artificial Intelligence Strategy (Oct. 22, 2021), https://perma.cc/3GRM-7P6X.</td><td>Promulgated in October 2021, the strategy adopts six principles of responsible use: lawfulness, responsibility and accountability, explainability and traceability, reliability, governability, and bias mitigation.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "22"
            }
        ]
    },
    {
        "page_id": 25,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1226,
                    147,
                    2969,
                    209
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: International Organizations Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3901,
                    2142
                ],
                "angle": 0,
                "content": "<table><tr><td>Organization</td><td>Final document related to AI? (Yes/No)</td><td>Proposed document related to AI? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td></td><td></td><td></td><td>NATO&#x27;s Data and Artificial Intelligence Review Board, NATO (Oct. 17, 2022), https://perma.cc/Y3H5-3QFJ.NATO Starts Work on Artificial Intelligence Certification Standard, NATO (Feb 7, 2023), https://perma.cc/RW89-PXNL.</td><td>Summary of the Establishment of the Data and Artificial Intelligence Review Board (DARB). This board is responsible for the implementation of the six principles of responsible use.The artificial intelligence standard for NATO is due to be completed by the end of 2023.</td></tr><tr><td>Organisation for Economic Cooperation and Development (OECD)</td><td>Yes</td><td>No</td><td>Recommendation of the Council on Artificial Intelligence, OECD, https://perma.cc/PRU9-XL89.</td><td>Promulgated in 2019, it provides five principles on responsible stewardship of AI and five recommendations for implementation.</td></tr><tr><td>United Nations</td><td>Yes</td><td>Yes</td><td>U.N. Secretary General, Roadmap for Digital Cooperation: Implementation of the Recommendations of the High-Level Panel on Digital Cooperation, U.N. Doc. A/74/821 (May 29, 2020), https://perma.cc/U889-LDYZ.U.N., The Age of Digital Interdependence: Report of the UN Secretary-General&#x27;s High-Level Panel on Digital Cooperation (June 2019), https://perma.cc/LDN5-UUAH.</td><td>&quot;The present report serves to respond to and builds upon the report of the High-level Panel on Digital Cooperation. The current situation of digital cooperation is assessed, including in terms of the ongoing coronavirus disease (COVID-19) pandemic; urgent gaps and challenges are highlighted; and actions to strengthen global digital cooperation are set out.&quot; Id.Includes among &quot;priority actions&quot; audits and monitoring schemes to ensure that AI complies with engineering and ethical standards.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "23"
            }
        ]
    },
    {
        "page_id": 26,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1226,
                    147,
                    2969,
                    209
                ],
                "angle": 0,
                "content": "Regulation of Artificial Intelligence Around the World: International Organizations Table"
            },
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    289,
                    290,
                    3906,
                    1519
                ],
                "angle": 0,
                "content": "<table><tr><td>Organization</td><td>Final document related to AI? (Yes/No)</td><td>Proposed document related to AI? (Yes/No)</td><td>Citation</td><td>Description</td></tr><tr><td>Chief Executives Board (United Nations)</td><td>Yes</td><td>No</td><td>U.N. Chief Executives Board for Coordination, Principles for the Ethical Use of Artificial Intelligence in the United Nations System, U.N. Doc. CEB/2022/2/Add.1, https://perma.cc/V67Z-4CM6.</td><td>Adopted in October 2022, it implements 10 principles “grounded in ethics and human rights” to guide the use of AI within the entire United Nations system, https://perma.cc/BQ2J-V572.</td></tr><tr><td>International Telecommunication Union (ITU) (United Nations)</td><td>Yes</td><td>No</td><td>ITU, United Nations Activities on Artificial Intelligence (AI) (2022), https://perma.cc/2MYG-QG3B.</td><td>Overview of 2022 projects and initiatives taken on by United Nations and other stakeholders to ensure AI is used for the betterment of humanity. Presented March 2023. More information is available at AI for Good, ITU, https://perma.cc/J6Y5-DEVE.</td></tr><tr><td>UNESCO (United Nations)</td><td>Yes</td><td>No</td><td>UNESCO, Recommendation on the Ethics of Artificial Intelligence (2022), https://perma.cc/6Q26-U2G8.</td><td>Adopted by UNESCO&#x27;s General Conference in November 2021, it covers a selection of 11 areas for policy action and includes monitoring and evaluation standards.</td></tr></table>"
            },
            {
                "block_id": 2,
                "type": "footer",
                "bbox": [
                    289,
                    2346,
                    869,
                    2402
                ],
                "angle": 0,
                "content": "The Law Library of Congress"
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    3851,
                    2351,
                    3901,
                    2391
                ],
                "angle": 0,
                "content": "24"
            }
        ]
    }
]