[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "aside_text",
                "bbox": [
                    58,
                    900,
                    147,
                    2313
                ],
                "angle": 270,
                "content": "arXiv:2306.05425v1 [cs.CV] 8 Jun 2023"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    703,
                    405,
                    1843,
                    574
                ],
                "angle": 0,
                "content": "MIMIC-IT: Multi-Modal In-Context Instruction Tuning"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    571,
                    739,
                    1976,
                    841
                ],
                "angle": 0,
                "content": "Bo Li*,1,1 Yuanhan Zhang*,1,1 Liangyu Chen*,1 Jinghao Wang*,1 Fanyi Pu*,1 Jingkang Yang1 Chunyuan Li2 Ziwei Liu1,"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    474,
                    844,
                    2073,
                    1032
                ],
                "angle": 0,
                "content": "\\(^{1}\\)S-Lab, Nanyang Technological University, Singapore \\(^{2}\\)Microsoft Research, Redmond {libo0013, yuanhan002, lchen025, c190209, fpu001, ziwei.liu}@ntu.edu.sg chunyl@microsoft.com https://github.com/Luodian/Otter"
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    1173,
                    1148,
                    1371,
                    1201
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    586,
                    1247,
                    1958,
                    2154
                ],
                "angle": 0,
                "content": "High-quality instructions and responses are essential for the zero-shot performance of large language models on interactive natural language tasks. For interactive vision-language tasks involving intricate visual scenes, a large quantity of diverse and creative instruction-response pairs should be imperative to tune vision-language models (VLMs). Nevertheless, the current availability of vision-language instruction-response pairs in terms of quantity, diversity, and creativity remains limited, posing challenges to the generalization of interactive VLMs. Here we present Multi-Modal In-Context Instruction Tuning (MIMIC-IT), a dataset comprising 2.8 million multimodal instruction-response pairs, with 2.2 million unique instructions derived from images and videos. Each pair is accompanied by multi-modal in-context information, forming conversational contexts aimed at empowering VLMs in perception, reasoning, and planning. The instruction-response collection process, dubbed as Syphus, is scaled using an automatic annotation pipeline that combines human expertise with GPT's capabilities. Using the MIMIC-IT dataset, we train a large VLM named Otter. Based on extensive evaluations conducted on vision-language benchmarks, it has been observed that Otter demonstrates remarkable proficiency in multi-modal perception, reasoning, and in-context learning. Human evaluation reveals it effectively aligns with the user's intentions. We release the MIMIC-IT dataset, instruction-response collection pipeline, benchmarks, and the Otter model."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    438,
                    2234,
                    800,
                    2286
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    433,
                    2336,
                    2103,
                    2791
                ],
                "angle": 0,
                "content": "The recent advancements in artificial intelligence have focused on conversational assistants [42, 31, 30, 13, 17] that possess a strong ability to understand user intentions [35] and then execute actions [5, 51]. In addition to the strong generalization ability of large language models (LLMs), the notable achievements of these conversational assistants can be attributed to the practice of instruction tuning [47, 14, 46, 45, 42, 13, 34]. It involves fine-tuning LLMs on a range of tasks specified through diverse and high-quality instructions [14, 45]. By incorporating instruction tuning, LLMs acquire a heightened comprehension of user intentions [35], enabling them to exhibit improved zero-shot capabilities even in previously unseen tasks [47]. One potential reason for the zero-shot performance gain by instruction tuning is that it internalizes the context [40], which is preferred in user interactions especially when user input skips commonsense context."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    436,
                    2811,
                    2103,
                    2907
                ],
                "angle": 0,
                "content": "Conversational assistants that excel in language tasks have achieved remarkable success. However, an optimal conversational assistant should be able to address tasks involving multiple modalities. This"
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    502,
                    2930,
                    1473,
                    2983
                ],
                "angle": 0,
                "content": "*Equal Contribution *Project Lead Corresponding Author"
            },
            {
                "block_id": 10,
                "type": "footer",
                "bbox": [
                    438,
                    3045,
                    803,
                    3092
                ],
                "angle": 0,
                "content": "Preprint. Under review."
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    448,
                    290,
                    2108,
                    1260
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: MIMIC-IT overview. The MIMIC-IT dataset comprises 2.8M multi-modal instruction-response pairs spanning fundamental capabilities: perception, reasoning, and planning. Each instruction is accompanied by multi-modal conversational context, allowing VLMs trained on MIMIC-IT to demonstrate strong proficiency in interactive instruction following with zero-shot generalization."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    1643,
                    2108,
                    1831
                ],
                "angle": 0,
                "content": "requires access to a diverse and high-quality multi-modal instruction-following dataset. The LLaVA-Instruct-150K dataset [28], also known as LLaVA, is the pioneering vision-language instruction-following dataset. It is constructed using COCO [27] images, instructions and responses obtained from GPT-4 [30] based on image captions and object bounding boxes."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    433,
                    1848,
                    2111,
                    2352
                ],
                "angle": 0,
                "content": "Although inspiring, LLaVA-Instruct-150K exhibits three limitations. (1) Limited visual diversity: The dataset's visual diversity is constrained due to its exclusive reliance on the COCO image. (2) Single image as visual data: it utilizes a single image as visual data, while a multi-modal conversational assistant should possess the capability to process multiple images or even extensive videos. For instance, it should effectively provide answers when a user presents a collection of images (or a sequence of images, such as a video) alongside the instruction: \"Help me think of an album title for these images.\" (3) Language-only in-context information: it depends solely on language for in-context information, whereas a multi-modal conversational assistant should integrate multi-modal in-context information to better comprehend user instructions. For example, an assistant could more accurately align its description of an image with the tone, style, or other aspects if the human user provides a concrete image example of the desired attributes."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    2369,
                    2113,
                    3012
                ],
                "angle": 0,
                "content": "Addressing these limitations, we introduce Multi-Modal In-Context Instruction Tuning (MIMIC-IT). MIMIC-IT is characterized by: (1) Diverse visual scenes, incorporating images and videos from general scenes, egocentric view scenes, and indoor RGB-D images across various datasets. (2) Multiple images (or a video) as visual data, supporting instruction-response pairs accompanied by any number of images or videos. (3) Multi-modal in-context information, featuring in-context information formulated in multi-modal formats, including multiple instruction-response pairs and multiple images or videos (see Fig. 2 for data format clarification). To efficiently generate instruction-response pairs, we introduce Sythus, an automated pipeline for instruction-response annotation inspired by the self-instruct method [45]. Sythus employs system message, visual annotation, and in-context examples to direct the language model (GPT-4 or ChatGPT) in generating instruction-response pairs based on visual context, including timestamps, captions, and object information, targeting three fundamental capabilities of vision-language models: perception, reasoning, and planning (refer to Fig. 1). Additionally, instructions and responses are translated from English into seven languages to support multi-lingual usage."
            },
            {
                "block_id": 5,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1285,
                    3128
                ],
                "angle": 0,
                "content": "2"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    433,
                    300,
                    2108,
                    673
                ],
                "angle": 0,
                "content": "On MIMIC-IT, we train a multi-modal model Otter based on OpenFlamingo [6]. We evaluate Otter's multi-modal capabilities in two aspects: (1) ChatGPT evaluation on the MMAGIBenchmark [43], comparing Otter's perception and reasoning abilities with other recent vision-language models (VLMs), where Otter demonstrates the strongest performance. (2) Human evaluation on the Multi-Modality Arena [32], where Otter outperforms other VLMs, achieving the highest Elo rating. Furthermore, we assess Otter's few-shot in-context learning ability using the COCO Caption dataset [12], with results showing Otter's superior performance over OpenFlamingo in all few-shot settings. In summary, our contributions include:"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    553,
                    722,
                    2106,
                    854
                ],
                "angle": 0,
                "content": "- Multi-Modal In-Context Instruction Tuning (MIMIC-IT) dataset, a dataset comprising \\(\\sim\\) 2.8M multi-modal in-context instruction-response pairs, with 2.2 million unique instructions, across various real-life scenes."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    553,
                    858,
                    2103,
                    947
                ],
                "angle": 0,
                "content": "- **Syphus**, an automatic pipeline built with LLMs to generate high-quality and multi-lingual instruction-response pairs based on visual context."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    553,
                    950,
                    2106,
                    1042
                ],
                "angle": 0,
                "content": "- Otter, a multi-modal model demonstrates robust multi-modal perception and reasoning capabilities, effectively following human intent while exhibiting adeptness in-context learning."
            },
            {
                "block_id": 4,
                "type": "list",
                "bbox": [
                    553,
                    722,
                    2106,
                    1042
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    438,
                    1141,
                    823,
                    1191
                ],
                "angle": 0,
                "content": "2 Related Work"
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    438,
                    1263,
                    1257,
                    1316
                ],
                "angle": 0,
                "content": "2.1 Multi-modal Instruction Tuning Dataset"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    433,
                    1362,
                    2111,
                    1917
                ],
                "angle": 0,
                "content": "The notion of instruction tuning in multi-modal models was initially introduced in the work called Multi-Instruct [50], which encompassed a wide range of multi-modal tasks [18, 56, 41, 27, 12] involving visual understanding and multi-modal reasoning, such as Visual Question Answering [18, 56, 23]. Similarly, Mini-GPT4 [54] created its instruction-based dataset by merging Conceptual Caption [38, 8], SBU [33], and LAION [36] with handwritten instruction templates. More recently, LLaVA-Instruct-150K [28] has elevated the quality of instruction tuning datasets by utilizing self-instruct and GPT-4 [30], along with handwritten seed instructions on COCO images [27]. While these previous works on multi-modal instruction tuning primarily focused on general scene images, our approach categorizes our data sources into indoor scenes, outdoor scenes, conversations, and egocentric videos. Additionally, drawing inspiration from the image-text interleaved structure of the MMC4 dataset [55], our approach further distinguishes itself by incorporating a multi-modal in-context format into instruction tuning."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    438,
                    1999,
                    1127,
                    2046
                ],
                "angle": 0,
                "content": "2.2 Multi-modal Foundation Models"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    433,
                    2098,
                    2108,
                    2649
                ],
                "angle": 0,
                "content": "With the recent success of ChatGPT [31], GPT-4 [30], and other LLMs [44, 42, 13], recent studies start to explore incorporating information from other modalities into pretrained language models. These studies extend the capabilities of LLM to more tasks and modalities and can be categorized into two classes: (i) Multi-model Aggregation. These approaches [48, 39, 11, 57, 57, 52] take an LLM as a dispatch scheduler and connect different expert models through it to allow for different tasks. Language serves as an interface to call expert visual-language models within their respective task domains. However, this approach is limited that each model cannot be trained individually on new tasks. (ii) End-to-End Trainable Models. These approaches [2, 6, 25, 30, 3, 37, 7, 54, 53, 28] connect models from different modalities into integrated end-to-end trainable models, also known as multi-modal foundation models. Among them, based on large-scale image-text interleaved pretrained model OpenFlamingo [6], Otter is the first open-sourced model to further demonstrate the power of multi-modal in-context instruction tuning."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    436,
                    2748,
                    1616,
                    2808
                ],
                "angle": 0,
                "content": "3 Multi-modal In-context Instruction Tuning Dataset"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    433,
                    2871,
                    2103,
                    3016
                ],
                "angle": 0,
                "content": "We aim to build MIMIC-IT dataset to support more VLMs in acquiring the ability to comprehend the real world. In this section, we provide an overview of the MIMIC-IT dataset, starting with the data format in Sec. 3.1 and our automatic instruction generation pipeline, Sythus, in Sec. 3.2."
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1287,
                    3128
                ],
                "angle": 0,
                "content": "3"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    443,
                    293,
                    2093,
                    1755
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: Data Format Comparison: LLaVA-Instruct-150K vs. MIMIC-IT. (a) LLaVA-Instruct-150K consists of a single image with corresponding language-only in-context information (yellow box). (b) MIMIC-IT accommodates multiple images or videos within the input data and supports multi-modal in-context information, i.e., considering both images/videos and language inputs as in-context information."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    438,
                    2098,
                    981,
                    2145
                ],
                "angle": 0,
                "content": "3.1 MIMIC-IT Data Format"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    436,
                    2181,
                    2103,
                    2517
                ],
                "angle": 0,
                "content": "Each instance \\(i\\) in the MIMIC-IT dataset comprises an instruction-response pair and a set of \\(N\\) images. We regard it as query example with a tuple: \\((I_q, R_q, X_q)\\), where \\(\\{x_{j=1}^N\\} \\in X_q\\). Here, \\(I_q\\) denotes the \\(q\\)-th instruction in our dataset, \\(R_q\\) represents the response, and \\(X_q\\) refers to the images or videos<sup>1</sup>. Our primary objective is to develop a visual language model \\(p_\\theta(R_q \\mid (I_q, X_q))\\) parametrized by trainable parameters \\(\\theta\\), the model generates the response \\(R_i\\) for each query \\((I_q, X_q)\\). With above example denotes the standard instruction tuning process of a visual language model. Further, we could define a set of in-context examples as \\((I_k, R_k, X_k)_{k=1}^M\\), where \\(M\\) is the number of the set."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    2534,
                    2103,
                    2676
                ],
                "angle": 0,
                "content": "We then define a context function \\( C_{\\psi} : (I_q, X_q) \\mapsto \\{(I_k, X_k)\\}_{k=1}^M \\) to represent the in-context examples with current query example. In summary, all data in the MIMIC-IT dataset will be represented in the following format, query example with its corresponding in-context examples."
            },
            {
                "block_id": 5,
                "type": "equation",
                "bbox": [
                    836,
                    2739,
                    2103,
                    2798
                ],
                "angle": 0,
                "content": "\\[\nd _ {q} = \\left(I _ {q}, R _ {q}, X _ {q}, C _ {\\psi} \\left(I _ {q}, X _ {q}\\right)\\right), \\quad d _ {q} \\sim D _ {\\text {M I M I C - I T}} \\tag {1}\n\\]"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    2828,
                    2108,
                    2930
                ],
                "angle": 0,
                "content": "Now the visual language model that incorporates in-context examples can be denoted as \\( p_{\\theta}(R_q \\mid (I_q, X_q, C_{\\psi}(I_q, X_q))) \\). \\( C_{\\psi} \\) is task-dependent, we apply different approaches to organize the in-"
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    489,
                    2963,
                    1331,
                    3009
                ],
                "angle": 0,
                "content": "<sup>1</sup>Videos can be viewed as ordered sequences of images."
            },
            {
                "block_id": 8,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1285,
                    3125
                ],
                "angle": 0,
                "content": "4"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    464,
                    293,
                    2085,
                    867
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 3: Sythus overview. We employ a cold-start stage to identify the optimal system message and in-context example for querying instruction-response pairs in a given dataset. Subsequently, Sythus, spanning steps 1 to 4, generates high-quality instruction-response pairs in eight languages."
            },
            {
                "block_id": 3,
                "type": "table",
                "bbox": [
                    443,
                    1508,
                    2103,
                    2072
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>Visual Data (Scenes)</td><td>In-context</td><td>Video</td><td>#Clips/Images</td><td>#Instruct.</td><td>#Instance.</td><td>Lang.</td></tr><tr><td>MiniGPT-4 [54]</td><td>CC (General)</td><td>-/-</td><td>X</td><td>- / 134M</td><td>4</td><td>5K</td><td>English</td></tr><tr><td>LLaVA [28]</td><td>COCO (General) [27]</td><td>lang./-</td><td>X</td><td>- / 81K</td><td>261K</td><td>345K</td><td>English</td></tr><tr><td rowspan=\"8\">MIMIC-IT</td><td>COCO (General) [27]</td><td>lang./vis.</td><td>X</td><td>- / 81K</td><td>261K</td><td>345K</td><td rowspan=\"8\">Multi.</td></tr><tr><td>SD (Surveillance) [21]</td><td>lang./vis.</td><td>X</td><td>- / 9K</td><td>10K</td><td>15K</td></tr><tr><td>SN (Indoor Ego.) [15]</td><td>lang./vis.</td><td>X</td><td>- / 0.5K</td><td>4.8K</td><td>6K</td></tr><tr><td>DC (General)[22]</td><td>lang./vis.</td><td>✓</td><td>16K / 1M</td><td>40K</td><td>62K</td></tr><tr><td>VIST (Story)[20]</td><td>lang./vis.</td><td>✓</td><td>- / 16K</td><td>32K</td><td>33K</td></tr><tr><td>TVC (TV)[24]</td><td>lang./vis.</td><td>✓</td><td>86K / 577K</td><td>86K</td><td>92K</td></tr><tr><td>E4D (General Ego.)[19]</td><td>lang./vis.</td><td>✓</td><td>400K / 6.4M</td><td>1.8M</td><td>2.4M</td></tr><tr><td>Total</td><td>lang./vis.</td><td>✓</td><td>502K / 8.1M</td><td>2.2M</td><td>2.8M</td></tr></table>",
                "caption": "Table 1: Comparison between MIMIC-IT and other multi-modal instruction datasets. MIMIC-IT stands out with the following features: (1) The largest vision-language instruction dataset. (2) The first instruction dataset including video data. (3) Supporting multi-modal in-context scenarios (see Fig. 2 for the data format). (4) Supporting eight languages including: English, Chinese, Spanish, Japanese, French, German, Korean, and Arabic. The data source of MIMIC-IT includes seven datasets: COCO [27], Spot-the-diff [21] (SD), ScanNetV2 [15] (SN), VisualStorytelling [20] (VIST), DenseCaption/Activity caption [22] (DC), TVCaption [24] (TVC), and Ego4D [19] (E4D). lang. indicates language and vis. indicates vision."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    2168,
                    2103,
                    2263
                ],
                "angle": 0,
                "content": "context examples with the current query example. The details will be presented in Sec. 3.3 and illustrative examples will be showcased in Fig. 2."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    436,
                    2326,
                    1632,
                    2379
                ],
                "angle": 0,
                "content": "3.2 Sythus: Automatic Instruction-Response Generation Pipeline"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    433,
                    2415,
                    2108,
                    3012
                ],
                "angle": 0,
                "content": "We present Sythus (see Figure 3), an automated pipeline for generating high-quality instruction-response pairs in multiple languages. Building upon the framework proposed by LLaVA [28], we utilize ChatGPT to generate instruction-response pairs based on visual content. To ensure the quality of the generated instruction-response pairs, our pipeline incorporates system messages, visual annotations, and in-context examples as prompts for ChatGPT. System messages define the desired tone and style of the generated instruction-response pairs, while visual annotations provide essential image information such as bounding boxes and image descriptions. In-context examples assist ChatGPT in learning within the context. Since the quality of coreset impacts subsequent data collection process [10], we employ a cold-start strategy to enhance in-context examples before the large-scale query. During the cold-start stage, in-context examples are collected by prompting ChatGPT solely through system messages and visual annotations, employing a heuristic approach. This stage concludes only when satisfactory in-context examples are identified. In step 4, once the instruction-response pairs are obtained, the pipeline expands them into Chinese (zh), Japanese (ja),"
            },
            {
                "block_id": 7,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1285,
                    3128
                ],
                "angle": 0,
                "content": "5"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    436,
                    303,
                    2103,
                    396
                ],
                "angle": 0,
                "content": "Spanish (es), German (de), French (fr), Korean (ko), and Arabic (ar). For further details, please refer to Appendix C, and task-specific prompts can be found in Appendix D."
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    438,
                    481,
                    976,
                    531
                ],
                "angle": 0,
                "content": "3.3 Visual Data Exploration"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    580,
                    2108,
                    996
                ],
                "angle": 0,
                "content": "Acknowledging the importance of high-quality visual annotations and the need for diverse vision-language instructions that align with the distribution of real-world visual content, we curate a collection of seven image and video datasets spanning a wide spectrum of scenes, from general to specific. Encompassing various topics, the MIMIC-IT dataset includes general scene understanding and reasoning, spotting general and subtle differences, as well as facilitating egocentric view comprehension to assist VLMs in future AR headsets, etc. In the subsequent sections, we will present the application scenarios of our dataset: General Scene Understanding in Sec. 3.3.1 and General Scene Understanding in Sec. 3.3.2. In each sub-task, we elaborate on the process of organizing various data into an in-context instruction tuning format, based on the previously established guidelines."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    438,
                    1072,
                    1106,
                    1122
                ],
                "angle": 0,
                "content": "3.3.1 General Scene Understanding"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    1164,
                    2103,
                    1257
                ],
                "angle": 0,
                "content": "For understanding the general scenes, we include four tasks: (1) LLaVA-Interleaved. (2) Spot The Difference. (3) Visual Story Telling. (4) Dense Captions."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    436,
                    1277,
                    2103,
                    1557
                ],
                "angle": 0,
                "content": "LLaVA-Interleaved (LA-I). Learning with in-context examples is essential for effective instruction tuning. To achieve this, we refine the LLaVA-Instruct-150K [28] dataset by retrieving ten in-context examples for each instruction-response pair in LLaVA-Instruct-150K, building LLaVA-Interleaved (LA-I). We identify each data's in-context examples based on instruction text-to-text similarity or image-image similarity. Further details on locating in-context examples and the data sources for LA-I can be found in the Appendix."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    1574,
                    2106,
                    2032
                ],
                "angle": 0,
                "content": "Spot The Difference (SD). Learning to discern differences between images is vital for understanding real-world changes. Our study encompasses two interrelated task types in Scene Difference (SD), addressing varying complexity levels in difference identification. The first type, General Scene Difference, involves creating a pair of images by determining the most similar one to the current image, utilizing image-to-image similarity relationships from the COCO2017 [27]. The second type, Subtle Difference, features pairs of similar images with subtle distinctions sourced from the Spot-the-Diff[21], extracted from surveillance footage. For the first type, we prompt ChatGPT using original image captions and object detection annotations, while for the second type, we employ natural language difference descriptions as annotations. The resulting instruction-response pairs focus on identifying differences between the paired images."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    436,
                    2052,
                    2103,
                    2422
                ],
                "angle": 0,
                "content": "Visual Story Telling (VIST). Beyond traditional scene understanding, the ability to generate coherent and engaging narratives based on visual input expands the context comprehension of Visual Language Models (VLMs). To enable this, we propose a task using the Visual Storytelling dataset [20], which includes event-based image sequences and corresponding inquiry questions. Given that image annotations often contain narratives and timelines not directly observable, we instruct ChatGPT to act as a viewer answering questions about the images. The prompts also incorporate thought-provoking inquiries to promote creativity. Each task instance comprises multiple images and instruction-response pairs, providing in-context examples."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    436,
                    2438,
                    2103,
                    2669
                ],
                "angle": 0,
                "content": "Dense Captions (DC). Expanding the scope of video understanding, DC features dense captions from [22] corresponding to clips within longer videos. The instructions pose a diverse set of questions, addressing the general visual content of the video, human actions, and behaviors, the chronological sequence of events, and causal relationships. This approach encourages VLMs to delve deeper into the intricacies of video content."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    436,
                    2686,
                    2103,
                    3012
                ],
                "angle": 0,
                "content": "TV Show Captions (TVC). The primary purpose of incorporating TV show clips with high-level captions into the training process of VLMs is to enhance their social reasoning abilities and deepen their understanding of complex character dynamics. By organizing drama clips from [24] to analyze character relationships and motivations, we aim to challenge VLMs to move beyond mere perception and demonstrate their reasoning capabilities within the context of TV show narratives. This focused approach is crucial for fostering advanced VLMs capable of effectively handling diverse real-world situations and user queries."
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1287,
                    3128
                ],
                "angle": 0,
                "content": "6"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    527,
                    293,
                    1262,
                    1009
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) Instructions"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1374,
                    293,
                    2111,
                    1009
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) Responses"
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    443,
                    1065,
                    1295,
                    1280
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 5,
                "type": "image",
                "bbox": [
                    1295,
                    1065,
                    1675,
                    1280
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 6,
                "type": "image",
                "bbox": [
                    1683,
                    1065,
                    2101,
                    1280
                ],
                "angle": 0,
                "content": null,
                "caption": "(c) Statistics of instructions and responses."
            },
            {
                "block_id": 8,
                "type": "image_caption",
                "bbox": [
                    433,
                    1359,
                    2111,
                    1636
                ],
                "angle": 0,
                "content": "Figure 4: The data statistics of multi-modal in-context instruction-response pairs. (a) and (b), the root verb-noun pairs of instruction and responses, where the inner circle of the plot represents the root verb of the output response, and the outer circle represents the direct nouns. (c) Statistics of instructions and responses, retaining \\(25\\%\\) of Ego4D instructions for a more balanced distribution. # Related instructions denotes the number of related instructions in an instance, given the same set of visual input data."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    438,
                    1752,
                    1144,
                    1805
                ],
                "angle": 0,
                "content": "3.3.2 Egocentric View Understanding"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    433,
                    1844,
                    2111,
                    2214
                ],
                "angle": 0,
                "content": "Indoor Event Planning (IEP). Emphasizing the planning capabilities of virtual assistants, we utilize visual inputs consisting of a collection of 2D photos depicting a room. We gather indoor scene RGB-D images from ScanNetv2 [15] and sample them into multiple 2D visual inputs, representing a room's layout from a first-person perspective. We prompt ChatGPT to generate instructions that direct humans to perform various activities in indoor spaces. Initially, we have ChatGPT create a personality for the room owner. Subsequently, the planning should be intimately related to the room's layout and the generated room owner, underlining the importance of context awareness in VLMs. This approach ensures that models can effectively support users across diverse indoor scenarios."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    433,
                    2230,
                    2111,
                    2557
                ],
                "angle": 0,
                "content": "Ego4D (E4D) [19]. Utilizing E4D's egocentric videos, we strive to enable VLMs to function effectively as augmented reality (AR) assistants in real-life scenarios. By prompting ChatGPT to generate instructions based on visual descriptions, our goal is to simulate practical interactions between users and AR assistants. To this end, we devise assistant-related questions and tasks that demand context-aware responses. For instance, Instruction: What should I do now? Response: Based on my observation, you can now proceed to do.... This focused approach underscores the potential of VLMs in providing valuable insights and assistance across a diverse range of daily life situations."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    438,
                    2636,
                    851,
                    2682
                ],
                "angle": 0,
                "content": "3.4 Dataset Statistics"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    433,
                    2735,
                    2111,
                    3016
                ],
                "angle": 0,
                "content": "Table 1 presents the essential statistics pertaining to the generated data. Our dataset comprises over 2.8 million instruction-response pairs, wherein each pair includes at least one multi-modal in-context example and one language-only in-context example. Among these pairs, there are 2.2M unique instructions. Furthermore, to examine the characteristics and diversity of the instructions (refer to Fig. 4 (a)) and responses (refer to Fig. 4 (b)), we analyze the verb-noun structure present in them, referring to [45]. Specifically, we employ spaCy for parsing the instructions, extracting the verb closest"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1287,
                    3125
                ],
                "angle": 0,
                "content": "7"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    443,
                    297,
                    2101,
                    1326
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 5: Otter's response examples in different scenarios. Trained on the MIMIC-IT dataset, Otter is able to serve for situation understanding and reasoning, learning with in-context examples, and egocentric visual assistant."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    1560,
                    2103,
                    1798
                ],
                "angle": 0,
                "content": "to the root, and retrieving its first direct noun object<sup>2</sup>. We plot the top 20 most frequently occurring root verbs alongside their top 4 direct noun objects. Our findings reveal that the sentence structure of responses exhibits greater diversity compared to that of instructions. Moreover, we demonstrate diversity in terms of the length of instructions/responses, the number of images per instruction, and the number of in-context examples per instruction, as depicted in Fig. 4 (c)."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    438,
                    1854,
                    991,
                    1913
                ],
                "angle": 0,
                "content": "4 Empirical Evaluation"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    1953,
                    2103,
                    2237
                ],
                "angle": 0,
                "content": "In this section, we showcase the diverse applications of the MIMIC-IT dataset and the potential capabilities of a vision-language model (VLM) trained on it. Firstly, in Sec. 4.1, we introduce Otter, an in-context instruction-tuned model developed using the MIMIC-IT dataset. Next, in Sec. 4.2, we explore various methods for training Otter on the MIMIC-IT dataset and discuss numerous scenarios in which Otter can be effectively employed. Finally, in Sec. 4.3 to Sec. 4.5, we present a comparative analysis of Otter's performance against other VLMs across an array of benchmarks."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    438,
                    2283,
                    1588,
                    2329
                ],
                "angle": 0,
                "content": "4.1 Otter: A Multi-Modal In-context Instruction Tuned Model"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    2366,
                    2103,
                    2511
                ],
                "angle": 0,
                "content": "Otter is designed to support multi-modal in-context instruction tuning based on the OpenFlamingo [6] model, which involves conditioning the language model on the corresponding media, such as an image that corresponds to a caption or an instruction-response pair."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    438,
                    2557,
                    1206,
                    2607
                ],
                "angle": 0,
                "content": "4.2 Usage Examples and Demonstrations"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    436,
                    2640,
                    2108,
                    2828
                ],
                "angle": 0,
                "content": "Scene Understanding and Reasoning. The MIMIC-IT dataset comprises approximately 2.8 million in-context instruction-response pairs, which are structured into a cohesive template to facilitate various tasks. The following template encompasses images, user instructions, and model-generated responses, utilizing the Human and Assistant role labels to enable seamless user-assistant interactions."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    438,
                    2844,
                    1958,
                    2890
                ],
                "angle": 0,
                "content": "<image>Human:{instruction} Assistant:{response}<endofchunk>"
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    436,
                    2917,
                    2024,
                    3006
                ],
                "angle": 0,
                "content": "\\(^{2}\\)https://github.com/explosion/spacy-models/releases/tag/en_core_web_md-3.5.0"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1285,
                    3128
                ],
                "angle": 0,
                "content": "8"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    443,
                    415,
                    2103,
                    778
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Model</td><td rowspan=\"2\">Lang. Decoder</td><td rowspan=\"2\">Avg.</td><td colspan=\"2\">Perception</td><td colspan=\"3\">Reasoning</td></tr><tr><td>Coarse</td><td>Finegrained</td><td>Attribute</td><td>Relation</td><td>Future Pred.</td></tr><tr><td>InstructBLIP [16]</td><td>Vicuna-7B</td><td>50.4</td><td>67.8</td><td>52.2</td><td>43.8</td><td>38.2</td><td>50.0</td></tr><tr><td>MiniGPT-4 [54]</td><td>Vicuna-7B</td><td>51.0</td><td>63.3</td><td>47.8</td><td>50.6</td><td>26.5</td><td>66.7</td></tr><tr><td>OpenFlamingo [6]</td><td>LLaMA-7B</td><td>51.1</td><td>34.4</td><td>40.0</td><td>61.3</td><td>52.9</td><td>66.7</td></tr><tr><td>LLaVA [28]</td><td>Vicuna-7B</td><td>62.7</td><td>44.4</td><td>54.2</td><td>71.9</td><td>76.5</td><td>66.7</td></tr><tr><td>Otter</td><td>LLaMA-7B</td><td>65.5</td><td>68.9</td><td>47.3</td><td>66.3</td><td>61.8</td><td>83.3</td></tr></table>",
                "caption": "Table 2: MMAGIBench evaluation results. Otter outperforms all baseline models by achieving the highest average accuracy in both perception and reasoning tasks."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    433,
                    867,
                    2103,
                    1102
                ],
                "angle": 0,
                "content": "Training the Otter model on the MIMIC-IT dataset allows it to acquire different capacities, as demonstrated by the LA and SD tasks. Trained on the LA task, the model exhibits exceptional scene comprehension, reasoning abilities, and multi-round conversation capabilities. Meanwhile, on the SD task, the model can acquire the ability to adeptly spot general differences or subtle distinctions within daily scenes."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    436,
                    1118,
                    2108,
                    1217
                ],
                "angle": 0,
                "content": "We showcase response examples from the Otter after training on the MIMIC-IT dataset in Fig. 5, highlighting its ability to understand situations and reasoning in a multi-round conversation style."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    1230,
                    2111,
                    1419
                ],
                "angle": 0,
                "content": "Learning with In-context Examples. As mentioned in Sec. 3.1, regarding the concept of organizing visual-language in-context examples, we demonstrate here the acquired ability of the Otter model to follow inter-contextual instructions after training on the LA-T2T task (refer to Appx. for other tasks). The organized input data format is as follows:"
            },
            {
                "block_id": 5,
                "type": "code",
                "bbox": [
                    438,
                    1445,
                    2001,
                    1696
                ],
                "angle": 0,
                "content": "# Multiple in-context example with similar instructions <image>Human:{instruction} Assistant:{response}<endofchunk> # .... <image>Human:{instruction} Assistant:{response}<endofchunk> # Query example <image>Human:{instruction} Assistant:<answer>"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    1745,
                    2103,
                    1841
                ],
                "angle": 0,
                "content": "The Otter model's demonstration of regulating its expressions by referencing in-context examples is illustrated in Fig. 5."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    436,
                    1857,
                    2106,
                    2092
                ],
                "angle": 0,
                "content": "Egocentric Visual Assistant. A distinctive feature of the MIMIC-IT dataset is its inclusion of a comprehensive collection of videos and sequential images in an egocentric view, derived from the IEP, E4D scenarios. In the IEP scenario, the content emphasizes understanding and planning within indoor environments, incorporating instructions and responses designed to guide the model in event planning based on interior layouts."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    433,
                    2108,
                    2108,
                    2527
                ],
                "angle": 0,
                "content": "The E4D scenario, on the other hand, tailors instructions and responses specifically for first-person augmented reality (AR) headset assistant applications. These two datasets collectively serve to bolster the model's proficiency in perceiving scenes from a first-person viewpoint, strategizing for impending tasks, and providing valuable insights and suggestions to AR headset users. Tailored this part of data, we train an egocentric visual assistant, termed Otter-E, which is specifically designed for AR headset applications. MIMIC-IT bolsters the model's proficiency in perceiving scenes from a first-person viewpoint, strategizing for impending tasks, and providing valuable insights and suggestions to AR headset users. As a result, the Otter-E model emerges as an exceptional and visionary Visual Language Model for AR headsets, paving the way for a groundbreaking and immersive experience."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    436,
                    2541,
                    2103,
                    2682
                ],
                "angle": 0,
                "content": "In the bottom image of Fig. 5, Otter-E demonstrates its ability to perceive the first-person view and respond to users' questions, such as guiding users to land a small aircraft (In real-life scenarios, you are not encouraged to consult visual assistants for such hazardous actions)."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    438,
                    2739,
                    925,
                    2788
                ],
                "angle": 0,
                "content": "4.3 ChatGPT Evaluation"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    436,
                    2824,
                    2106,
                    3012
                ],
                "angle": 0,
                "content": "In Tab. 2, we utilize the MMAGIBench framework [43] to provide an extensive evaluation of the perception and reasoning capabilities of vision-language models. The perception benchmark consists of data derived from COCO images and social network images (e.g., Twitter), covering tasks such as coarse scene and object recognition, fine-grained OCR, celebrity identification, and recognition"
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1259,
                    3088,
                    1287,
                    3128
                ],
                "angle": 0,
                "content": "9"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    379,
                    287,
                    969,
                    636
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) Video understanding"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    991,
                    297,
                    1685,
                    636
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) Vision-language model alignment"
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    1700,
                    306,
                    2157,
                    636
                ],
                "angle": 0,
                "content": null,
                "caption": "(c) COCO caption"
            },
            {
                "block_id": 6,
                "type": "image_caption",
                "bbox": [
                    436,
                    722,
                    2103,
                    907
                ],
                "angle": 0,
                "content": "Figure 6: (a) ChatGPT evaluation for video understanding. Otter outperforms baseline models by substantial margins in video understanding. (b) Human evaluation comparison. Otter demonstrates superior usefulness and alignment. (c) Few-shot in-context learning evaluation. Otter outperforms OpenFlamingo as a better in-context and zero-shot learner."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    436,
                    993,
                    2103,
                    1089
                ],
                "angle": 0,
                "content": "of well-known locations. The reasoning benchmark, on the other hand, is performed across three dimensions: attribute reasoning, relation reasoning, and future prediction."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    436,
                    1105,
                    2108,
                    1521
                ],
                "angle": 0,
                "content": "Current evaluation metrics for vision-language models, like VQAv2 [4], exhibit shortcomings in terms of robustness. For instance, VQAv2 primarily assesses single-word or phrase responses, while many modern models generate sentence outputs. To bridge this gap, we evaluate the models by asking ChatGPT to compare their label predictions with the ground truth labels for each input. A test sample is considered correct if ChatGPT's response indicates that the prediction aligns with the corresponding label. For a more in-depth understanding of MMAGIBench, we recommend referring to the original source [43]. Fig. 6 (a) demonstrates that Otter outperforms VideoChatGPT [26] by \\(6.8\\%\\) accuracy and \\(1.8\\%\\) on MSVD [9] 0-shot question answering and captioning benchmarks respectively. Similar substantial margins are also observed on the MSRVTT [49] dataset."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    438,
                    1570,
                    884,
                    1617
                ],
                "angle": 0,
                "content": "4.4 Human Evaluation"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    436,
                    1656,
                    2103,
                    1980
                ],
                "angle": 0,
                "content": "Multi-Modality Arena [32] uses an Elo rating system to evaluate the usefulness and alignment of VLM responses. The Elo rating system calculates the relative skill levels of players, as commonly used in chess and other competitive games. The difference in Elo ratings between the two models predicts the outcome if they were matched against each other. This system works well for evaluating conversational AI models, because multiple models can have pairwise \"battles\" responding to the same inputs in a user-blind evaluation. Fig. 6(b) shows that Otter demonstrates superior usefulness and alignment, achieving the highest Elo rating among recent VLMs."
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    438,
                    2029,
                    1405,
                    2075
                ],
                "angle": 0,
                "content": "4.5 Few-shot In-context Learning Metric Evaluation"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    436,
                    2112,
                    2103,
                    2300
                ],
                "angle": 0,
                "content": "Otter is finetuned based on OpenFlamingo, an architecture designed for multi-modal in-context learning. Finetuned with the MIMIC-IT dataset, Otter outperforms OpenFlamingo by a substantial margin on COCO caption (CIDEr) [27] few-shot evaluation (see Fig. 6(c)). As expected, the finetuning also brings marginal performance gain on zero-shot evaluation."
            },
            {
                "block_id": 13,
                "type": "title",
                "bbox": [
                    438,
                    2359,
                    752,
                    2409
                ],
                "angle": 0,
                "content": "5 Discussion"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    436,
                    2461,
                    2108,
                    2603
                ],
                "angle": 0,
                "content": "Limitations. Though we have iteratively refined the system message and instruction-response examples, ChatGPT is prone to language hallucinations therefore it might generate incorrect responses. Generally, more trustworthy language models are desired for self-instruct data generation."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    436,
                    2620,
                    2108,
                    2762
                ],
                "angle": 0,
                "content": "Future Works. In the future, we plan to support more embodied AI datasets such as LanguageTable [29] and SayCan [1]. We also consider improving the instruction collection with more trustworthy language models or generation techniques."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    436,
                    2778,
                    2103,
                    3006
                ],
                "angle": 0,
                "content": "Conclusion. In this work, we propose MIMIC-IT, a large-scale multi-modal in-context instruction tuning dataset. We leverage an automatic pipeline, Syphus, to enable this dataset to cover a diverse set of visual scenes and creative instructions in eight languages. MIMIC-IT empowers our model, Otter, to achieve state-of-the-art performances in perception and reasoning benchmarks as well as human evaluations."
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1297,
                    3128
                ],
                "angle": 0,
                "content": "10"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    441,
                    297,
                    1417,
                    359
                ],
                "angle": 0,
                "content": "Acknowledgments and Disclosure of Funding"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    436,
                    399,
                    2111,
                    676
                ],
                "angle": 0,
                "content": "This study is supported by the Ministry of Education, Singapore, under its MOE AcRF Tier 2 (MOE-T2EP20221- 0012), NTU NAP, and under the RIE2020 Industry Alignment Fund - Industry Collaboration Projects (IAF-ICP) Funding Initiative, as well as cash and in-kind contribution from the industry partner(s). We thank Peiyu Fu, Xuli Chen, and Mehdi Cherti for their professional advice on the in-context example of the translation query of Japanese, French, German, Spanish, Korean, and Arabic."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    443,
                    742,
                    685,
                    795
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    464,
                    821,
                    2108,
                    1006
                ],
                "angle": 0,
                "content": "[1] Michael Ahn, Anthony Brohan, Noah Brown, Yevgen Chebotar, Omar Cortes, Byron David, Chelsea Finn, Keerthana Gopalakrishnan, Karol Hausman, Alex Herzog, et al. Do as i can, not as i say: Grounding language in robotic affordances. arXiv preprint arXiv:2204.01691, 2022. 10"
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    464,
                    1039,
                    2111,
                    1227
                ],
                "angle": 0,
                "content": "[2] Jean-Baptiste Alayrac, Jeff Donahue, Pauline Luc, Antoine Miech, Iain Barr, Yana Hasson, Karel Lenc, Arthur Mensch, Katherine Millican, Malcolm Reynolds, et al. Flamingo: a visual language model for few-shot learning. Advances in Neural Information Processing Systems, 35:23716-23736, 2022. 3"
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    464,
                    1263,
                    1122,
                    1316
                ],
                "angle": 0,
                "content": "[3] Alibaba. Tongyi qianwen. 2023. 3"
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    464,
                    1346,
                    2106,
                    1488
                ],
                "angle": 0,
                "content": "[4] Stanislaw Antol, Aishwarya Agrawal, Jiasen Lu, Margaret Mitchell, Dhruv Batra, C Lawrence Zitnick, and Devi Parikh. Vqa: Visual question answering. In Proceedings of the IEEE international conference on computer vision, pages 2425-2433, 2015. 10"
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    464,
                    1521,
                    2108,
                    1659
                ],
                "angle": 0,
                "content": "[5] Akari Asai, Timo Schick, Patrick Lewis, Xilun Chen, Gautier Izacard, Sebastian Riedel, Hannaneh Hajishirzi, and Wen-tau Yih. Task-aware retrieval with instructions. arXiv preprint arXiv:2211.09260, 2022. 1"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    464,
                    1692,
                    2103,
                    1838
                ],
                "angle": 0,
                "content": "[6] Anas Awadalla, Irena Gao, Joshua Gardner, Jack Hessel, Yusuf Hanafy, Wanrong Zhu, Kalyani Marathe, Yonatan Bitton, Samir Gadre, Jenia Jitsev, Simon Kornblith, Pang Wei Koh, Gabriel Ilharco, Mitchell Wortsman, and Ludwig Schmidt. Openflamingo, March 2023. 3, 8, 9"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    464,
                    1867,
                    1927,
                    1920
                ],
                "angle": 0,
                "content": "[7] Baidu. Ernie bot: Enhanced representation through knowledge integration. 2023. 3"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    464,
                    1953,
                    2103,
                    2095
                ],
                "angle": 0,
                "content": "[8] Soravit Changpinyo, Piyush Sharma, Nan Ding, and Radu Soricut. Conceptual 12m: Pushing web-scale image-text pre-training to recognize long-tail visual concepts. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 3558-3568, 2021. 3"
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    464,
                    2125,
                    2108,
                    2313
                ],
                "angle": 0,
                "content": "[9] David Chen and William Dolan. Collecting highly parallel data for paraphrase evaluation. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies, pages 190–200, Portland, Oregon, USA, June 2011. Association for Computational Linguistics. 10"
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    441,
                    2346,
                    2103,
                    2488
                ],
                "angle": 0,
                "content": "[10] Liangyu Chen, Yutong Bai, Siyu Huang, Yongyi Lu, Bihan Wen, Alan L Yuille, and Zongwei Zhou. Making your first choice: To address cold start problem in vision active learning. arXiv preprint arXiv:2210.02442, 2022. 5"
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    441,
                    2517,
                    2103,
                    2663
                ],
                "angle": 0,
                "content": "[11] Liangyu Chen, Bo Li, Sheng Shen, Jingkang Yang, Chunyuan Li, Kurt Keutzer, Trevor Darrell, and Ziwei Liu. Language models are visual reasoning coordinators. In ICLR 2023 Workshop on Mathematical and Empirical Understanding of Foundation Models, 2023. 3"
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    441,
                    2692,
                    2103,
                    2834
                ],
                "angle": 0,
                "content": "[12] Xinlei Chen, Hao Fang, Tsung-Yi Lin, Ramakrishna Vedantam, Saurabh Gupta, Piotr Dólár, and C Lawrence Zitnick. Microsoft coco captions: Data collection and evaluation server. arXiv preprint arXiv:1504.00325, 2015. 3"
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    441,
                    2867,
                    2103,
                    3012
                ],
                "angle": 0,
                "content": "[13] Wei-Lin Chiang, Zhuohan Li, Zi Lin, Ying Sheng, Zhanghao Wu, Hao Zhang, Lianmin Zheng, Siyuan Zhuang, Yonghao Zhuang, Joseph E. Gonzalez, Ion Stoica, and Eric P. Xing. Vicuna: An open-source chatbot impressing gpt-4 with \\(90\\%\\) * chatgpt quality, March 2023. 1, 3"
            },
            {
                "block_id": 16,
                "type": "list",
                "bbox": [
                    441,
                    821,
                    2111,
                    3012
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1295,
                    3128
                ],
                "angle": 0,
                "content": "11"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    443,
                    300,
                    2106,
                    445
                ],
                "angle": 0,
                "content": "[14] Hyung Won Chung, Le Hou, Shayne Longpre, Barret Zoph, Yi Tay, William Fedus, Eric Li, Xuezhi Wang, Mostafa Dehghani, Siddhartha Brahma, et al. Scaling instruction-finetuned language models. arXiv preprint arXiv:2210.11416, 2022. 1"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    443,
                    468,
                    2106,
                    613
                ],
                "angle": 0,
                "content": "[15] Angela Dai, Angel X Chang, Manolis Savva, Maciej Halber, Thomas Funkhouser, and Matthias Nießner. Scannet: Richly-annotated 3d reconstructions of indoor scenes. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 5828–5839, 2017. 5, 7, 15"
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    443,
                    633,
                    2106,
                    778
                ],
                "angle": 0,
                "content": "[16] Wenliang Dai, Junnan Li, Dongxu Li, Anthony Meng Huat Tiong, Junqi Zhao, Weisheng Wang, Boyang Li, Pascale Fung, and Steven C. H. Hoi. Instructclip: Towards general-purpose vision-language models with instruction tuning. CoRR, abs/2305.06500, 2023. 9"
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    443,
                    801,
                    2106,
                    943
                ],
                "angle": 0,
                "content": "[17] Danny Driess, Fei Xia, Mehdi SM Sajjadi, Corey Lynch, Aakanksha Chowdhery, Brian Ichter, Ayzaan Wahid, Jonathan Thompson, Quan Vuong, Tianhe Yu, et al. Palm-e: An embodied multimodal language model. arXiv preprint arXiv:2303.03378, 2023. 1"
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    443,
                    966,
                    2106,
                    1155
                ],
                "angle": 0,
                "content": "[18] Yash Goyal, Tejas Khot, Douglas Summers-Stay, Dhruv Batra, and Devi Parikh. Making the v in vqa matter: Elevating the role of image understanding in visual question answering. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 6904-6913, 2017. 3"
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    443,
                    1178,
                    2106,
                    1369
                ],
                "angle": 0,
                "content": "[19] Kristen Grauman, Andrew Westbury, Eugene Byrne, Zachary Chavis, Antonino Furnari, Rohit Girdhar, Jackson Hamburger, Hao Jiang, Miao Liu, Xingyu Liu, et al. Ego4d: Around the world in 3,000 hours of egocentric video. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition, pages 18995–19012, 2022. 5, 7, 15"
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    443,
                    1392,
                    2106,
                    1584
                ],
                "angle": 0,
                "content": "[20] Ting-Hao K. Huang, Francis Ferraro, Nasrin Mostafazadeh, Ishan Misra, Jacob Devlin, Aishwarya Agrawal, Ross Girshick, Xiaodong He, Pushmeet Kohli, Dhruv Batra, et al. Visual storytelling. In 15th Annual Conference of the North American Chapter of the Association for Computational Linguistics (NAACL 2016), 2016. 5, 6, 15"
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    443,
                    1607,
                    2106,
                    1749
                ],
                "angle": 0,
                "content": "[21] Harsh Jhamtani and Taylor Berg-Kirkpatrick. Learning to describe differences between pairs of similar images. In EMNLP, pages 4024-4034. Association for Computational Linguistics, 2018. 5, 6, 15"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    443,
                    1772,
                    2106,
                    1917
                ],
                "angle": 0,
                "content": "[22] Ranjay Krishna, Kenji Hata, Frederic Ren, Li Fei-Fei, and Juan Carlos Niebles. Densescptioning events in videos. In Proceedings of the IEEE international conference on computer vision, pages 706–715, 2017. 5, 6, 15"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    443,
                    1940,
                    2106,
                    2125
                ],
                "angle": 0,
                "content": "[23] Ranjay Krishna, Yuke Zhu, Oliver Groth, Justin Johnson, Kenji Hata, Joshua Kravitz, Stephanie Chen, Yannis Kalantidis, Li-Jia Li, David A Shamma, et al. Visual genome: Connecting language and vision using crowdsourced dense image annotations. International journal of computer vision, 123:32-73, 2017. 3"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    443,
                    2151,
                    2106,
                    2339
                ],
                "angle": 0,
                "content": "[24] Jie Lei, Licheng Yu, Tamara L Berg, and Mohit Bansal. Tvr: A large-scale dataset for video-subtitle moment retrieval. In Computer Vision-ECCV 2020: 16th European Conference, Glasgow, UK, August 23-28, 2020, Proceedings, Part XXI 16, pages 447-463. Springer, 2020. 5, 6, 15"
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    443,
                    2362,
                    2106,
                    2511
                ],
                "angle": 0,
                "content": "[25] Junnan Li, Dongxu Li, Silvio Savarese, and Steven Hoi. Blip-2: Bootstrapping language-image pre-training with frozen image encoders and large language models. arXiv preprint arXiv:2301.12597, 2023. 3"
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    443,
                    2531,
                    2106,
                    2676
                ],
                "angle": 0,
                "content": "[26] Kunchang Li, Yinan He, Yi Wang, Yizhuo Li, Wenhai Wang, Ping Luo, Yali Wang, Limin Wang, and Yu Qiao. Videochat: Chat-centric video understanding. arXiv preprint arXiv:2305.06355, 2023. 10"
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    443,
                    2699,
                    2106,
                    2890
                ],
                "angle": 0,
                "content": "[27] Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dólar, and C Lawrence Zitnick. Microsoft coco: Common objects in context. In Computer Vision-ECCV 2014: 13th European Conference, Zurich, Switzerland, September 6-12, 2014, Proceedings, Part V 13, pages 740-755. Springer, 2014. 2, 3, 5, 6, 10, 15"
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    443,
                    2913,
                    2106,
                    3012
                ],
                "angle": 0,
                "content": "[28] Haotian Liu, Chunyuan Li, Qingyang Wu, and Yong Jae Lee. Visual instruction tuning. arXiv preprint arXiv:2304.08485, 2023. 2, 3, 5, 6, 9"
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    443,
                    300,
                    2106,
                    3012
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1297,
                    3128
                ],
                "angle": 0,
                "content": "12"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    443,
                    300,
                    2106,
                    445
                ],
                "angle": 0,
                "content": "[29] Corey Lynch, Ayzaan Wahid, Jonathan Tompson, Tianli Ding, James Betker, Robert Baruch, Travis Armstrong, and Pete Florence. Interactive language: Talking to robots in real time. arXiv preprint arXiv:2210.06407, 2022. 10"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    443,
                    468,
                    1308,
                    521
                ],
                "angle": 0,
                "content": "[30] OpenAI. Gpt-4 technical report. 2023. 1, 2, 3"
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    446,
                    544,
                    1226,
                    597
                ],
                "angle": 0,
                "content": "[31] OpenAI. Introducing chatgpt. 2023. 1, 3"
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    443,
                    620,
                    2106,
                    716
                ],
                "angle": 0,
                "content": "[32] OpenGVLab. Multi-modality arena. https://github.com/OpenGVLab/Multi-Modality-Arena, 2023. 3, 10"
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    443,
                    742,
                    2103,
                    841
                ],
                "angle": 0,
                "content": "[33] Vicente Ordonez, Girish Kulkarni, and Tamara Berg. Im2text: Describing images using 1 million captioned photographs. Advances in neural information processing systems, 24, 2011. 3"
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    446,
                    864,
                    2103,
                    960
                ],
                "angle": 0,
                "content": "[34] Baolin Peng, Chunyuan Li, Pengcheng He, Michel Galley, and Jianfeng Gao. Instruction tuning with GPT-4. arXiv preprint arXiv:2304.03277, 2023. 1"
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    443,
                    986,
                    2103,
                    1125
                ],
                "angle": 0,
                "content": "[35] Andy Rosenbaum, Saleh Soltan, Wael Hamza, Yannick Versley, and Markus Boese. Linguist: Language model instruction tuning to generate annotated utterances for intent classification and slot tagging. arXiv preprint arXiv:2209.09900, 2022. 1"
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    443,
                    1151,
                    2103,
                    1293
                ],
                "angle": 0,
                "content": "[36] Christoph Schuhmann, Richard Vencu, Romain Beaumont, Robert Kaczmarczyk, Clayton Mullis, Aarush Katta, Theo Coombes, Jenia Jitsev, and Aran Komatsuzaki. Laion-400m: Open dataset of clip-filtered 400 million image-text pairs. arXiv preprint arXiv:2111.02114, 2021. 3"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    446,
                    1320,
                    1091,
                    1369
                ],
                "angle": 0,
                "content": "[37] SenseTime. Sense nova. 2023. 3"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    443,
                    1395,
                    2108,
                    1584
                ],
                "angle": 0,
                "content": "[38] Piyush Sharma, Nan Ding, Sebastian Goodman, and Radu Soricut. Conceptual captions: A cleaned, hypernymed, image alt-text dataset for automatic image captioning. In Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers), pages 2556–2565, 2018. 3"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    446,
                    1607,
                    2108,
                    1749
                ],
                "angle": 0,
                "content": "[39] Yongliang Shen, Kaitao Song, Xu Tan, Dongsheng Li, Weiming Lu, and Yueting Zhuang. Huggingppt: Solving ai tasks with chatgpt and its friends in huggingface. arXiv preprint arXiv:2303.17580, 2023. 3"
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    446,
                    1775,
                    2103,
                    1867
                ],
                "angle": 0,
                "content": "[40] Charlie Snell, Dan Klein, and Ruiqi Zhong. Learning by distilling context. arXiv preprint arXiv:2209.15189, 2022. 1"
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    446,
                    1897,
                    2103,
                    2039
                ],
                "angle": 0,
                "content": "[41] Alane Suhr, Mike Lewis, James Yeh, and Yoav Artzi. A corpus of natural language for visual reasoning. In Proceedings of the 55th Annual Meeting of the Association for Computational Linguistics (Volume 2: Short Papers), pages 217–223, 2017. 3"
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    443,
                    2065,
                    2108,
                    2204
                ],
                "angle": 0,
                "content": "[42] Rohan Taori, Ishaan Gulrajani, Tianyi Zhang, Yann Dubois, Xuechen Li, Carlos Guestrin, Percy Liang, and Tatsunori B. Hashimoto. Stanford alpaca: An instruction-following llama model. https://github.com/tatsu-lab/stanford_alpaca, 2023.1, 3"
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    443,
                    2230,
                    2108,
                    2366
                ],
                "angle": 0,
                "content": "[43] MMAGIBench Team. Mmagibench: A universal multi-modal benchmark towards artificial general intelligence. https://github.com/open-mmlab/mmagibench, 2023. 3, 9, 10"
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    443,
                    2399,
                    2108,
                    2583
                ],
                "angle": 0,
                "content": "[44] Hugo Touvron, Thibaut Lavril, Gautier Izacard, Xavier Martinet, Marie-Anne Lachaux, Timothée Lacroix, Baptiste Rozière, Naman Goyal, Eric Hambro, Faisal Azhar, Aurelien Rodriguez, Armand Joulin, Edouard Grave, and Guillaume Lample. Llama: Open and efficient foundation language models. arXiv preprint arXiv:2302.13971, 2023. 3"
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    443,
                    2610,
                    2108,
                    2752
                ],
                "angle": 0,
                "content": "[45] Yizhong Wang, Yeganeh Kordi, Swaroop Mishra, Alisa Liu, Noah A Smith, Daniel Khashabi, and Hannaneh Hajishirzi. Self-instruct: Aligning language model with self generated instructions. arXiv preprint arXiv:2212.10560, 2022. 1, 2, 7"
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    443,
                    2778,
                    2108,
                    3012
                ],
                "angle": 0,
                "content": "[46] Yizhong Wang, Swaroop Mishra, Pegah Alipoormolabashi, Yeganeh Kordi, Amirreza Mirzaei, Atharva Naik, Arjun Ashok, Arut Selvan Dhanasekaran, Anjana Arunkumar, David Stap, et al. Super-natural instructions: Generalization via declarative instructions on 1600+ nlp tasks. In Proceedings of the 2022 Conference on Empirical Methods in Natural Language Processing, pages 5085-5109, 2022. 1"
            },
            {
                "block_id": 18,
                "type": "list",
                "bbox": [
                    443,
                    300,
                    2108,
                    3012
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1295,
                    3125
                ],
                "angle": 0,
                "content": "13"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    443,
                    300,
                    2106,
                    442
                ],
                "angle": 0,
                "content": "[47] Jason Wei, Maarten Bosma, Vincent Y. Zhao, Kelvin Guu, Adams Wei Yu, Brian Lester, Nan Du, Andrew M. Dai, and Quoc V. Le. Finetuned language models are zero-shot learners. In ICLR. OpenReview.net, 2022. 1"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    443,
                    468,
                    2108,
                    610
                ],
                "angle": 0,
                "content": "[48] Chenfei Wu, Shengming Yin, Weizhen Qi, Xiaodong Wang, Zecheng Tang, and Nan Duan. Visual chatgpt: Talking, drawing and editing with visual foundation models. arXiv preprint arXiv:2303.04671, 2023. 3"
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    446,
                    640,
                    2103,
                    782
                ],
                "angle": 0,
                "content": "[49] Jun Xu, Tao Mei, Ting Yao, and Yong Rui. Msr-vtt: A large video description dataset for bridging video and language. In 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR), pages 5288-5296, 2016. 10"
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    446,
                    808,
                    2103,
                    907
                ],
                "angle": 0,
                "content": "[50] Zhiyang Xu, Ying Shen, and Lifu Huang. Multiinstruct: Improving multi-modal zero-shot learning via instruction tuning. arXiv preprint arXiv:2212.10773, 2022. 3"
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    446,
                    933,
                    2103,
                    1032
                ],
                "angle": 0,
                "content": "[51] Rui Yang, Lin Song, Yanwei Li, Sijie Zhao, Yixiao Ge, Xiu Li, and Ying Shan. Gpt4tools: Teaching large language model to use tools via self-instruction. 2023. 1"
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    446,
                    1059,
                    2106,
                    1201
                ],
                "angle": 0,
                "content": "[52] Zhengyuan Yang, Linjie Li, Jianfeng Wang, Kevin Lin, Ehsan Azarnasab, Faisal Ahmed, Zicheng Liu, Ce Liu, Michael Zeng, and Lijuan Wang. Mm-react: Prompting chatgpt for multimodal reasoning and action. arXiv preprint arXiv:2303.11381, 2023. 3"
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    446,
                    1227,
                    2106,
                    1369
                ],
                "angle": 0,
                "content": "[53] Renrui Zhang, Jiaming Han, Aojun Zhou, Xiangfei Hu, Shilin Yan, Pan Lu, Hongsheng Li, Peng Gao, and Yu Qiao. Llama-adapter: Efficient fine-tuning of language models with zero-init attention. arXiv preprint arXiv:2303.16199, 2023. 3"
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    443,
                    1395,
                    2108,
                    1537
                ],
                "angle": 0,
                "content": "[54] Deyao Zhu, Jun Chen, Xiaogian Shen, Xiang Li, and Mohamed Elhoseiny. Minigpt-4: Enhancing vision-language understanding with advanced large language models. arXiv preprint arXiv:2304.10592, 2023. 3, 5, 9"
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    446,
                    1567,
                    2108,
                    1709
                ],
                "angle": 0,
                "content": "[55] Wanrong Zhu, Jack Hessel, Anas Awadalla, Samir Yitzhak Gadre, Jesse Dodge, Alex Fang, Youngjae Yu, Ludwig Schmidt, William Yang Wang, and Yejin Choi. Multimodal C4: An open, billion-scale corpus of images interleaved with text. arXiv preprint arXiv:2304.06939, 2023. 3"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    446,
                    1735,
                    2103,
                    1877
                ],
                "angle": 0,
                "content": "[56] Yuke Zhu, Oliver Groth, Michael Bernstein, and Li Fei-Fei. Visual7w: Grounded question answering in images. In Proceedings of the IEEE conference on computer vision and pattern recognition, pages 4995–5004, 2016. 3"
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    446,
                    1904,
                    2108,
                    2049
                ],
                "angle": 0,
                "content": "[57] Xueyan Zou, Zi-Yi Dou, Jianwei Yang, Zhe Gan, Linjie Li, Chunyuan Li, Xiyang Dai, Harkirat Behl, Jianfeng Wang, Lu Yuan, et al. Generalized decoding for pixel, image, and language. arXiv preprint arXiv:2212.11270, 2022. 3"
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    443,
                    300,
                    2108,
                    2049
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1297,
                    3128
                ],
                "angle": 0,
                "content": "14"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    438,
                    297,
                    1246,
                    356
                ],
                "angle": 0,
                "content": "A Total Cost and ChatGPT Version"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    436,
                    399,
                    2103,
                    534
                ],
                "angle": 0,
                "content": "We construct MIMIC-IT using the ChatGPT-0301 version. Overall, we query 1,006,746,240 tokens (859,677,150 and 147,069,090 for input and output tokens respectively). The estimated total cost is $20134.9248.<sup>3</sup>"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    438,
                    603,
                    1206,
                    666
                ],
                "angle": 0,
                "content": "B Content Copyright and License"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    436,
                    702,
                    1575,
                    752
                ],
                "angle": 0,
                "content": "The license of the datasets we used in this work is illustrated below."
            },
            {
                "block_id": 4,
                "type": "table",
                "bbox": [
                    481,
                    795,
                    2062,
                    1181
                ],
                "angle": 0,
                "content": "<table><tr><td>Visual Data</td><td>Image License</td><td>Instruction-response license</td></tr><tr><td>MS-COCO [27]</td><td>Custom</td><td>CC BY-NC-SA</td></tr><tr><td>Spot-the-diff [21]</td><td>Unknown</td><td>CC BY-NC-SA</td></tr><tr><td>ScanNetv2 [15]</td><td>non-commercial</td><td>CC BY-NC-SA</td></tr><tr><td>ActivityNet Captions [22]</td><td>Unknown</td><td>CC BY-NC-SA</td></tr><tr><td>Visual Storytelling [20]</td><td>Unknown</td><td>CC BY-NC-SA</td></tr><tr><td>TV Captions [24]</td><td>Unknown</td><td>CC BY-NC-SA</td></tr><tr><td>Ego4D [19]</td><td>non-exclusive, non-transferable</td><td>CC BY-NC-SA</td></tr></table>"
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    436,
                    1270,
                    1624,
                    1329
                ],
                "angle": 0,
                "content": "C Sythus: Automatic Instruction Generation Pipeline"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    1372,
                    2108,
                    1560
                ],
                "angle": 0,
                "content": "Safety and Ethical Filtering Since we use GPT to generate instructions and responses, we generally follow the GPT content policy for safe and ethical use. This policy eliminates output that is suspicious for unfair opportunities, stereotyping, overrepresentation/underrepresentation, explicit content, disinformation, or unreliable information."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    436,
                    1607,
                    2103,
                    1749
                ],
                "angle": 0,
                "content": "Multi-lingual Support We enrich the datasets by translating the English instruction-response pairs by GPT into 7 additional languages: Chinese, Japanese, Spanish, German, French, Korean, and Arabic. See the prompt for multi-lingual translation query in Fig. 7."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    438,
                    1811,
                    961,
                    1867
                ],
                "angle": 0,
                "content": "D Annotation Prompt"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    436,
                    1910,
                    2103,
                    2009
                ],
                "angle": 0,
                "content": "In this section, we will present prompts for querying ChatGPT of all datasets in detail. Each prompt contains system message, in-context emample."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    489,
                    2960,
                    1111,
                    3009
                ],
                "angle": 0,
                "content": "3 https://openai.com/pricing"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1252,
                    3085,
                    1297,
                    3128
                ],
                "angle": 0,
                "content": "15"
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    438,
                    623,
                    2103,
                    2593
                ],
                "angle": 0,
                "content": "<table><tr><td>English</td></tr><tr><td>Input: Hey, bro, I feel like having a cup of tea here! Response: Having tea is a great choice! Right now, you have two options in front of you: green tea and oolong tea. Which one would you like to have? Of course, if you want to enhance the tea-drinking experience even more, you can dim the lights here and play some classic Chinese music on your phone!</td></tr><tr><td>Chinese 中文</td></tr><tr><td>Input: 嗯, 兄弟, 我想在这里喝口茶! Response: 嗪! 喝茶是个不错的选择! 现在你面前有绿茶和乌龙茶, 你想喝哪种呢? 当然, 如果你想有更好的品茶氛围的话, 你可以把这里的灯光调暗, 再用你的手机来点经典的中国音乐!</td></tr><tr><td>Spanish español</td></tr><tr><td>Input: jeh, tí, me apetece.tomar una taza de caféalready! Response: JTomar tí es una muy buena elección! ¿Cuál te gustaría tomatoes? Por supuesto, si quierres disfurtar=aún más de la experiencia de tomatoes,=puedes atenuar las luces deAquíyreproducirmúsica clásicachinadesde tu Telefonomóvil.</td></tr><tr><td>Japanese 日本語</td></tr><tr><td>Input: ねえ、ごこでお茶を飲むたな! Response: お茶を飲むのははい選択だよ!今、目的には緑茶とウーロン茶のはみが、どらが飲むたけすか?もろん、まっ良いお茶の時間を過ごしぃんだら、ごこへの照明を暗て、あたたの携帯で中国的ラフツク音楽を流むしぃさ!</td></tr><tr><td>French Français</td></tr><tr><td>Input: Hé, j&#x27;ai envie de prendre une tasse de thé ici! Response: Prendre du thé est un excellent choix! Maintenant, devant toi, tu as lechoix entre du thé vert et du thé oolong. Lequel aimerais-tu prendre? Bien sür, situ veux vivre une expérience de dégustation de thé encore(Meilleure, tu peux baisserles lumières ici et jour de la musique chinoise classique sur ton téléphone!</td></tr><tr><td>Korean 한국어</td></tr><tr><td>Input: 어로, 어가서 썸한 친마시고심어! Response: iturma hiếng Yeskayin sechtrakipohai! Just right when the sound is heard, the sound will be heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is heard by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is held by the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldby the sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sound. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue. Just right when the sound is heldbythe sourdengue.</td></tr><tr><td>German Deutsch</td></tr><tr><td>Input: Hey, ich möchte hiergereine Tasse Tee trinken! Response: Hallo! Tee zu trinken ist eine gute Wahl! Sie haben jetzt grünten Tee und Oolong-Tee vor sich, welchen möchten Sie trinken? Selfestverständlich können Sie auchdas Licht dimmen und klassische chinesische Musik auf Ihr hem Handy abspielen, wennSie eine bessere Atmosphäre einer TeeverkostungGENiebenmögenmögen!</td></tr><tr><td>Arabic الحرفية</td></tr><tr><td>Input: ! Li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li li ll</td></tr></table>",
                "caption": "Figure 7: In-context examples for multi-lingual translation query."
            },
            {
                "block_id": 2,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1300,
                    3128
                ],
                "angle": 0,
                "content": "16"
            }
        ]
    },
    {
        "page_id": 16,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    530,
                    745,
                    800,
                    785
                ],
                "angle": 0,
                "content": "System Message"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    527,
                    788,
                    2014,
                    867
                ],
                "angle": 0,
                "content": "You are an AI assistant that can understand video and reason about what happens in the provided video. You can observe multiple frames in a video with the provided descriptions."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    527,
                    871,
                    2014,
                    953
                ],
                "angle": 0,
                "content": "Design a conversation between you and a person asking about this video. The answers should be in a tone that a visual AI assistant is seeing the video and answering the question."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    530,
                    953,
                    1718,
                    996
                ],
                "angle": 0,
                "content": "Ask multiple diverse questions and give each question a corresponding answer."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    527,
                    996,
                    2014,
                    1118
                ],
                "angle": 0,
                "content": "In the questions you ask, try to incorporate speculations about the relationships between the characters and their motivations. You need to design questions that require a certain degree of reasoning to answer, prompting the need for logical deduction before arriving at a response."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    527,
                    1122,
                    2014,
                    1244
                ],
                "angle": 0,
                "content": "When using the information from the description, directly explain the scene and do not mention anything about the descriptions. When you are unsure about the answer, you can say you are not certain and provide a reasonable guess."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    527,
                    1247,
                    2014,
                    1366
                ],
                "angle": 0,
                "content": "Please always use pronouns when referring to individuals and avoid directly using the names mentioned in the description. For example, Monica should be \"the female character\". Ross should be \"the male character\"."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    530,
                    1369,
                    1328,
                    1412
                ],
                "angle": 0,
                "content": "Answer yes if you understand the above instructions."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    530,
                    1452,
                    869,
                    1494
                ],
                "angle": 0,
                "content": "In-context Examples"
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    532,
                    1494,
                    622,
                    1531
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    532,
                    1534,
                    1820,
                    1574
                ],
                "angle": 0,
                "content": "1. Monica says something to Ross, who is standing next to the door, sadly look down."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    532,
                    1577,
                    1338,
                    1613
                ],
                "angle": 0,
                "content": "2. Monica is talking to Ross then Rachel look at him."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    532,
                    1617,
                    1262,
                    1656
                ],
                "angle": 0,
                "content": "3. Rachel says she is surprised by Ross' actions."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    532,
                    1659,
                    1662,
                    1699
                ],
                "angle": 0,
                "content": "4. Monica kneels on the floor and talks to Ross who's standing by the door."
            },
            {
                "block_id": 14,
                "type": "list",
                "bbox": [
                    532,
                    1534,
                    1820,
                    1699
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    530,
                    1739,
                    691,
                    1778
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    532,
                    1782,
                    2014,
                    1861
                ],
                "angle": 0,
                "content": "\"Question\": \"How does the male character appear when the female character talks to him by the door?\""
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    532,
                    1864,
                    2014,
                    1947
                ],
                "angle": 0,
                "content": "\"Answer\": \"The male character appears to be feeling sad, as he is looking down while the female character speaks to him.\""
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    532,
                    1950,
                    2014,
                    2029
                ],
                "angle": 0,
                "content": "\"Question\": \"What is another character's reaction to the conversation between the female character and the male character?\""
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    532,
                    2032,
                    2014,
                    2115
                ],
                "angle": 0,
                "content": "\"Answer\": \"The other character seems to be observing the conversation, as they look at the male character while the female character is talking to him.\""
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    532,
                    2118,
                    2014,
                    2158
                ],
                "angle": 0,
                "content": "\"Question\": \"How does the other character express their feelings about the male character's actions?\""
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    532,
                    2158,
                    2014,
                    2237
                ],
                "angle": 0,
                "content": "\"Answer\": \"The other character expresses surprise at the male character's actions, indicating that his behavior might have been unexpected or out of character.\""
            },
            {
                "block_id": 22,
                "type": "text",
                "bbox": [
                    532,
                    2240,
                    2014,
                    2319
                ],
                "angle": 0,
                "content": "\"Question\": \"What change in position does the female character make while speaking to the male character near the door?\""
            },
            {
                "block_id": 23,
                "type": "text",
                "bbox": [
                    532,
                    2323,
                    2014,
                    2409
                ],
                "angle": 0,
                "content": "\"Answer\": \"The female character kneels on the floor while talking to the male character, possibly to create a more intimate or empathetic connection with him during their conversation.\""
            },
            {
                "block_id": 24,
                "type": "list",
                "bbox": [
                    532,
                    1782,
                    2014,
                    2409
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 25,
                "type": "table_caption",
                "bbox": [
                    530,
                    2537,
                    2004,
                    2590
                ],
                "angle": 0,
                "content": "Table 3: System message and in-context exemplars for TV show Captions (TVC) query."
            },
            {
                "block_id": 26,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1295,
                    3125
                ],
                "angle": 0,
                "content": "17"
            }
        ]
    },
    {
        "page_id": 17,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    530,
                    495,
                    800,
                    537
                ],
                "angle": 0,
                "content": "System Message"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    527,
                    537,
                    2019,
                    663
                ],
                "angle": 0,
                "content": "You are an AI assistant that can understand videos. You can observe multiple frames in the given video. You are provided with the timestamps and corresponding descriptions in the following format: timestamps: [[0, 19], [17, 60]]"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    527,
                    663,
                    2019,
                    745
                ],
                "angle": 0,
                "content": "sentences: [\"A young woman is seen standing in a room and leads into her dancing.\", \"The girl dances around the room while the camera captures her movements.\""
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    527,
                    745,
                    2019,
                    914
                ],
                "angle": 0,
                "content": "The first description \"A young woman is seen standing in a room and leads into her dancing.\" is happening from 0 to 19 seconds, while the second description is happening from 17 to 60 seconds. Design a conversation between you and a person asking about this video. The answers should be in a tone that a visual AI assistant is seeing the video and answering the question."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    530,
                    914,
                    1364,
                    953
                ],
                "angle": 0,
                "content": "Ask diverse questions and give corresponding answers."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    527,
                    953,
                    2019,
                    1118
                ],
                "angle": 0,
                "content": "Include questions asking about the visual content of the video. The questions you pose can include the actions and behaviors of people or objects in the video, the chronological order of events, and causal relationships. Only include questions that have definite answers. Do not ask any question that cannot be answered confidently."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    527,
                    1118,
                    2019,
                    1247
                ],
                "angle": 0,
                "content": "When using the information from the description, directly explain the scene and do not mention anything about the descriptions. When you are unsure about the answer, you can say you are not certain and provide a reasonable guess."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    530,
                    1283,
                    869,
                    1329
                ],
                "angle": 0,
                "content": "In-context Examples"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    532,
                    1329,
                    622,
                    1366
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    532,
                    1366,
                    1188,
                    1409
                ],
                "angle": 0,
                "content": "timesteps: [[0, 91], [73, 174], [168, 212]]"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    527,
                    1409,
                    2019,
                    1537
                ],
                "angle": 0,
                "content": "sentences: [\"Several shots of boats are shown riding around as well as people riding on the boats and speaking to one another.\", \"Several shots are then shown of people sitting on the water as well as life under the water.\", \"The camera pans around old cars under water as well as people in the area.\"]"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    530,
                    1574,
                    691,
                    1613
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    532,
                    1617,
                    1326,
                    1656
                ],
                "angle": 0,
                "content": "\"Question\": \"What is the main theme of this video?\""
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    527,
                    1656,
                    2019,
                    1742
                ],
                "angle": 0,
                "content": "\"Answer\": \"The main theme of this video is centered around water activities, featuring scenes of boats, people on boats, underwater life, and exploring underwater areas with old cars.\""
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    532,
                    1742,
                    1303,
                    1782
                ],
                "angle": 0,
                "content": "\"Question\": \"What are people doing on the boats?\""
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    532,
                    1782,
                    2014,
                    1824
                ],
                "angle": 0,
                "content": "\"Answer\": \"People on the boats are riding around and engaging in conversations with one another.\""
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    532,
                    1824,
                    1300,
                    1864
                ],
                "angle": 0,
                "content": "\"Question\": \"What happens after the boat scenes?\""
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    527,
                    1864,
                    2019,
                    1950
                ],
                "angle": 0,
                "content": "\"Answer\": \"After the boat scenes, the video shows several shots of people sitting on the water and exploring life beneath the water's surface.\""
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    532,
                    1950,
                    1275,
                    1989
                ],
                "angle": 0,
                "content": "\"Question\": \"Is there any dialogue in the video?\""
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    527,
                    1989,
                    2019,
                    2069
                ],
                "angle": 0,
                "content": "\"Answer\": \"Yes, there is dialogue in the video as people are shown speaking to one another while on the boats.\""
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    532,
                    2072,
                    1249,
                    2115
                ],
                "angle": 0,
                "content": "\"Question\": \"What is the setting of this video?\""
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    527,
                    2115,
                    2019,
                    2197
                ],
                "angle": 0,
                "content": "\"Answer\": \"The setting of this video is primarily in and around a body of water, featuring scenes of boats, people on the water, and underwater exploration.\""
            },
            {
                "block_id": 22,
                "type": "text",
                "bbox": [
                    532,
                    2197,
                    1405,
                    2240
                ],
                "angle": 0,
                "content": "\"Question\": \"What type of boats are shown in the video?\""
            },
            {
                "block_id": 23,
                "type": "text",
                "bbox": [
                    527,
                    2240,
                    2019,
                    2323
                ],
                "angle": 0,
                "content": "\"Answer\": \"I am not certain about the exact types of boats shown in the video, but multiple boats are featured, and people are enjoying their time riding around on them.\""
            },
            {
                "block_id": 24,
                "type": "text",
                "bbox": [
                    532,
                    2323,
                    1463,
                    2362
                ],
                "angle": 0,
                "content": "\"Question\": \"Why are all the subsequent scenes underwater?\""
            },
            {
                "block_id": 25,
                "type": "text",
                "bbox": [
                    527,
                    2362,
                    2019,
                    2445
                ],
                "angle": 0,
                "content": "\"Answer\": \"Because the cameraperson is using a GoPro-like camera to enter the water and capture the underwater scenes.\""
            },
            {
                "block_id": 26,
                "type": "text",
                "bbox": [
                    527,
                    2445,
                    2019,
                    2527
                ],
                "angle": 0,
                "content": "\"Question\": \"Are there any safety measures observed in the video, such as life jackets or flotation devices?\""
            },
            {
                "block_id": 27,
                "type": "text",
                "bbox": [
                    527,
                    2527,
                    2019,
                    2659
                ],
                "angle": 0,
                "content": "\"Answer\": \"I cannot confidently determine the specific safety measures employed in the video. It is essential, however, that people engaging in water activities should prioritize safety and use appropriate equipment, such as life jackets and flotation devices.\""
            },
            {
                "block_id": 28,
                "type": "text",
                "bbox": [
                    568,
                    2788,
                    1966,
                    2841
                ],
                "angle": 0,
                "content": "Table 4: System message and in-context exemplars for Dense Caption (DC) query."
            },
            {
                "block_id": 29,
                "type": "page_number",
                "bbox": [
                    1252,
                    3088,
                    1295,
                    3128
                ],
                "angle": 0,
                "content": "18"
            }
        ]
    },
    {
        "page_id": 18,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    530,
                    369,
                    800,
                    412
                ],
                "angle": 0,
                "content": "System Message"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    527,
                    415,
                    2017,
                    577
                ],
                "angle": 0,
                "content": "As an augmented reality (AR) assistant integrated within a pair of smart glasses, your capabilities extend to interpreting video footage from a first-person perspective. Each frame of the video is at your disposal, complete with timestamps, object identifications, and descriptions of the scene. Use this information to anticipate potential user queries and provide helpful and relevant responses."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    527,
                    580,
                    2019,
                    956
                ],
                "angle": 0,
                "content": "Envision the user scenarios and questions that might arise based on the video, and provide assistance accordingly. Generate user question and assistant answer pairs that encapsulate the visual content of the video, simulate real-life user queries, and offer helpful insights for improved decision-making. For instance, the user could be searching for a particular item or seeking advice on a prospective purchase like a beverage. Utilize your understanding of the context, the objects involved, and their properties to create responses that are plausible, actionable, and health-conscious when appropriate. Before moving forward, ensure you understand the guidelines for question and answer formatting and make the interaction as genuine as possible. Keep in mind, the quality and diversity of these interactions directly contribute to the refinement of your capabilities as a visual assistant."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    530,
                    993,
                    869,
                    1036
                ],
                "angle": 0,
                "content": "In-context Examples"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    532,
                    1036,
                    619,
                    1072
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    530,
                    1075,
                    2017,
                    1201
                ],
                "angle": 0,
                "content": "timestamp: 102 description: man Y stands beside C objects: white couch with pillows on it; a woman with black hair; a clock on the wall; christmas tree in the corner of the room; black and white picture frames; a bald-headed man; a window in the room;"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    527,
                    1240,
                    2017,
                    1366
                ],
                "angle": 0,
                "content": "timestamp: 103 description: The cameraman turns around objects: woman with long dark hair; a TV turned on; a woman looking at a computer; a brightly lit sign; a set of keys on a keyboard; the TV is on;"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    527,
                    1405,
                    2017,
                    1494
                ],
                "angle": 0,
                "content": "timestamp: 104 description: The cameraman walks around objects: the side of the bus; a dark room; a small blue light; a phone screen is on;"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    527,
                    1531,
                    2017,
                    1620
                ],
                "angle": 0,
                "content": "timestamp: 105 description: The cameraman turns on a light switch objects: the side of the bus; a dark room; a small blue light; a phone screen is on;"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    527,
                    1656,
                    2017,
                    1864
                ],
                "angle": 0,
                "content": "timestamp: 109 description: The cameraman turns around objects: a black and pink tie; a white tie on a rack; a red tie; a group of ties; pink tie on black and white ties; a black and white striped tie; a white ceramic vase; red and black ties; red fabric behind green ties; white tie on a suit; a yellow tie; light green tie on the right; a white cloth draped over the left side of the chair; black and red striped tie; red and black shoe;"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    530,
                    1923,
                    568,
                    1947
                ],
                "angle": 0,
                "content": "中"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    530,
                    2029,
                    691,
                    2069
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    530,
                    2072,
                    1583,
                    2112
                ],
                "angle": 0,
                "content": "Question: Where could my favorite dress be? I can't seem to locate it."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    527,
                    2115,
                    2017,
                    2237
                ],
                "angle": 0,
                "content": "Answer: Given the observed video footage, your favorite dress might be in the wardrobe or the cabinet that you opened recently. Please inspect these areas carefully. Do you require further assistance?"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    530,
                    2240,
                    2006,
                    2280
                ],
                "angle": 0,
                "content": "Question: I checked the wardrobe, but the dress isn't there. Any other ideas on where it could be?"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    527,
                    2283,
                    2017,
                    2405
                ],
                "angle": 0,
                "content": "Answer: According to my observations, another plausible location could be draped over the chair that is covered with a white cloth. I suggest you exit the room and inspect that chair. Shall I continue to assist you with this?"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    530,
                    2405,
                    1244,
                    2448
                ],
                "angle": 0,
                "content": "Question: Where can I find my phone charger?"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    527,
                    2448,
                    2019,
                    2613
                ],
                "angle": 0,
                "content": "Answer: Based on the visual data available, the phone charger isn't directly visible in any of the provided frames. However, it could be in the cabinet or the wardrobe that you've recently opened, or near the computer if there's a charging station set up there. I suggest you check these locations. What else can I help?"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    530,
                    2613,
                    1499,
                    2656
                ],
                "angle": 0,
                "content": "Question: Can you identify the time from the clock on the wall?"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    527,
                    2656,
                    2017,
                    2781
                ],
                "angle": 0,
                "content": "Answer: As a visual assistant, I can only provide information based on what I can directly see. In the given frames, there is no detailed view of the clock, making it impossible for me to determine the time. Would you like me to investigate further?"
            },
            {
                "block_id": 20,
                "type": "table_caption",
                "bbox": [
                    632,
                    2880,
                    1907,
                    2933
                ],
                "angle": 0,
                "content": "Table 5: System message and in-context exemplars for Ego4D (E4D) query."
            },
            {
                "block_id": 21,
                "type": "page_number",
                "bbox": [
                    1252,
                    3085,
                    1297,
                    3128
                ],
                "angle": 0,
                "content": "19"
            }
        ]
    },
    {
        "page_id": 19,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    530,
                    495,
                    872,
                    537
                ],
                "angle": 0,
                "content": "In-context Examples"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    532,
                    541,
                    622,
                    574
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    527,
                    577,
                    2017,
                    864
                ],
                "angle": 0,
                "content": "sentences: this full size guitar is leaning against the wall between the bed and the bathroom. its bottom is on the floor and its fretts are along the wall, where it will be tripped over when someone goes to the bathroom at night. in front of a black office chair , there is a desk . above the desk , is a curtain , the curtain is to the left of the refrigerator ,it is beige. this is a round sink. it is next to a toilet. the tall cabinet. the cabinet is next to the desk. the long table. the table is above the stools. it is a white pedestal sink. the sink is in the bathroom, right next to the bedroom area. the sink is to the left as you enter the bathroom. ..."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    527,
                    867,
                    2017,
                    990
                ],
                "angle": 0,
                "content": "Candidate activity and the role who want to do this activity:Hold a party - Human role: A college student. Yoga Session - Human role: Yoga Instructor Home Barista Course - Human role: Coffee Lover"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    527,
                    993,
                    2024,
                    1993
                ],
                "angle": 0,
                "content": "Conversation 1 - Hold a party Human role: A college student Round 1: Human: I want to take a party in this room, what can i do? Assistant: Based on the descriptions provided, the room appears to be a multi-purpose living space with features such as a bed, desk, office chair, kitchen area with a refrigerator and microwave, and a bathroom area with a toilet and sink. Here's what you can do to prepare for a party in this space: 1. Clear the Space: First, make sure that the room is as spacious as possible to accommodate your guests. Relocate the bike that's currently behind the green curtain to another room, if possible. You might want to consider relocating the guitar that's leaning against the wall between the bed and the bathroom to prevent any accidents. 2. Seating: Utilize the office chair, bed, stools by the bar, and the couch for seating. Depending on the number of guests, you might need to bring in additional chairs or cushions. ... The above material is an example for a task. In this task, you are an AI visual assistant that can guide people to do several activities base on your understanding of the layout of a indoor room. First, you will receive around 50 sentences, each describing the same indoor scene you are observing, but focus on the various view (a part of view in this scene). These sentences can help you to understand the layout. Second, you will receive several indoor activities and their related human role. Third, based on your understanding of the layout in this room. You should design several conversation between you (answer questions) and a human (ask questions) in this room. Each conversation can guide the human to do the activities you received. You should select activities from the candidates. The chosen activities should be the most suitable considering the layout of the room. You and the human should be in a tone that you are seeing the layout in this room.Please ensure a diverse range of sentence structures in the tone of human and assistant. Again, do not ask about uncertain details. Provide detailed answers when answering complex questions. For example, give detailed examples or reasoning steps to make the content more convincing and well-organized. You can include multiple paragraphs if necessary. Answer me 'understood' if you are understood this task. And tell me what is this task."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    530,
                    2029,
                    691,
                    2069
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    527,
                    2072,
                    2024,
                    2659
                ],
                "angle": 0,
                "content": "Understood. This task involves acting as an AI visual assistant to guide humans in performing various activities in an indoor room. I'll be provided with around 50 sentences that describe the layout of the room from various perspectives, which will help me understand the layout of the room. Next, I'll be given several indoor activities and their related human roles. My job is to design conversations between the human and me (the AI), using my understanding of the room layout to guide the human in performing the given activities. This could involve answering questions from the human about how to go about the activities within the constraints of the room layout. The tone of the conversation should reflect that both the AI and the human are observing the room layout. The dialogue should vary in sentence structure and provide detailed answers to complex questions. I need to ensure that my responses are detailed and well-reasoned to make them more convincing and well-organized. In cases where the proposed activities might not be well-suited to the room layout, I need to creatively figure out ways to help the human carry out the activities within the given constraints. In other words, I'm expected to assist in navigating the room and coordinating activities based on my understanding of the room's layout."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    510,
                    2755,
                    2029,
                    2811
                ],
                "angle": 0,
                "content": "Table 6: System message and in-context exemplars for Indoor Event Planning (IEP) query."
            },
            {
                "block_id": 8,
                "type": "page_number",
                "bbox": [
                    1249,
                    3085,
                    1300,
                    3128
                ],
                "angle": 0,
                "content": "20"
            }
        ]
    },
    {
        "page_id": 20,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    530,
                    683,
                    800,
                    722
                ],
                "angle": 0,
                "content": "System Message"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    527,
                    726,
                    2017,
                    848
                ],
                "angle": 0,
                "content": "You are an AI assistant playing the spot the difference game. You will be presented with several sentences that describe the differences between two images. The two images are frames extracted from the video-surveillance footage."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    527,
                    848,
                    2017,
                    1052
                ],
                "angle": 0,
                "content": "Your response shall always contain a pair of question and answer. The question you generate should have definite and concrete answer according to the description. When generating answer, you should answer as if you are watching the images. You are not allowed to say \"according to description\" or similar words in your outputs. You do not have to provide a specific answer and you should not ask for more details."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    527,
                    1056,
                    2017,
                    1141
                ],
                "angle": 0,
                "content": "Each description mentioned in each round of conversation is independent. You should not assume that the descriptions in a new round of conversation are related to the previous context."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    527,
                    1141,
                    1598,
                    1181
                ],
                "angle": 0,
                "content": "If there are no differences, you still have to follow the previous format."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    530,
                    1224,
                    869,
                    1263
                ],
                "angle": 0,
                "content": "In-context Examples"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    532,
                    1267,
                    619,
                    1303
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    532,
                    1306,
                    1318,
                    1349
                ],
                "angle": 0,
                "content": "the car in the upper left corner of the picture is gone"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    532,
                    1353,
                    1361,
                    1389
                ],
                "angle": 0,
                "content": "the two people in the upper part of the picture are gone"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    532,
                    1392,
                    1644,
                    1428
                ],
                "angle": 0,
                "content": "the person near the handicapped parking place is not in the second picture"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    532,
                    1432,
                    2017,
                    1514
                ],
                "angle": 0,
                "content": "there appears to be a figure maybe man that was near handicapped parking place straining near a pole in the bottom of the picture"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    532,
                    1518,
                    1573,
                    1554
                ],
                "angle": 0,
                "content": "the two people who were on th sidewalk are not in the second picture"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    532,
                    1557,
                    1838,
                    1597
                ],
                "angle": 0,
                "content": "there are two people in the second picture that are near the handicapped parking place"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    532,
                    1636,
                    691,
                    1673
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    532,
                    1679,
                    1644,
                    1722
                ],
                "angle": 0,
                "content": "Question: Could you summarize the differences between the two images?"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    532,
                    1722,
                    2017,
                    1841
                ],
                "angle": 0,
                "content": "Answer: The left image has five people and the right image has only three. The people are not the same. The car in the upper left corner of the picture is gone. The remaining elements in the two images are the same."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    532,
                    1844,
                    1591,
                    1887
                ],
                "angle": 0,
                "content": "Question: Does the right image have more people than the left image?"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    532,
                    1890,
                    1593,
                    1930
                ],
                "angle": 0,
                "content": "Answer: Yes, the left image has two more people than the right image."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    532,
                    1933,
                    1925,
                    1970
                ],
                "angle": 0,
                "content": "Question: Does the car in the upper left corner of the picture still exist in the second picture?"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    532,
                    1973,
                    1527,
                    2009
                ],
                "angle": 0,
                "content": "Answer: No, the car in the upper left corner of the picture is gone."
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    532,
                    2013,
                    1552,
                    2052
                ],
                "angle": 0,
                "content": "Question: Does the right image have more cars than the left image?"
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    532,
                    2055,
                    1629,
                    2092
                ],
                "angle": 0,
                "content": "Answer: Yes, the right image has one car while the left image has no car."
            },
            {
                "block_id": 22,
                "type": "text",
                "bbox": [
                    532,
                    2095,
                    1828,
                    2138
                ],
                "angle": 0,
                "content": "Question: Does the people in the left image the same as the people in the right image?"
            },
            {
                "block_id": 23,
                "type": "text",
                "bbox": [
                    532,
                    2138,
                    1889,
                    2178
                ],
                "angle": 0,
                "content": "Answer: No, the people in the left image are not the same as the people in the right image."
            },
            {
                "block_id": 24,
                "type": "text",
                "bbox": [
                    532,
                    2220,
                    619,
                    2257
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 25,
                "type": "text",
                "bbox": [
                    532,
                    2260,
                    1244,
                    2303
                ],
                "angle": 0,
                "content": "There is no difference between the two images."
            },
            {
                "block_id": 26,
                "type": "text",
                "bbox": [
                    532,
                    2343,
                    691,
                    2379
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 27,
                "type": "text",
                "bbox": [
                    532,
                    2385,
                    1642,
                    2425
                ],
                "angle": 0,
                "content": "Question: Could you summarize the differences between the two images?"
            },
            {
                "block_id": 28,
                "type": "text",
                "bbox": [
                    532,
                    2428,
                    1382,
                    2468
                ],
                "angle": 0,
                "content": "Answer: There is no difference between the two images."
            },
            {
                "block_id": 29,
                "type": "table_caption",
                "bbox": [
                    530,
                    2570,
                    2009,
                    2623
                ],
                "angle": 0,
                "content": "Table 7: System message and in-context exemplars for Spot The Deference (SD) query."
            },
            {
                "block_id": 30,
                "type": "page_number",
                "bbox": [
                    1249,
                    3085,
                    1295,
                    3128
                ],
                "angle": 0,
                "content": "21"
            }
        ]
    },
    {
        "page_id": 21,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    530,
                    392,
                    800,
                    435
                ],
                "angle": 0,
                "content": "System Message"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    527,
                    435,
                    2017,
                    765
                ],
                "angle": 0,
                "content": "You are an AI assistant equipped with the remarkable ability to understand albums and weave captivating narratives based on their images. While you are unable to directly see the pictures, you have access to the accompanying descriptions, allowing you to gather important context. Your task is to design a conversation that immerses the person inquiring about the album in its captivating stories. As you engage in this creative endeavor, envision yourself as a companion to the person exploring the album. Craft questions that delve into the heart of the content, drawing inspiration from the provided descriptions while avoiding questions that rely solely on visual details that are not accessible. Your goal is to generate meaningful conversations based on the available information."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    527,
                    768,
                    2017,
                    1095
                ],
                "angle": 0,
                "content": "When formulating your responses, aim to express empathy and curiosity, channeling the emotions and narratives conveyed by the images. Utilize the descriptions to vividly describe the scenes, creating a sensory experience that transports the person into the album's world. If there are uncertainties, approach them with humility and offer thoughtful insights based on your accumulated knowledge. Although the information originates from text, your aim is to create an engaging and authentic experience that makes the person feel intimately connected to the album. Leverage your creativity and learning capabilities to generate questions and answers that embody the next generation of large-scale multimodal language models."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    527,
                    1098,
                    2017,
                    1221
                ],
                "angle": 0,
                "content": "Now that you have a clear understanding, proceed with crafting the dialogue, ensuring your questions derive from the given content while maintaining coherence and immersion for the person interacting with the album."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    530,
                    1263,
                    869,
                    1306
                ],
                "angle": 0,
                "content": "In-context Examples"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    530,
                    1306,
                    619,
                    1343
                ],
                "angle": 0,
                "content": "User:"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    527,
                    1346,
                    2014,
                    1425
                ],
                "angle": 0,
                "content": "title: Moreton Bay Fig 1877 description: Believed to be the largest Moreton Bay Fig Tree in the united States"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    527,
                    1428,
                    2014,
                    1551
                ],
                "angle": 0,
                "content": "image: Moreton Bay Fig 1877 tags: santabarbara annotations: [\"it turns out it is a popular attraction here.\", \"there was an informational sign posted near it.\", \"the slack under it had some interesting information ]."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    527,
                    1554,
                    2017,
                    1719
                ],
                "angle": 0,
                "content": "image: Santa Barbara tags: santabarbara annotations: [\"our landmark tree in town was about to be destroyed and cleared for a new mall.\", \"the tree is very unusual, with its roots exposed.\", \"pictures of a tree are taken.\", \"the roots were huge and spread out over the ground.\", \"there was a good view of the water from the tree as well ]."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    527,
                    1722,
                    2017,
                    1890
                ],
                "angle": 0,
                "content": "image: Santa Barbara tags: santabarbara hero winner thegame moretonbayfig contestentry bigmomma gamewinner babymomma superherochallenge challengengeyouwinner pickyourpoison cyninerchallengeyouniner 15challenges challengefactorywinner thechallengeefactory motherofallchallengegroups motherofallchallengeegroupswinner superherochallengegewinner thegamewinner annotations: []"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    530,
                    1894,
                    568,
                    1927
                ],
                "angle": 0,
                "content": "中"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    530,
                    1970,
                    691,
                    2006
                ],
                "angle": 0,
                "content": "ChatGPT:"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    530,
                    2009,
                    1468,
                    2052
                ],
                "angle": 0,
                "content": "Question: f this tree had a voice, what stories would it tell us?"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    527,
                    2052,
                    2017,
                    2300
                ],
                "angle": 0,
                "content": "Answer: This tree might tell us stories about the past, as it has witnessed over a hundred years of history. It could narrate the identity of the people who planted it, their reasons for choosing this location, and their motives and visions. It could describe changes in the surrounding environment, such as urban expansion, population growth, and alterations in the cityscape. It might also share stories about the local people and how they formed a connection with this tree, along with memories of community activities and events from that time."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    527,
                    2303,
                    2019,
                    2504
                ],
                "angle": 0,
                "content": "Question: What makes the Moreton Bay Fig tree in Santa Barbara unique compared to other trees? Answer: The Moreton Bay Fig tree in Santa Barbara is unique because of its distinctive root structure. The roots are exposed and spread out over the ground, creating a captivating and unusual visual display. This feature sets it apart from other trees that typically have their roots buried beneath the soil."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    527,
                    2508,
                    2017,
                    2550
                ],
                "angle": 0,
                "content": "Question: Why did people consider the Moreton Bay Fig tree a popular attraction in Santa Barbara?"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    527,
                    2550,
                    2017,
                    2719
                ],
                "angle": 0,
                "content": "Answer: The Moreton Bay Fig tree became a popular attraction in Santa Barbara due to its remarkable size and captivating appearance. Visitors were drawn to its immense presence and the fascinating sight of its exposed roots. Its reputation as the largest Moreton Bay Fig tree in the United States also contributed to its popularity."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    530,
                    2735,
                    568,
                    2758
                ],
                "angle": 0,
                "content": "中"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    527,
                    2861,
                    2009,
                    2913
                ],
                "angle": 0,
                "content": "Table 8: System message and in-context exemplars for Visual Storytelling (VIST) query."
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    1249,
                    3085,
                    1297,
                    3128
                ],
                "angle": 0,
                "content": "22"
            }
        ]
    }
]