[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    303,
                    158,
                    535,
                    237
                ],
                "angle": 0,
                "content": "Westlaw"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    1522,
                    85,
                    2473,
                    267
                ],
                "angle": 0,
                "content": "EFiled: Jan 14 2013 09:42AM EST Filing ID 48897809 Case Number 515,2012"
            },
            {
                "block_id": 2,
                "type": "header",
                "bbox": [
                    2134,
                    264,
                    2185,
                    306
                ],
                "angle": 0,
                "content": "Pa"
            },
            {
                "block_id": 3,
                "type": "header",
                "bbox": [
                    2185,
                    69,
                    2478,
                    369
                ],
                "angle": 0,
                "content": "MEST"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    366,
                    1216,
                    412
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    290,
                    419,
                    1020,
                    465
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 6,
                "type": "image",
                "bbox": [
                    290,
                    646,
                    341,
                    696
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    290,
                    696,
                    1101,
                    745
                ],
                "angle": 0,
                "content": "Only the Westlaw citation is currently available."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    288,
                    798,
                    1086,
                    894
                ],
                "angle": 0,
                "content": "UNPUBLISHED OPINION. CHECK COURT RULES BEFORE CITING."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    504,
                    956,
                    986,
                    1049
                ],
                "angle": 0,
                "content": "Superior Court of Delaware. Re: Diane HANSON"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    359,
                    1062,
                    1129,
                    1191
                ],
                "angle": 0,
                "content": "V. DELAWARE STATE PUBLIC INTEGRITY COMMISSION."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    494,
                    1254,
                    997,
                    1346
                ],
                "angle": 0,
                "content": "C.A. No. 11A-06-001(ESB). Aug. 30, 2012."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    285,
                    1405,
                    1201,
                    1501
                ],
                "angle": 0,
                "content": "Charles Slanina, Esq., David L. Finger, Esq. Finger, Slanina & Liebesman, LLC, Hockessin, DE."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    285,
                    1557,
                    1201,
                    1656
                ],
                "angle": 0,
                "content": "Janet A. Wright, Esq., Delaware State Public Integrity Commission, Dover, DE."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    288,
                    1712,
                    813,
                    1758
                ],
                "angle": 0,
                "content": "E. SCOTT BRADLEY, Judge."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    372,
                    1762,
                    665,
                    1805
                ],
                "angle": 0,
                "content": "*1 Dear Counsel:"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    285,
                    1864,
                    1208,
                    2923
                ],
                "angle": 0,
                "content": "This is my decision on Diane Hanson's appeal of the Delaware State Public Integrity Commission's (\"PIC\") finding that she violated the State Employees, Officers' and Officials' Code of Conduct (the \"Code of Conduct\") when, as a town commissioner for Dewey Beach, she voted in favor of an ordinance purportedly clarifying the height limit applicable to structures in the Resort Business-1 (\"RB-1\") zoning district in Dewey Beach. This case arises out of the efforts by Dewey Beach Enterprises (\"DBE\") to redevelop a commercial development known as Ruddertowne in Dewey Beach, litigation filed by DBE against Dewey Beach, Hanson and other Dewey Beach officials when its development efforts were unsuccessful, and Dewey Beach's efforts to deal with that litigation. Hanson was at all times relevant hereto a Dewey Beach town commissioner, a resident of Dewey Beach, and an owner of two oceanside rental properties in Dewey Beach. DBE submitted to the Dewey Beach town commissioners a Concept Plan to re-develop Ruddertowne, which is located in the RB-1 zoning district. The Concept Plan proposed, among"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1336,
                    580,
                    2256,
                    2115
                ],
                "angle": 0,
                "content": "other things, a 120 room five-star hotel and condominium in a structure that was to be 68 feet tall. Hanson and all of the other town commissioners voted against the Concept Plan. DBE then filed a lawsuit against Dewey Beach, Hanson and other Dewey Beach officials in the United States District Court for the District of Delaware, alleging a host of constitutional and other violations (the \"Federal Case\"). DBE sued Hanson in both her official and individual capacities. An issue in the lawsuit was whether Dewey Beach's longstanding 35 foot height limit had been relaxed for the RB-1 zoning district when Dewey Beach enacted its 2007 Comprehensive Land Use Plan. While the Federal Case was pending, Hanson and other town commissioners passed an ordinance purportedly clarifying the height limit, stating that it was 35 feet and making it retroactive to the adoption of the 2007 Comprehensive Land Use Plan (the \"Clarifying Ordinance\"). A Dewey Beach property owner then filed a complaint with PIC, alleging that Hanson voted in favor of the Clarifying Ordinance to protect her rental properties from having to compete with DBE's proposed hotel and condominium and to enhance her legal defenses in the Federal Case. PIC investigated the matter, held a \"hearing,\" and concluded that Hanson did have several conflicts of interest and never should have voted in favor of the Clarifying Ordinance. Hanson then filed an appeal of PIC's decision with this Court. I have reversed PIC's decision, concluding that it is not supported by substantial evidence in the record and violates PIC's own rules of procedure."
            },
            {
                "block_id": 18,
                "type": "title",
                "bbox": [
                    1654,
                    2174,
                    1938,
                    2214
                ],
                "angle": 0,
                "content": "I. Ruddertowne"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1333,
                    2220,
                    2254,
                    2894
                ],
                "angle": 0,
                "content": "DBE released its Concept Plan for Ruddertowne to the public on June 15, 2007. Ruddertowne consists of 2.36 acres of land and existing improvements located near Rehoboth Bay on the western side of Coastal Highway in Dewey Beach. The Concept Plan proposed a welcome center, a bayside boardwalk, public restrooms, a 120 room five-star hotel and condominium, public parking, a convention center, and a funland for children in a structure that was to be 68 feet tall. The Ruddertowne Architectural Review Committee, which was created specifically to review the Concept Plan, voted to approve the Concept Plan after seven public meetings. The town commissioners then held a public hearing to introduce an ordinance"
            },
            {
                "block_id": 20,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    148,
                    2256,
                    204
                ],
                "angle": 0,
                "content": "Page 2"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    306,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1208,
                    709
                ],
                "angle": 0,
                "content": "allowing the Concept Plan to proceed and sent the ordinance to the Planing & Zoning Commission for review. The Planning & Zoning Commission voted to reject the ordinance on October 19, 2007. The town commissioners voted unanimously to reject the ordinance on November 10, 2007."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    293,
                    762,
                    1211,
                    1775
                ],
                "angle": 0,
                "content": "*2 DBE then submitted an application for a building permit and a site plan for a three-story, mixed-use structure for an expansion of Ruddertown in early November, 2007. The site plan would expand Ruddertowne by removing portions of the existing commercial building and adding a parking garage and 62 residential units in a structure that would only be 35 feet tall. Dewey Beach told DBE that its alternative plan did not comply with a provision of Dewey Beach's zoning code requiring a 3,600 square-foot lot for each residential unit. DBE appealed this decision to the Board of Adjustment on January 23, 2008. The Board of Adjustment denied DBE's appeal, reasoning that DBE's site plan did not meet the minimum lot requirement. DBE filed an appeal of this decision with the Superior Court, which affirmed the Board of Adjustment's decision.[FN1] DBE then filed an appeal of the Superior Court's decision with the Supreme Court, which reversed the Superior Court's decision and ruled in favor of DBE, concluding that the minimum lot requirement was ambiguous.[FN2]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    436,
                    1828,
                    1208,
                    2022
                ],
                "angle": 0,
                "content": "FN1. Dewey Beach Enterprises, Inc., v. Board of Adjustment of the Town of Dewey Beach, 2009 WL 2365676 (Del.Super. July 30, 2009)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    2075,
                    1206,
                    2227
                ],
                "angle": 0,
                "content": "FN2. Dewey Beach Enterprises, Inc., v. Board of Adjustment of the Town of Dewey Beach, 1 A.3d 305 (Del.2010)."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    283,
                    2277,
                    1203,
                    2663
                ],
                "angle": 0,
                "content": "While DBE's site plan was working its way through the zoning and appeal process, DBE submitted building permit applications to Dewey Beach for Phases II and III of its Concept Plan on April 4, 2008. DBE also repeatedly asked Dewey Beach to either process its building permit applications, or place them before the Board of Adjustment. Dewey Beach did not comply with DBE's requests."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    555,
                    2719,
                    935,
                    2762
                ],
                "angle": 0,
                "content": "II. The Federal Case"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2768,
                    1206,
                    2913
                ],
                "angle": 0,
                "content": "Frustrated with how its development plans were being treated, DBE and Ruddertowne Redevelopment, Inc. (\"RRI\") filed a complaint against Dewey"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1333,
                    415,
                    2256,
                    2009
                ],
                "angle": 0,
                "content": "Beach, Dell Tush (\"Mayor Tush\"), David King (\"King\"), Hanson and Richard Hanewinckel (\"Hanewinckel\") in the United States District Court for the District of Delaware on July 10, 2009. The complaint alleged: (1) violations of substantive due process under 42 U.S.C. § 1983 (Count I); (2) § 1983 violations of procedural due process (Count II); (3) § 1983 violations of the Equal Protection Clause (Count III); (4) regulatory taking (Count IV); (5) 42 U.S.C. § 1985 civil conspiracy (Count V); (6) 42 U.S.C. § 1986 failure to prevent actionable harm (Count VI); (7) First Amendment free speech and petition violations (Count VII); (8) equitable and promissory estoppel (Count VIII, DBE against all defendants; Count IX, RRI against all defendants); and (9) abuse of official power and violation of substantive due process against the individual defendants (Counts X-XIII). In connection with these allegations, DBE sought compensatory and punitive damages, attorneys' fees, costs, pre-and post-judgment interest, and injunctive relief. DBE further alleged that Hanson, Wilson, and Mayor Tush should have recused themselves from the Ruddertowne matters because each owned rental properties in Dewey Beach that would be adversely affected \"should the Concept Plan be approved and built.\" DBE also alleged that these individuals wrongly worked to defeat and/or against its proposed ordinance because of these personal interests. Dewey Beach filed a motion to dismiss the plaintiffs' complaint with respect to all counts. Mayor Tush, King, Hanson, and Hanewinckel (collectively, the \"Individual Defendants\") also filed a motion to dismiss."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1333,
                    2055,
                    2261,
                    2923
                ],
                "angle": 0,
                "content": "*3 Dewey Beach's motion to dismiss set forth nine grounds for dismissal of the plaintiffs' complaint. Specifically, Dewey Beach argued that: (1) DBE's claims challenging Dewey Beach's denial of the RB-1 68 foot ordinance were unripe because DBE failed to seek a variance or other available remedy; (2) because a municipality cannot be held liable for a § 1983 claim under the respondent superior doctrine articulated in Monell v. N.Y. City Dep't of Social Services, \\( \\frac{FN3}{2} \\) DBE did not identify or attribute a wrongful custom or policy to Dewey Beach; (3) DBE's due process rights were not violated because the legislative and executive actions at issue were rationally based and did not shock the conscience; (4) DBE's equal protection claims failed because it did not identify a similarly situated party and Dewey Beach's actions were rationally based; (5) DBE's procedural due process claim failed both because DBE"
            },
            {
                "block_id": 12,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    148,
                    2256,
                    204
                ],
                "angle": 0,
                "content": "Page 3"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1208,
                    1287
                ],
                "angle": 0,
                "content": "did not have a constitutionally protected property right and because there was no viable procedural due process claim for legislative acts; (6) no regulatory taking occurred because DBE had not sought a state remedy and viable uses of the property remained; (7) there were no actionable First Amendment claims because Dewey Beach did not engage in retaliation and would have reached the same determination irrespective of the party involved; (8) the state law estoppel claim failed because the alleged damages were not recoverable in an estoppel claim under Delaware law; and (9) DBE's § 1985 and § 1986 claims failed because the complaint did not allege a conspiracy and no underlying constitutional violation existed. The District Court granted Dewey Beach's motion to dismiss with respect to Count III (Equal Protection) and Counts VIII and IX (Equitable Estoppel), and denied its motion to dismiss in all other respects.[FN4]"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    438,
                    1336,
                    900,
                    1389
                ],
                "angle": 0,
                "content": "FN3. 436 U.S. 658 (1978)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    436,
                    1445,
                    1206,
                    1590
                ],
                "angle": 0,
                "content": "FN4. Dewey Beach Enterprises, Inc., v. Town of Dewey Beach, 2010 WL 3023395 (D.Del. July 30, 2010)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    1643,
                    1211,
                    2280
                ],
                "angle": 0,
                "content": "The Individual Defendants' motion to dismiss set forth three grounds for dismissal of DBE's complaint. Specifically, they argued that the District Court should grant their motion because the Individual Defendants were: (1) immune from suit under the Noerr-Pennington doctrine \\(\\frac{\\mathrm{FN5}}{2}\\); (2) entitled to legislative immunity for all actions involving zoning ordinances; and (3) entitled to qualified immunity for all nonlegislative actions. The District Court rejected the Individual Defendants' Noerr-Pennington doctrine argument and concluded that, given the state of the facts that at the time, the doctrines of legislative immunity and qualified immunity could not be applied."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    436,
                    2326,
                    1206,
                    2524
                ],
                "angle": 0,
                "content": "FN5. See Eastern R.R. Presidents Conf. v. Noerr Motor Freight, Inc., 365 U.S. 127 (1961); United Mine Workers of America v. Pennington, 381 U.S. 657 (1965)."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    479,
                    2577,
                    1014,
                    2623
                ],
                "angle": 0,
                "content": "III. The Clarifying Ordinance"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    283,
                    2623,
                    1206,
                    2910
                ],
                "angle": 0,
                "content": "Although it was hardly mentioned in the District Court's decision, an important issue in the consideration of DBE's Concept Plan and the Federal Case was whether the maximum building height for structures in the RB-1 zoning district was 35 feet. Dewey Beach had adopted its most recent land use plan on"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1336,
                    419,
                    2256,
                    950
                ],
                "angle": 0,
                "content": "June 29, 2007. The 2007 Comprehensive Land Use Plan provided that in the RB-1 zoning district \"Relaxed bulk standards\" were available for contiguous tracts of land consisting of at least 80,000 square feet. Ruddertowne was in the RB-1 zoning district. DBE believed that the maximum building height for the proposed structure in its Concept Plan was also relaxed. However, not everyone shared DBE's view. In order to resolve the issue, Dewey Beach introduced the Clarifying Ordinance, which stated, among other things, that:"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1371,
                    1003,
                    2256,
                    1488
                ],
                "angle": 0,
                "content": "*4 The 2007 Comprehensive Plan provides that in the Resort Business-1 (RB-1) zoning district \"Relaxed bulk standards\" (setbacks, lot coverage, etc.) are available for contiguous tracts consisting of at least 80,000 square feet with a detailed commercial, mixed- and multi-family land-use development-plan review as an overlay district or alternate method of development, provided that there is public access to all common areas of the development and any waterfront area shall be public use."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1371,
                    1541,
                    2256,
                    1973
                ],
                "angle": 0,
                "content": "Section 2. The Commissioners of the Town of Dewey Beach further clarify their intent that \"Relaxed bulk standards\" for contiguous tracts consisting of at least 80,000 square feet, as that phrase is used in the 2007 Comprehensive Plan's description of the RB-1 zoning district, does not permit any height increase beyond 35 feet, which is (and has been) the maximum height in all zoning classifications in Dewey Beach."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1371,
                    2029,
                    2254,
                    2369
                ],
                "angle": 0,
                "content": "Section 4. This Ordinance, upon adoption by a majority vote of all Commissioners of the Town of Dewey Beach, shall be effective immediately and shall apply retroactively to June 29, 2007, the date of adoption of Ordinance No. 597. It is the express intent that this clarification ordinance apply retroactively."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1338,
                    2422,
                    2254,
                    2570
                ],
                "angle": 0,
                "content": "Hanson and two other town commissioners voted in favor of the Clarifying Ordinance on September 11, 2010, causing it to pass."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1519,
                    2623,
                    2073,
                    2673
                ],
                "angle": 0,
                "content": "IV. Joseph Nelson's Complaint"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1336,
                    2673,
                    2254,
                    2910
                ],
                "angle": 0,
                "content": "Joseph W. Nelson, a Dewey Beach property owner and resident of Milton, Delaware, filed a five-page complaint against Hanson with PIC on October 1, 2010. His complaint focused on DBE's efforts to re-develop Ruddertowne and the Clarifying Ordi-"
            },
            {
                "block_id": 17,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    148,
                    2256,
                    201
                ],
                "angle": 0,
                "content": "Page 4"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1216,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    306,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1206,
                    996
                ],
                "angle": 0,
                "content": "nance. Nelson alleged that Hanson violated the Code of Conduct when she voted in favor of the Clarifying Ordinance by (1) intentionally withholding information so that she could mislead the public regarding passage of the Clarifying Ordinance, (2) failing to reveal obvious conflicts of interest, and (3) taking actions in violation of the public trust that reflected unfavorably upon the State and its government. Attached to Nelson's complaint were a copy of the Clarifying Ordinance and a series of e-mails between a State Representative and the State Director of Planning about the Clarifying Ordinance."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    448,
                    1052,
                    1048,
                    1102
                ],
                "angle": 0,
                "content": "V. The Rules for PIC Proceedings"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    283,
                    1102,
                    1208,
                    2204
                ],
                "angle": 0,
                "content": "PIC has adopted rules governing its proceedings.\\(^{FN6}\\) The Code of Conduct also sets forth rules governing how PIC is to proceed.\\(^{FN7}\\) The process generally starts with the filing of a sworn complaint with PIC by a person alleging a violation of the Code of Conduct.\\(^{FN8}\\) PIC then meets to review the complaint to determine if it is frivolous or states a violation.\\(^{FN9}\\) If PIC determines that the complaint sets forth a violation, then PIC sets the matter down for a hearing.\\(^{FN10}\\) PIC's legal counsel is the prosecutor at the hearing.\\(^{FN11}\\) The complaint must be served on the person charged with violating the Code of Conduct.\\(^{FN12}\\) The complaint must specifically identify each portion of the Code of Conduct that the person is alleged to have violated and the facts upon which each alleged violation is based.\\(^{FN13}\\) The burden of proving violations of the Code of Conduct is on the prosecutor and such violations must be proven by clear and convincing evidence.\\(^{FN14}\\) The clear and convincing evidentiary standard is an intermediate evidentiary standard, higher than mere preponderance, but lower than proof beyond a reasonable doubt.\\(^{FN15}\\) The hearing is to proceed as follows:"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    436,
                    2257,
                    1203,
                    2359
                ],
                "angle": 0,
                "content": "FN6. Rules of the Delaware State Public Integrity Commission (\"PIC Rule\")."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    438,
                    2409,
                    851,
                    2461
                ],
                "angle": 0,
                "content": "FN7. 29 Del. C. § 5810"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    438,
                    2514,
                    833,
                    2567
                ],
                "angle": 0,
                "content": "FN8. Id.; PIC Rule III."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    438,
                    2620,
                    821,
                    2673
                ],
                "angle": 0,
                "content": "FN9. PIC Rule III(A)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    438,
                    2725,
                    892,
                    2778
                ],
                "angle": 0,
                "content": "FN10. PIC Rule III(A)(1)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    438,
                    2831,
                    1206,
                    2884
                ],
                "angle": 0,
                "content": "FN11. 29 Del. C. § 5810(a); PIC Rule"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1491,
                    419,
                    1616,
                    465
                ],
                "angle": 0,
                "content": "IV(A)."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1491,
                    521,
                    1930,
                    574
                ],
                "angle": 0,
                "content": "FN12. PIC Rule IV(c)(1)."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1491,
                    627,
                    1930,
                    679
                ],
                "angle": 0,
                "content": "FN13. PIC Rule IV(c)(2)."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1491,
                    732,
                    1884,
                    785
                ],
                "angle": 0,
                "content": "FN14. PIC Rule IV(k)."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1489,
                    838,
                    2256,
                    1036
                ],
                "angle": 0,
                "content": "FN15. ASB Allegiance Real Estate Fund v. Scion Breckenridge Managing Member, LLC, 2012 WL 1869416, (Del. Ch. May 16, 2012)."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1377,
                    1089,
                    2251,
                    1191
                ],
                "angle": 0,
                "content": "*5 (1) The Chairperson or the Chairperson's designee shall open and preside at the hearing."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1377,
                    1244,
                    2126,
                    1293
                ],
                "angle": 0,
                "content": "(2) An opening statement by the Prosecutor."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1377,
                    1349,
                    2142,
                    1399
                ],
                "angle": 0,
                "content": "(3) An opening statement by the Respondent."
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    1377,
                    1452,
                    2249,
                    1547
                ],
                "angle": 0,
                "content": "(4) Witnesses and other evidence by the Prosecutor."
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    1377,
                    1603,
                    2249,
                    1699
                ],
                "angle": 0,
                "content": "(5) Witnesses and other evidence by the Respondent."
            },
            {
                "block_id": 22,
                "type": "text",
                "bbox": [
                    1377,
                    1758,
                    2249,
                    1857
                ],
                "angle": 0,
                "content": "(6) Rebuttal witnesses and other evidence by the Prosecutor, if appropriate."
            },
            {
                "block_id": 23,
                "type": "text",
                "bbox": [
                    1374,
                    1913,
                    2249,
                    2151
                ],
                "angle": 0,
                "content": "(7) Witnesses may be cross-examined by the opposing party. Redirect examination and recross-examination may be permitted in the Commission's discretion. Commission members may also question witnesses."
            },
            {
                "block_id": 24,
                "type": "text",
                "bbox": [
                    1377,
                    2211,
                    2055,
                    2260
                ],
                "angle": 0,
                "content": "(8) Closing argument by the Prosecutor."
            },
            {
                "block_id": 25,
                "type": "text",
                "bbox": [
                    1377,
                    2316,
                    2011,
                    2366
                ],
                "angle": 0,
                "content": "(9) Closing argument by Respondent."
            },
            {
                "block_id": 26,
                "type": "text",
                "bbox": [
                    1374,
                    2418,
                    2249,
                    2517
                ],
                "angle": 0,
                "content": "(10) Rebuttal closing argument by the Prosecutor, if appropriate. FN16"
            },
            {
                "block_id": 27,
                "type": "list",
                "bbox": [
                    1374,
                    1089,
                    2251,
                    2517
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 28,
                "type": "text",
                "bbox": [
                    1489,
                    2574,
                    1889,
                    2623
                ],
                "angle": 0,
                "content": "FN16. PIC Rule IV(L)."
            },
            {
                "block_id": 29,
                "type": "text",
                "bbox": [
                    1336,
                    2679,
                    2256,
                    2923
                ],
                "angle": 0,
                "content": "Four members of PIC constitute a quorum and sanctions may be imposed only by the affirmative action of at least four members. FN17 PIC's decisions must set forth (a) findings of fact based on the evidence, (b) conclusions of law as to whether the Re"
            },
            {
                "block_id": 30,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    148,
                    2256,
                    204
                ],
                "angle": 0,
                "content": "Page 5"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    419,
                    1208,
                    663
                ],
                "angle": 0,
                "content": "spondent has violated the Code of Conduct, and (c) what sanctions PIC is imposing if violations of the Code of Conduct are found. FN18 PIC members, if any, who disagree with PIC's decision may file dissenting opinions. FN19"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    712,
                    1203,
                    815
                ],
                "angle": 0,
                "content": "FN17. PIC Rule IV(N); 29 Del. C. §5808(d)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    438,
                    867,
                    844,
                    920
                ],
                "angle": 0,
                "content": "FN18. PIC Rule IV(O)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    438,
                    973,
                    612,
                    1023
                ],
                "angle": 0,
                "content": "FN19. Id."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    405,
                    1082,
                    1088,
                    1128
                ],
                "angle": 0,
                "content": "VI. PIC's Proceedings Against Hanson"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    1128,
                    1208,
                    1798
                ],
                "angle": 0,
                "content": "Nelson's complaint against Hanson was filed with PIC on October 1, 2010. The Code of Conduct and PIC's rules of procedures require complaints to be sworn. Nelson's complaint was not properly sworn. Nelson signed his complaint twice. Below his second signature, Wendy L. Compton, a notary public for the State of Delaware, signed her name and placed her notary seal below her signature. The requirements for a properly sworn and notarized statement are set forth in 29 Del. C. § 4327. Essentially, Nelson had to swear or affirm that the statements that he was making were true and correct. He did not do that. Nevertheless, PIC accepted his complaint and the allegations in it as true and correct."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    1857,
                    1208,
                    2722
                ],
                "angle": 0,
                "content": "PIC met and voted to proceed against Hanson on October 15, 2010. PIC preliminarily found (the “Preliminary Decision”) that when Hanson voted in favor of the Clarifying Ordinance she violated (1) \\( \\underline{29} \\) Del. C. § 5805(a)(2)(a) and (b) because the Clarifying Ordinance would make it more difficult for DBE's bayside hotel and condominium to compete with her oceanside rental properties; (2) \\( \\underline{29} \\) Del. C. § 5805(b) because the Clarifying Ordinance would aid her defenses in the Federal Case; and (3) \\( \\underline{29} \\) Del. C. § 5806(a) because the public might suspect that she was using her public office to benefit her own interests. The Preliminary Decision was issued on November 22, 2010. Hanson filed a Motion to Stay on February 7, 2011. PIC denied it on February 28, 2011. Hanson filed a Motion to Dismiss and a Response to the Preliminary Complaint on March 8, 2011."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2775,
                    1206,
                    2923
                ],
                "angle": 0,
                "content": "PIC held a hearing on Hanson's Motion to Dismiss on March 15, 2011. Hanson's attorney called Hanson, Glenn C. Mandalas, Esq., and Max B. Wal"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1333,
                    419,
                    2256,
                    1188
                ],
                "angle": 0,
                "content": "ton, Esq., to testify. Mandalas represented Dewey Beach in the Federal Case. Walton represented Hanson and the other individual defendants in the Federal Case. Hanson testified about her longstanding support of the 35 foot height limit, the Clarifying Ordinance, her rental properties, and quality of life issues. Mandalas and Walton testified about the Clarifying Ordinance, the Dewey Beach zoning code and the Federal Case. Hanson's attorney offered the testimony of Hanson, Walton and Mandalas in an effort to show that Hanson had no conflicts of interest when she voted in favor of the Clarifying Ordinance. Even though PIC's counsel had the burden of proof, she called no witnesses and introduced no exhibits. PIC's counsel did cross-examine Hanson and the two lawyers."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1333,
                    1244,
                    2256,
                    1775
                ],
                "angle": 0,
                "content": "*6 PIC denied Hanson's Motion to Dismiss and issued a Final Disposition Opinion on May 13, 2011. Its Final Disposition Opinion was based on Nelson's complaint, an article in the Cape Gazette, advertisements for Hanson's oceanside rental properties, a map of Dewey Beach, the District Court's decision, an open letter from the Dewey Beach town manager about the settlement of the Federal Case, the settlement agreement for the Federal Case, Sussex County tax records for Hanson's properties, and the Dewey Beach zoning map."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1333,
                    1828,
                    2261,
                    2600
                ],
                "angle": 0,
                "content": "PIC found that when Hanson voted in favor of the Clarifying Ordinance she violated (1) 29 Del. C. § 5805(a)(1) because the Clarifying Ordinance would help her rental properties compete with DBE's hotel and condominium, (2) 29 Del. C. § 5805(a)(1) because the Clarifying Ordinance would improve her quality of life, (3) 29 Del. C. § 5805(a)(1) because the Clarifying Ordinance would help her qualified immunity defense in the Federal Case, and (4) 29 Del. C. § 5806(a) because the public might suspect that she was using her public office to benefit her own interests. In reaching its conclusions, PIC found that Hanson had conflicts of interest involving her rental properties, qualified immunity defense in the Federal Case, and quality of life. I have summarized PIC's reasoning as follows:"
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    1522,
                    2653,
                    2070,
                    2699
                ],
                "angle": 0,
                "content": "(a) Hanson's Rental Properties"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1333,
                    2702,
                    2256,
                    2894
                ],
                "angle": 0,
                "content": "Hanson has two oceanside rental properties. DBE wanted to build a 120 room five-star hotel and condominium in a 68 foot tall structure on the bay. Hanson's rental properties and DBE's hotel would"
            },
            {
                "block_id": 16,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    151,
                    2256,
                    201
                ],
                "angle": 0,
                "content": "Page 6"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1208,
                    712
                ],
                "angle": 0,
                "content": "compete with each other for the same tenants. The Clarifying Ordinance would limit DBE's structure to 35 feet, making the hotel smaller or non-existent and a less fearsome competitor to Hanson. Thus, Hanson had an impermissible conflict of interest when she voted in favor of the Clarifying Ordinance."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    494,
                    765,
                    1002,
                    811
                ],
                "angle": 0,
                "content": "(b) Hanson's Quality of Life"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    283,
                    815,
                    1208,
                    1290
                ],
                "angle": 0,
                "content": "Hanson was concerned about her quality of life. She believed that DBE's large structure would bring in more traffic and people and diminish her quality of life. The Clarifying Ordinance would reduce the size of DBE's structure, which would reduce the traffic and congestion associated with it, which would minimize the impact on Hanson's quality of life. Thus, Hanson had an impermissible conflict of interest when she voted in favor of the Clarifying Ordinance."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    377,
                    1353,
                    1116,
                    1399
                ],
                "angle": 0,
                "content": "(c) Hanson's Qualified Immunity Defense"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    283,
                    1399,
                    1211,
                    1828
                ],
                "angle": 0,
                "content": "Hanson was sued personally in the Federal Case, putting her at risk of having to pay both a judgment and attorney's fees. The Clarifying Ordinance would help her qualified immunity defense in the Federal Case. Hanson's attorney told her that the Clarifying Ordinance would help her qualified immunity defense in the Federal Case. Thus, Hanson had an impossible conflict of interest when she voted in favor of the Clarifying Ordinance."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    390,
                    1887,
                    1104,
                    1937
                ],
                "angle": 0,
                "content": "(d) Hanson's Appearance of Impriety"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    283,
                    1933,
                    1208,
                    2125
                ],
                "angle": 0,
                "content": "Lastly, according to PIC, if the public was aware of all of Hanson's conflicts of interests it would conclude that she was using her public office to advance her own interests."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    494,
                    2184,
                    1002,
                    2227
                ],
                "angle": 0,
                "content": "VII. The Standard of Review"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    283,
                    2230,
                    1208,
                    2712
                ],
                "angle": 0,
                "content": "*7 The standard of review on appeal is whether PIC's decision is supported by substantial evidence on the record. FN20 Substantial evidence is that which \"a reasonable mind might accept as adequate to support a conclusion.\" FN21 It is more than a scintilla, but less than a preponderance of the evidence. FN22 It is a low standard to affirm and a high standard to overturn. If the record contains substantial evidence, then the Court is prohibited from re-weighing the evidence or substituting its judgment for that of the agency. FN23"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    438,
                    2765,
                    897,
                    2814
                ],
                "angle": 0,
                "content": "FN20. 29 Del.C. § 5810A."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    438,
                    2871,
                    1208,
                    2920
                ],
                "angle": 0,
                "content": "FN21. Olney v. Cooch, 425 A.2d 610, 614"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1489,
                    419,
                    2256,
                    564
                ],
                "angle": 0,
                "content": "(Del.1981) (citing Consolo v. Fed. Mar. Comm'n, 383 U.S. 607, 620, 86 S.Ct. 1018, 16 L.Ed.2d 131 (1966))."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1489,
                    617,
                    2256,
                    818
                ],
                "angle": 0,
                "content": "FN22. Breeding v. Contractors-One-Inc., 549 A.2d 1102, 1104 (Del .1988) (citing DiFilippo v. Beck, 567 F.Supp. 110 (D.Del.1983))."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1489,
                    871,
                    2261,
                    1013
                ],
                "angle": 0,
                "content": "FN23. Janaman v. New Castle County Bd. of Adjustment, 364 A.2d 1241, 1242 (Del.Super.1976)."
            },
            {
                "block_id": 17,
                "type": "title",
                "bbox": [
                    1560,
                    1072,
                    2034,
                    1118
                ],
                "angle": 0,
                "content": "VIII. Hanson's Arguments"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1333,
                    1122,
                    2256,
                    1791
                ],
                "angle": 0,
                "content": "Hanson argues that (1) PIC does not have jurisdiction to hear and decide conflict of interest matters involving municipal officials, (2) there is not substantial evidence in the record to support PIC's finding that the Clarifying Ordinance would help her rental properties compete with DBE's hotel, (3) PIC exceeded its statutory grant of authority when it found that the Clarifying Ordinance would improve her quality of life, (4) there is not substantial evidence in the record to support PIC's finding that the Clarifying Ordinance would help her qualified immunity defense in the Federal Case, and (5) PIC exceeded its statutory grant of authority when it found that she had an appearance of impropriety."
            },
            {
                "block_id": 19,
                "type": "title",
                "bbox": [
                    1601,
                    1848,
                    1991,
                    1894
                ],
                "angle": 0,
                "content": "(a) PIC's Jurisdiction"
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    1333,
                    1897,
                    2256,
                    2904
                ],
                "angle": 0,
                "content": "Hanson argues that the Code of Conduct does not apply to her because she is a town officer, not a State officer. Her argument is based on a conflict between the scope and definitional sections of the original Code of Conduct and an amendment to the Code of Conduct enacted by the legislature to make the Code of Conduct applicable to counties, municipalities and towns. The Code of Conduct, as originally enacted, did not apply to town officers. It only applied to certain State employees, officers and honorary officials. The Code of Conduct generally prohibits State employees, officers and honorary officials from participating on behalf of the State in the review or disposition of any matter pending before the State in which the State employee, officer or honorary official has a personal or private interest.[FN24] It also generally requires State employees, officers and honorary officials to behave in such a manner that will not cause the public to suspect that the State employee, officer or honorary official is engaging in acts which are in violation of the public trust and which"
            },
            {
                "block_id": 21,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    148,
                    2256,
                    204
                ],
                "angle": 0,
                "content": "Page 7"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    415,
                    1208,
                    993
                ],
                "angle": 0,
                "content": "will reflect unfavorably upon the State.\\(^{\\text{FN25}}\\) The definition of State employee covers anyone who receives compensation as an employee of a State agency, any-one who serves as an appointed member, trustee, director or the like of any State agency and who receives more than $5,000 per year, and elected or appointed school board members.\\(^{\\text{FN26}}\\) The definition of State agency excludes political subdivisions of the State and their agencies.\\(^{\\text{FN27}}\\) However, the legislature changed the scope and application of the Code of Conduct when it added 29 Del. C. § 5802(4), which states:"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    438,
                    1049,
                    923,
                    1102
                ],
                "angle": 0,
                "content": "FN24. 29 Del. C. § 5805(a)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    438,
                    1155,
                    923,
                    1207
                ],
                "angle": 0,
                "content": "FN25. 29 Del. C. § 5806(a)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    438,
                    1260,
                    943,
                    1313
                ],
                "angle": 0,
                "content": "FN26. 29 Del. C. § 5804(12)."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    438,
                    1366,
                    943,
                    1419
                ],
                "angle": 0,
                "content": "FN27. 29 Del. C. § 5804(11)."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    323,
                    1471,
                    1208,
                    2339
                ],
                "angle": 0,
                "content": "*8 It is the desire of the General Assembly that all counties, municipalities and towns adopt code of conduct legislation at least as stringent as this act to apply to their employees and elected and appointed officials. This subchapter shall apply to any county, municipality or town and the employees and elected and appointed officials thereof which has not enacted such legislation by January 23, 1993. No code of conduct legislation shall be deemed sufficient to exempt any county, municipality or town from the purview of this subchapter unless the code of conduct has been submitted to the State Ethics Commission and determined by a majority vote thereof to be at least as stringent as this subchapter. Any change to an approved code of conduct must similarly be approved by the State Ethics Commission to continue the exemption from this subchapter."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2392,
                    1208,
                    2923
                ],
                "angle": 0,
                "content": "When the legislature added § 5802(4) it did not amend the rest of the Code of Conduct, leaving conflicting language in the scope and definitional sections. Even though the legislature never amended the rest of the Code of Conduct to make it consistent with § 5802(4), both the plain language of § 5802(4) and intent of the legislature are clear.[FN28] § 5802(4) states that “[t]his subchapter (which is the subchapter setting forth the scope of the Code of Conduct) shall apply to any County, Municipality or Town and the employees and elected officials thereof which has not"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1336,
                    419,
                    2256,
                    854
                ],
                "angle": 0,
                "content": "enacted such legislation by July 23, 1993” that has been approved by the State Ethics Commission. This language and the legislature's intent could not be more clear. Thus, the Code of Conduct applies to Dewey Beach and Hanson. Dewey Beach does not have a code of conduct approved by PIC. Hanson is an elected official of Dewey Beach. Therefore, I have concluded that PIC has jurisdiction over Hanson as a Dewey Beach town commissioner."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1486,
                    907,
                    2256,
                    1917
                ],
                "angle": 0,
                "content": "FN28. Alexander v. Town of Cheswold, 2007 WL1849089, at *2 (Del.Super. June 27, 2002) (“Interpreting a statute is a question of law. When interpreting a statute, ‘the predominant goal of statutory construction is to ‘ascertain and give effect to the intent of the legislature.’” “Thus, if looking at the plain meaning of the statute it is clear what the intent of the legislature is, then the statute is unambiguous and the plain meaning of the statute controls. If the statute is ambiguous, meaning if it is “reasonably susceptible of different conclusions or interpretations,” then the Court must attempt to ascertain the intent of the legislature. In doing so, if a literal interpretation causes a result inconsistent with the general intent of the statute, “such interpretation must give way to the general intent” to allow the court to promote the purpose of the statute and the legislature's intent.”) (Citations omitted)."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1522,
                    1973,
                    2070,
                    2019
                ],
                "angle": 0,
                "content": "(b) Hanson's Rental Properties"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1336,
                    2019,
                    2254,
                    2310
                ],
                "angle": 0,
                "content": "Hanson argues that PIC's finding that her two oceanside rental properties would compete with DBE's bayside hotel and condominium is not supported by substantial evidence in the record. PIC relied on the following evidence in the record to support its finding:"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1374,
                    2362,
                    2254,
                    2455
                ],
                "angle": 0,
                "content": "(1) The following statement in Nelson's complaint to PIC:"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1374,
                    2517,
                    2256,
                    2854
                ],
                "angle": 0,
                "content": "The situation is exacerbated by the facts [sic] that Commissioner Hanson owns rental income property in Dewey Beach and I am informed she has previously said that the redevelopment of Ruddertown would jeopardize her rental income thereby creating a conflict of interest. (Emphasis added.)"
            },
            {
                "block_id": 16,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    151,
                    2249,
                    198
                ],
                "angle": 0,
                "content": "Page 8"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1216,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    326,
                    419,
                    1201,
                    518
                ],
                "angle": 0,
                "content": "(1) Hanson's statement in a Cape Gazette interview dated September 12, 2007:"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    326,
                    570,
                    1201,
                    716
                ],
                "angle": 0,
                "content": "What height and type of construction (a 68-foot hotel/condo hybrid or 48 townhouses) do you feel is best for Ruddertowne?"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    772,
                    1208,
                    1399
                ],
                "angle": 0,
                "content": "Hanson: A 120-unit 5-star condo/hotel complex is not a town center. I would like to see a third option of a mixed-use complex that follows our current zoning laws at a height of 35 feet—one that is truly a town center. However, because Harvey, Hanna and Associates have refused to negotiate, we have only a choice between a massive hotel and townhouses at this time. If the hotel is allowed to breach our current height limit, buildings of 68 feet will quickly spread along the business zone from Van Dyke to Rodney avenues. The hotel will also compete with property owners who rent their homes or for those selling their properties. (Emphasis added.)"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1452,
                    1203,
                    1745
                ],
                "angle": 0,
                "content": "*9 (3) Hanson's testimony at the hearing. Hanson acknowledged during the hearing that both she and DBE would be offering rentals in Dewey Beach, that renters could stay in her rentals or DBE's rentals, that people who had rented from her had also rented on the bay."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1798,
                    1203,
                    1989
                ],
                "angle": 0,
                "content": "(4) DBE's proposed hotel and condominium is close to Hanson's rental properties, being two blocks past Hanson's Sea Mist Villa and one block past Hanson's Sea Dune Villa."
            },
            {
                "block_id": 8,
                "type": "list",
                "bbox": [
                    285,
                    1452,
                    1203,
                    1989
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2046,
                    1203,
                    2574
                ],
                "angle": 0,
                "content": "PIC reasoned that since both Hanson and DBE would both be renting rooms in Dewey Beach that they were in the same market and thus in competition with each other, stating \"It is this proximity and competition for essentially the same ocean space, and for the same market, that puts her in a different class than others.\" PIC supported its reasoning, stating \"[t]he very meaning of competition is the effort of two or more parties acting independently to secure the business of a third party by offering the most favorable terms.\""
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2630,
                    1203,
                    2923
                ],
                "angle": 0,
                "content": "I have concluded that PIC's analysis of the rental market in Dewey Beach is overly simplistic and that its ultimate conclusion is not supported by substantial evidence in the record. Quite simply, while PIC defined what competition is, it never addressed the factors that a Court looks at to determine if people are"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1338,
                    422,
                    1558,
                    468
                ],
                "angle": 0,
                "content": "competitors."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1336,
                    521,
                    2256,
                    1435
                ],
                "angle": 0,
                "content": "The statements in Nelson's letter and the Cape Gazette article are unpersuasive. Nelson did not testify at the hearing and his five-page complaint is not properly sworn. Nelson did not state that he heard Hanson admit that DBE's hotel would compete with her rental properties. He instead stated that someone told him that they heard Hanson say this. This is double hearsay. As such it is inherently unreliable because no one knows who made the statement and the person making the statement was not subject to cross-examination. An unsworn statement that is double hearsay is proof of nothing. Hanson only stated in the Cape Gazette interview that DBE's proposed hotel and condominium would hurt rental properties in general. She did not say that they would compete with her rental properties. Indeed, Hanson was adamant during her testimony at the hearing that DBE's bayside hotel offered no competition for her ocean-side houses."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1336,
                    1491,
                    2256,
                    2310
                ],
                "angle": 0,
                "content": "Hanson's statements at the hearing are similarly unpersuasive. The mere fact that both she and DBE offer rentals in Dewey Beach and that people could stay at either one does not mean that they would and it does not mean that she and DBE would be competitors. Hanson's statement that a person who had rented on the bay had also rented from her was taken out of context by PIC. What Hanson actually said was that she had a tenant who rented her oceanfront house who had rented property on the bay the previous year and decided it was worth $1,500 more per week to rent on the ocean to avoid having to cross Coastal Highway with her belongings and children in order to get to the ocean. This does not support PIC's finding. It does support the finding that Hanson's rentals are very different from bayside rentals and cost substantially more to rent."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1336,
                    2362,
                    2256,
                    2897
                ],
                "angle": 0,
                "content": "*10 Competition is usually defined more narrowly than PIC defined it. It has been stated that competition \"entails more than mutual existence in the marketplace; rather, it requires an endeavor among business entities to seek out similar commercial transactions with a similar clientele.\" FN29 Put another way, competitors are those \"who vie for the same dollars from the same consumer group.\" FN30 In order to determine if people are actually competing with each other for the same consumers you have to \"compare all relevant aspects of the products, includ"
            },
            {
                "block_id": 15,
                "type": "footer",
                "bbox": [
                    744,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2129,
                    148,
                    2256,
                    204
                ],
                "angle": 0,
                "content": "Page 9"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    419,
                    1208,
                    617
                ],
                "angle": 0,
                "content": "ing price, style, intended uses, target clientele, and channels of distribution.” FN31 It is this critical step that PIC never took in its analysis of the Dewey Beach rental market."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    666,
                    1208,
                    818
                ],
                "angle": 0,
                "content": "FN29. McKinnon v. CV Industries, Inc., 2012 WL 2107119 (N.C.Super. June 11, 2012)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    438,
                    867,
                    1206,
                    970
                ],
                "angle": 0,
                "content": "FN30. West v. Gold, Inc., 2012 WL 2913207 (N.D.Cal. July 16, 2012)."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    438,
                    1023,
                    1206,
                    1174
                ],
                "angle": 0,
                "content": "FN31. Toni & Guy (USA) Ltd. v. Nature's Therapy, Inc., 2006 WL 1153354 (S.D.N.Y. May 1, 2006)."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1224,
                    1208,
                    1659
                ],
                "angle": 0,
                "content": "PIC never examined or compared the price and nature of Hanson's oceanside rentals to the price and nature of DBE's hotel. Merely because Hanson and DBE would be renting rooms in the same town hardly means that they would be competing with each other, particularly given what is known about each property suggests just the opposite and what is unknown about each property is substantial and important."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    1712,
                    1208,
                    2385
                ],
                "angle": 0,
                "content": "PIC assumed that Hanson's rental properties and DBE's hotel are similar enough in nature, location and price to appeal to the same group of potential renters. That assumption is not supported by the evidence. Hanson has two rental properties in a residential area. Sea Mist Villa is a three-story, four-bedroom, two bath, oceanfront house. Three of the bedrooms have adjoining decks with two of the decks overlooking the ocean. The living area has a large deck that overlooks the ocean. Sea Dune Villa is a six-bedroom, four and one-half bath second story condominium one house back from the ocean. It has a screened-in porch, several decks, a two-car garage and ocean views from nearly all of the rooms."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2438,
                    1208,
                    2923
                ],
                "angle": 0,
                "content": "DBE has proposed building a 120 room hotel in a commercial area on the bay. Virtually nothing is known about the rooms it plans to offer. What is known is that Hanson's rental properties are very large with multiple bedrooms and are oceanfront and one house back from the ocean. DBE's hotel will be on the bay. Hanson's rental properties and DBE's hotel are separated by Coastal Highway, a four-lane highway with two lanes in each direction separated by a median. Hanson's tenants do not have to cross"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1333,
                    419,
                    2256,
                    1095
                ],
                "angle": 0,
                "content": "this very busy highway to get to the ocean. DBE's tenants will have to cross it to get to the ocean and cross it again to get back to their rooms. PIC minimized this inconvenience, stating that \"The other side of Route 1 is not the dark side of the moon\" and that Hanson's and DBE's rentals are \"across the street\" from each other. Well, the street is a major highway that people do not like to cross and will pay a lot of money to avoid. Obviously, those who want to pay less will do so and rent on the bayside. Those who want to pay more will do so and rent on the oceanside. Hanson's rental properties are located in the most desirable area of Dewey Beach and DBE's proposed hotel is not."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1333,
                    1148,
                    2256,
                    1488
                ],
                "angle": 0,
                "content": "*11 Moreover, what is not known about Hanson's and DBE's rental properties is substantial and important. There is no evidence in the record about how much Hanson charged for her oceanside properties or what DBE planned to charge for its bayside hotel rooms. Price is always an important consideration and there is no evidence in the record about it."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1333,
                    1541,
                    2261,
                    1884
                ],
                "angle": 0,
                "content": "PIC concluded that a four bedroom ocean front house and a six bedroom condominium one house back from the ocean in a residential area on the other side of a major highway will compete with hotel rooms of an unknown size on the bay in a commercial area. There simply is not substantial evidence in the record to support this finding."
            },
            {
                "block_id": 13,
                "type": "title",
                "bbox": [
                    1547,
                    1937,
                    2047,
                    1983
                ],
                "angle": 0,
                "content": "(c) Hanson's Quality of Life"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1331,
                    1983,
                    2256,
                    2894
                ],
                "angle": 0,
                "content": "Hanson argues that PIC exceeded its statutory grant of authority when it found that her vote in favor of the Clarifying Ordinance was motivated by her desire to maintain her quality of life. PIC concluded in its Final Disposition Opinion that Hanson voted for the Clarifying Ordinance because it would help her maintain her quality of life. I have reversed PIC's decision because it did not follow its own rules when it made this finding. PIC has adopted rules governing its proceedings. Rule IV(c)(2) requires PIC to, when it takes action against someone, to \"specifically identify each portion of the Code of Conduct Respondent is alleged to have violated and facts upon which each alleged violation is based.\" PIC, while it alleged that Hanson violated 29 Del. C. § 5805 and § 5806 in its Preliminary Decision by voting on the Clarifying Ordinance because she had conflicts of interest involving her rental properties and qualified immunity defense, never preliminarily found or told Hanson"
            },
            {
                "block_id": 15,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3154
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2108,
                    151,
                    2256,
                    198
                ],
                "angle": 0,
                "content": "Page 10"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1216,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    293,
                    419,
                    1208,
                    1329
                ],
                "angle": 0,
                "content": "that she violated these sections because she had a conflict of interest because of her quality of life concerns. It is well-settled law that once an agency adopts regulations governing how it handles its procedures, the agency must follow them. If the agency does not, then the action taken by the agency is invalid. \\( \\underline{\\mathrm{FN32}} \\) Nelson did not raise the quality of life conflict in his complaint. PIC did not make a preliminary finding about it. PIC did not tell Hanson about it. The issue did not even come up until Hanson testified at the hearing on her Motion to Dismiss. PIC heard this quality of life testimony and concluded that Hanson had yet another conflict of interest and found yet another violation of the Code of Conduct. However, PIC never followed its own rules by first making a preliminary finding that Hanson had such a conflict, informing her of the conflict, and giving her an opportunity to rebut the finding before finally determining that she did have such a conflict of interest."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    1386,
                    1203,
                    1435
                ],
                "angle": 0,
                "content": "FN32. Dugan v. Delaware Harness Racing"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    441,
                    1435,
                    1109,
                    1485
                ],
                "angle": 0,
                "content": "Commission, 752 A.2d 529 (Del.2000)."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    374,
                    1541,
                    1114,
                    1590
                ],
                "angle": 0,
                "content": "(d) Hanson's Qualified Immunity Defense"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1590,
                    1203,
                    1970
                ],
                "angle": 0,
                "content": "Hanson argues that PIC's finding that the Clarifying Ordinance would help her qualified immunity defense in the Federal Case is not supported by substantial evidence in the record. PIC's finding is based largely on the testimony of Mandalas and Walton and its own legal analysis of qualified immunity. PIC's findings of facts are reflected in the following statements:"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    323,
                    2029,
                    1203,
                    2227
                ],
                "angle": 0,
                "content": "*12 This undisclosed purpose—not on the face of the ordinance—is at the heart of the allegation that she had a personal or private interest because she was personally sued by DBE."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    323,
                    2277,
                    1208,
                    2808
                ],
                "angle": 0,
                "content": "She argues her judgment was not impaired by her personal interest because: \"I've been consistently in favor of keeping the height limit at \\(35'\\).\" The law does not require that it actually be impaired—only that it may \"tend\" to be impaired. It also does not say she can participate in the face of a conflict as long as she is consistent in how she votes. It is not how she voted, but that she voted when she had a personal or private interest and knew specifically she could personally benefit from her own decision. (Emphasis added.)"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    362,
                    2861,
                    1203,
                    2913
                ],
                "angle": 0,
                "content": "It has been established that Respondent was"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1371,
                    419,
                    2256,
                    805
                ],
                "angle": 0,
                "content": "clearly aware of the ordinance's undisclosed purpose—creating a legal defense to the law suit in which she was personally sued—and was advised by her Attorney that it could affect her qualified immunity argument. Thus, she not only knew the purpose was not on the face, but was advised of the personal benefit to her if it passed. (Emphasis added.)"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1412,
                    861,
                    2208,
                    907
                ],
                "angle": 0,
                "content": "I have summarized PIC's reasoning as follows:"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1333,
                    963,
                    2256,
                    1735
                ],
                "angle": 0,
                "content": "The Relaxed bulk standards in Dewey Beach's 2007 Comprehensive Land Use Plan and the 68 foot height limit were at the heart of the Federal Case. The Clarifying Ordinance would set the height limit at 35 feet and make it retroactive. This would allow Hanson to argue that the Clarifying Ordinance made her acts going back to 2007 official acts for which she is entitled to qualified immunity. The Clarifying Ordinance, if accepted, could also be a defense to DBE's claims that it could build a structure taller than 35 feet. This would allow Hanson to argue that her vote against the Concept Plan was merely a \"ministerial\" act, releasing her of personal liability. Hanson knew all of this because her lawyer told her so and that is why she had a conflict of interest when she voted for the Clarifying Ordinance."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1333,
                    1788,
                    2256,
                    2415
                ],
                "angle": 0,
                "content": "The critical elements of PIC's findings of fact and its legal reasoning are: (1) Hanson was personally at risk for damages and attorney's fees because DBE had sued her individually, (2) the real purpose of the Clarifying Ordinance was to help Dewey Beach and Hanson and the other individual defendants in the Federal Case and this real purpose was not disclosed to the public, (3) Hanson's lawyer told her that the Clarifying Ordinance would help her qualified immunity defense, (4) the Clarifying Ordinance could be accepted, and (5) the Clarifying Ordinance would help Hanson's qualified immunity defense."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1336,
                    2468,
                    2254,
                    2570
                ],
                "angle": 0,
                "content": "PIC's findings are not supported by substantial evidence in the record in several important respects."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1649,
                    2623,
                    1943,
                    2666
                ],
                "angle": 0,
                "content": "1. Personal Risk"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1336,
                    2673,
                    2256,
                    2913
                ],
                "angle": 0,
                "content": "There is scant evidence in the record to support PIC's finding that Hanson was at risk personally in the Federal Case. PIC concluded that Hanson was at risk for damages and attorney's fees simply because DBE sued her individually. However, Dewey Beach"
            },
            {
                "block_id": 18,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2108,
                    151,
                    2246,
                    198
                ],
                "angle": 0,
                "content": "Page 11"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1216,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    306,
                    1020,
                    353
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1206,
                    1138
                ],
                "angle": 0,
                "content": "had an obligation to indemnify Hanson, from the general funds of the town's treasury, to the extent not otherwise covered by appropriate insurance, for any matter arising out of an action taken by her in connection with the performance of her official duties, against expenses (including attorney's fees), judgments, fines, amounts paid in settlement incurred by her in connection with such action.[FN33] The Federal Case had been settled at the time of the hearing on Hanson's Motion to Dismiss. However, PIC, which had the burden of proof, never determined whether Hanson was paying her own attorneys' fees or whether they were being covered by Dewey Beach or its insurance carrier when she voted in favor of the Clarifying Ordinance."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    438,
                    1194,
                    981,
                    1244
                ],
                "angle": 0,
                "content": "FN33. Dewey Beach C. § 22-1."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    627,
                    1303,
                    867,
                    1346
                ],
                "angle": 0,
                "content": "2. Disclosure"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    1349,
                    1206,
                    2646
                ],
                "angle": 0,
                "content": "*13 The evidence in the record shows that the purpose of the Clarifying Ordinance was, in part, to help Dewey Beach, but not necessarily Hanson and the other individual defendants, in the Federal Case, and that this purpose was disclosed to the public by Mandalas. I assume that PIC concluded that the real purpose of the Clarifying Ordinance was undisclosed because the text of the Clarifying Ordinance only discussed clarifying the maximum height limit in the RB-1 zoning district. However, the fact that the purpose of the Clarifying Ordinance was, in part, to help Dewey Beach in the Federal Case was discussed publicly by Mandalas before Hanson and the other Dewey Beach commissioners voted on it. Mandalas was Dewey Beach's attorney. He prepared the initial draft of the Clarifying Ordinance. He testified at the hearing that the Clarifying Ordinance had \"served a couple purposes.\" One purpose was to clarify the meaning of the bulk standards to show that they did not relax the maximum 35 foot height limitation. The other purpose was to help Dewey Beach in the Federal Case. Mandalas believed that by clarifying the meaning of bulk standards it would remove an issue in dispute in the Federal Case. Mandalas told PIC this at the hearing in response to PIC's legal counsel's question on the matter. The following is an excerpt of their exchange:"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2699,
                    1203,
                    2844
                ],
                "angle": 0,
                "content": "Q. And did you, as counsel to the Town, recommend to Mayor Hanson and the other commissioners that a clarifying ordinance be adopted?"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1336,
                    419,
                    2256,
                    663
                ],
                "angle": 0,
                "content": "A. I recommend that. And I've discussed this in open session, so this isn't violating any client confidences. I did, in fact, recommend that for litigation purposes, I thought this ordinance was an ordinance that should be adopted. (Emphasis added.)"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1336,
                    716,
                    2256,
                    1056
                ],
                "angle": 0,
                "content": "Now that's separate from a policy decision. Whether, as a member of the commission, somebody as a matter of policy thought it was good to go above 35 feet or not good to go about 35 feet, my view was that since we're in litigation, if we want to put on the best defense possible with that litigation, I did recommend adoption of this ordinance."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1336,
                    1108,
                    2254,
                    1399
                ],
                "angle": 0,
                "content": "Thus, it is clear that Mandalas told the public that the purpose of the Clarifying Ordinance was to help Dewey Beach in the Federal Case. There is no evidence in the record suggesting that he told Hanson and the other individual defendants that the purpose of it was to help them personally."
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    1626,
                    1455,
                    1966,
                    1501
                ],
                "angle": 0,
                "content": "3. Walton's Advice"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1336,
                    1504,
                    2256,
                    2227
                ],
                "angle": 0,
                "content": "There is not substantial evidence in the record to support PIC's finding that Walton told Hanson that the Clarifying Ordinance would help her qualified immunity defense. PIC did not find that it was a conflict of interest for Hanson to vote in favor of the Clarifying Ordinance in order to help Dewey Beach in the Federal Case. It was only a conflict of interest if she did so to help her own defense in the Federal Case. However, Walton, who was the attorney for Hanson and the other individual defendants, did not testify that he told Hanson that the Clarifying Ordinance would help her. He only testified that he discussed the impact of the Clarifying Ordinance on her qualified immunity defense. This is a meaningful distinction. The following is his testimony:"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1371,
                    2277,
                    2256,
                    2616
                ],
                "angle": 0,
                "content": "*14 Ms. Wright: After that was passed—well, after the Federal Court ruled that those claims could still exist against the Town and Ms. Hanson, did you advise her—and I'm not asking you what you advised her. Did you advise her of the potential impact that the clarifying ordinance could have in her defense regarding qualified immunity?"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1415,
                    2669,
                    2124,
                    2722
                ],
                "angle": 0,
                "content": "The Witness: I'm sure we spoke of it, yes."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1415,
                    2775,
                    1830,
                    2828
                ],
                "angle": 0,
                "content": "Ms. Wright: Thank you."
            },
            {
                "block_id": 16,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2108,
                    148,
                    2259,
                    201
                ],
                "angle": 0,
                "content": "Page 12"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1208,
                    1095
                ],
                "angle": 0,
                "content": "Based on this, PIC concluded that Hanson \"not only knew the purpose was not on the face, but was advised of the personal benefit to her if it passed.\" Walton's testimony simply does not support PIC's finding. Walton's advice could have ranged anywhere from \"the Clarifying Ordinance is a complete defense to all of DBE's claims against you\" to \"the Clarifying Ordinance is no defense at all to DBE's claims against you because it cannot be given retroactive effect because to do so would violated DBE's constitutional and vested rights.\" Notwithstanding this, PIC concluded, as a finding of fact, that Walton told Hanson that the Clarifying Ordinance would help her qualified immunity defense."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1148,
                    1211,
                    2349
                ],
                "angle": 0,
                "content": "PIC's findings in this regard are critical to its ultimate finding that Hanson had a conflict of interest. Mandalas openly advised the Dewey Beach Mayor, Hanson and the other Dewey Beach commissioners to pass the Clarifying Ordinance to help Dewey Beach in the Federal Case. Hanson, as a non-lawyer, certainly would not know the legal consequences of the Clarifying Ordinance on her qualified immunity defense unless her attorney told her what those consequences were. Thus, it was critical for PIC to determine if Walton had told Hanson that the Clarifying Order would help her qualified immunity defense. This is why PIC's counsel asked Walton whether he had discussed the effect of the Clarifying Ordinance on Hanson's qualified immunity defense. Walton testified that he did talk to Hanson about it, but he never told PIC what his advice was. Thus, there is no evidence in the record that he told Hanson that the Clarifying Ordinance would help her qualified immunity defense. Therefore, PIC's finding that he did is not supported by substantial evidence in the record. Even though the record does not support PIC's finding about what Walton told Hanson, which I view as fatal to its conflict of interest finding, I will briefly address the rest of PIC's findings in this regard."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    494,
                    2402,
                    1002,
                    2451
                ],
                "angle": 0,
                "content": "4. The Clarifying Ordinance"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    2451,
                    1208,
                    2887
                ],
                "angle": 0,
                "content": "There is not substantial evidence in the record or legal analysis supporting PIC's finding that the Clarifying Ordinance would ever be accepted. The fact is that such ordinances are usually not given retroactive effect. There is no doubt that, in the absence of constitutional provisions to the contrary, the legislative branch of Government can adopt legislation having a retroactive or retrospective affect.[FN34] Legislation is either introductory of new rules or declaratory of"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1336,
                    415,
                    2256,
                    1623
                ],
                "angle": 0,
                "content": "existing rules.\\(^{\\text{FN35}}\\) A declaratory statute is one which is passed in order to put an end to a doubt as to what is the common law or the meaning of another statute and declares what it is and ever has been.\\(^{\\text{FN36}}\\) Such a statute therefore is always, in a certain sense, retrospective because it assumes to determine what the law was before it was passed.\\(^{\\text{FN37}}\\) It is always permissible to change an existing law by a declaratory statute where the statute is only to operate upon future cases.\\(^{\\text{FN38}}\\) But the legislative action cannot be made retroactive upon past controversies and to reverse decisions which the courts in the exercise of their undoubted authority have made.\\(^{\\text{FN39}}\\) The United States Supreme Court has said that the legislature has the power to declare by subsequent statute the construction of previous statutes so as to bind the courts in reference to transactions occurring after the passage of the law and may at times enunciate the rule to govern courts in transactions that are past provided no constitutional rights are prejudiced.\\(^{\\text{FN40}}\\) However, the legislative branch of government has no power by subsequent act to declare the construction of a previous act prejudicially affecting constitutional and vested rights which have attached under the prior act and before the passage of the declaratory law.\\(^{\\text{FN41}}\\)"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1489,
                    1673,
                    2254,
                    1775
                ],
                "angle": 0,
                "content": "FN34. 2 Sutherland Stat. Constr., 2nd Ed. Sec. 2201 et seq."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1489,
                    1824,
                    2254,
                    1923
                ],
                "angle": 0,
                "content": "FN35. 1 Cooley's Const. Lim., 188 (8th Ed.)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1491,
                    1980,
                    1662,
                    2032
                ],
                "angle": 0,
                "content": "FN36. Id."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1491,
                    2085,
                    1662,
                    2135
                ],
                "angle": 0,
                "content": "FN37. Id."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1491,
                    2191,
                    1662,
                    2240
                ],
                "angle": 0,
                "content": "FN38. Id."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1491,
                    2296,
                    1662,
                    2346
                ],
                "angle": 0,
                "content": "FN39. Id."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1489,
                    2402,
                    2256,
                    2550
                ],
                "angle": 0,
                "content": "FN40. Stockdale v. Atlantic Insurance Companies, 87 U.S. 323 (1873); Town of Koshkonong v. Burton, 104 U.S. 668 (1881)."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1491,
                    2603,
                    1662,
                    2653
                ],
                "angle": 0,
                "content": "FN41. Id."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1336,
                    2709,
                    2256,
                    2904
                ],
                "angle": 0,
                "content": "*15 There is no doubt that DBE, after having spent a considerable sum of money to prepare the Concept Plan, would have argued that its right to build a 68 foot tall structure under the Relaxed bulk"
            },
            {
                "block_id": 17,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2108,
                    148,
                    2259,
                    201
                ],
                "angle": 0,
                "content": "Page 13"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    306
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    306,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    419,
                    1208,
                    666
                ],
                "angle": 0,
                "content": "standards applicable in the RB-1 zoning district had \"vested\" and could not be impaired by the Clarifying Ordinance.\\(^{\\text{FN42}}\\) Thus, it seems highly unlikely that the Clarifying Ordinance would have ever of been of any help to Hanson in any event."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    712,
                    1206,
                    818
                ],
                "angle": 0,
                "content": "FN42. In re: 244.5 Acres of Land, 808 A.2d 753 (Del.2002)."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    433,
                    871,
                    1060,
                    920
                ],
                "angle": 0,
                "content": "5. The Qualified Immunity Defense"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    920,
                    1208,
                    1353
                ],
                "angle": 0,
                "content": "There is not substantial evidence in the record or legal analysis to support PIC's finding that the Clarifying Ordinance would have helped Hanson's qualified immunity defense. PIC never reviewed DBE's complaint against Dewey Beach, Hanson and the individual defendants or their respective motions to dismiss. It instead relied on the District Court's decision on the motions to dismiss in order to analyze the legal issues in the Federal Case."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    283,
                    1405,
                    1211,
                    2036
                ],
                "angle": 0,
                "content": "The common-law doctrines that determine the tort liability of municipal employees are well established.[FN43] Generally, a municipal employee is liable for the misperformance of ministerial acts, but has a qualified immunity in the performance of governmental acts.[FN44] Governmental acts are performed wholly for the direct benefit of the public and are supervisory or discretionary in nature.[FN45] The hallmark of a discretionary act is that it requires the exercise of judgment.[FN46] In contrast, ministerial refers to a duty which is to be performed in a prescribed manner without the exercise of judgment or discretion.[FN47]"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    436,
                    2085,
                    1206,
                    2237
                ],
                "angle": 0,
                "content": "FN43. Bridgeport Harbor Place I, LLC v. Ganim, 2006 WL 493352, at *3 (Conn.Super.Feb.16, 2006)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    438,
                    2286,
                    614,
                    2336
                ],
                "angle": 0,
                "content": "FN44. Id."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    438,
                    2392,
                    614,
                    2442
                ],
                "angle": 0,
                "content": "FN45. Id."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    438,
                    2498,
                    612,
                    2547
                ],
                "angle": 0,
                "content": "FN46. Id."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    438,
                    2603,
                    612,
                    2653
                ],
                "angle": 0,
                "content": "FN47. Id."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    283,
                    2709,
                    1206,
                    2904
                ],
                "angle": 0,
                "content": "Defendants in a Section 1983 action are entitled to qualified immunity from damages for civil liability if their conduct does not violate clearly established statutory or constitutional rights of which a reason-"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1333,
                    415,
                    2256,
                    1557
                ],
                "angle": 0,
                "content": "able person would have known. FN48 Qualified immunity balances two important interests: the need to hold public officials accountable when they exercise power irresponsibly and the need to shield officials from harassment, distraction, and liability when they perform their duties reasonably. FN49 The existence of qualified immunity generally turns on the objective reasonableness of the actions, without regard to the knowledge or subjective intent of the particular official. Whether a reasonable officer could have believed his or her conduct was proper is a question of law for the court and should be determined at the earliest possible point in the litigation. In analyzing a qualified immunity defense, the Court must determine: (1) whether a constitutional right would have been violated on the facts alleged, taken in the light most favorable to the party asserting the injury; and (2) whether the right was clearly established when viewed in the specific context of the case. FN52 \"The relevant dispositive inquiry in determining whether a right is clearly established is whether it would be clear to a reasonable officer that his conduct was unlawful in the situation he confronted.\" FN53"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1489,
                    1623,
                    2254,
                    1729
                ],
                "angle": 0,
                "content": "FN48. Pearson v. Callahan, 555 U.S. 223, 231 (2009)."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1489,
                    1778,
                    2254,
                    1877
                ],
                "angle": 0,
                "content": "FN49. Harlow v. Fitzgerald, 457 U.S. 800, 815 (1982)."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1491,
                    1933,
                    1790,
                    1983
                ],
                "angle": 0,
                "content": "FN50. Id. at 819."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1489,
                    2039,
                    2254,
                    2135
                ],
                "angle": 0,
                "content": "FN51. ACT UP!/Portland v. Bagley, 988  \nF.2d, 868, 872-73 (9th Cir .1993)."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1489,
                    2191,
                    2244,
                    2244
                ],
                "angle": 0,
                "content": "FN52. Saucier v. Katz, 533 U.S. 194 (2001)."
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    1489,
                    2296,
                    1662,
                    2346
                ],
                "angle": 0,
                "content": "FN53. Id."
            },
            {
                "block_id": 21,
                "type": "text",
                "bbox": [
                    1333,
                    2402,
                    2256,
                    2887
                ],
                "angle": 0,
                "content": "*16 PIC never conducted this analysis to determine if the Clarifying Ordinance would be of any help to Hanson's qualified immunity defense. Indeed, such an analysis would have been difficult to undertake because PIC never reviewed DBE's complaint against Hanson and thus was not aware of the underlying factual allegations against her. PIC also never determined if Hanson's qualified immunity defense would overcome her conflicts of interest. FN54 PIC did conclude that Hanson could argue that her vote"
            },
            {
                "block_id": 22,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3154
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2108,
                    151,
                    2256,
                    201
                ],
                "angle": 0,
                "content": "Page 14"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1221,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    419,
                    1208,
                    660
                ],
                "angle": 0,
                "content": "against the Concept Plan was merely a ministerial act. However, PIC never discussed the land use process for evaluating and voting on a \"Concept Plan.\" Thus, it cannot be determined whether Hanson's vote was a ministerial act or not."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    716,
                    1208,
                    762
                ],
                "angle": 0,
                "content": "FN54. Wong v. Allison, 208 F.3d 224, 2000"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    441,
                    762,
                    1007,
                    811
                ],
                "angle": 0,
                "content": "WL 206572, FN3 (9th Cir.2000)."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    441,
                    874,
                    1055,
                    920
                ],
                "angle": 0,
                "content": "(e) The Appearance of Impriety"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    920,
                    1208,
                    2022
                ],
                "angle": 0,
                "content": "Hanson argues that PIC exceeded its statutory grant of authority when it found that she had acted in such a manner so as to create an appearance of impropriety. PIC found that when Hanson voted for the Clarifying Ordinance she engaged in a course of conduct that would raise suspicion among the public that she was engaging in acts that were in violation of the public trust and which did not reflect favorably upon Dewey Beach. This finding is based in turn on PIC's finding that Hanson should not have voted on the Clarifying Ordinance because she had conflicts of interest arising out of her rental properties, the desire to strengthen her qualified immunity defense in the Federal Case, and the desire to maintain her quality of life. Given these conflicts of interest, PIC concluded that the public would suspect that Hanson \"used her public office for personal gain or benefit.\" This is based on an appearance of impropriety test. The test is, according to PIC, if the conduct would create in reasonable minds, with knowledge of all relevant facts, a perception that an official's ability to carry out her duties with integrity, impartiality and competence is impaired."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2075,
                    1211,
                    2557
                ],
                "angle": 0,
                "content": "Having concluded that there was not substantial evidence in the record to support PIC's conflict of interest findings regarding Hanson's rental properties and her qualified immunity defense in the Federal Case, and that the conflict of interest issue regarding Hanson's quality of life was not properly before PIC, I have concluded that PIC's finding regarding the appearance of impropriety must be reversed because it is based upon these three unproven conflicts of interest."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2613,
                    1208,
                    2904
                ],
                "angle": 0,
                "content": "I note that Hanson testified that she had, both before and after she became an elected official in Dewey Beach, maintained that she was steadfastly committed to a maximum height of 35 feet for structures and had always voted against DBE because its structure in the Concept Plan exceeded 35 feet. PIC"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1336,
                    419,
                    2256,
                    1003
                ],
                "angle": 0,
                "content": "concluded that she had not always felt this way, noting that Hanson had twice reviewed and voted in executive session in favor of the mutual release and agreement, which permitted a maximum height for DBE's structure of 45.67 feet. PIC went on to state, \"Thus, her approval of the Mutual Agreement in Executive Session appears to contradict her statement that she always voted against DBE's height exceeding 35 feet.\" In reaching this conclusion, PIC took the evidence in the record out of context. This matter was discussed by PIC's legal counsel and Mandalas. The following is an excerpt of their exchange:"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1336,
                    1049,
                    2261,
                    1197
                ],
                "angle": 0,
                "content": "*17 Q. And are you familiar with or aware of how Mayor Hanson voted with regard to accepting or rejecting the proposed settlement?"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1338,
                    1254,
                    2254,
                    1353
                ],
                "angle": 0,
                "content": "A. Yes. Mayor Hanson was the one nay vote, voting—voting not to settle the litigation."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1374,
                    1405,
                    2254,
                    1508
                ],
                "angle": 0,
                "content": "Mr. Mandalas, prior to that, there were votes on the mutual agreement and release; is that correct?"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1415,
                    1557,
                    1736,
                    1607
                ],
                "angle": 0,
                "content": "The Witness: Yes."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1374,
                    1663,
                    2256,
                    1904
                ],
                "angle": 0,
                "content": "Ms. Wright: And within that mutual agreement and release, it discusses having a height above 35 feet, and my understanding is that it was a unanimous vote to move that forward to the town manager. Correct?"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1374,
                    1963,
                    2259,
                    2399
                ],
                "angle": 0,
                "content": "The Witness: Not entirely correct. The way the mutual agreement and release worked is that it kind of had a two-step process, where the town manager worked with Dewey Beach Enterprises to develop this mutual agreement and release. Once the town manager was satisfied with it, she brought it to council in executive session. And after reviewing the mutual agreement and release in executive session, council came out of executive session."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1374,
                    2448,
                    2256,
                    2643
                ],
                "angle": 0,
                "content": "And the decision then was whether to pursue the public hearing process and the public meeting process that was established in the mutual agreement, to pursue whether a settlement made sense."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1374,
                    2699,
                    2256,
                    2897
                ],
                "angle": 0,
                "content": "The mutual agreement and release makes clear that the settlement would only be adopted, and the mutual agreement and release would only be adopted upon a vote of the entire council after"
            },
            {
                "block_id": 19,
                "type": "footer",
                "bbox": [
                    742,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "page_number",
                "bbox": [
                    2108,
                    151,
                    2246,
                    198
                ],
                "angle": 0,
                "content": "Page 15"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    288,
                    254,
                    1216,
                    303
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732 (Del.Super.)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    290,
                    303,
                    1022,
                    356
                ],
                "angle": 0,
                "content": "(Cite as: 2012 WL 3860732 (Del.Super.))"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    326,
                    419,
                    854,
                    465
                ],
                "angle": 0,
                "content": "these public hearings occurred."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    323,
                    524,
                    1203,
                    861
                ],
                "angle": 0,
                "content": "So those votes I think that you're referring to were votes to move forward with the process that's laid out in the mutual agreement and release, but not to actually settle the litigation. Not to actually adopt the mutual agreement and release. That happened—whatever the date that the meeting was. (Emphasis added.)"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    917,
                    1208,
                    1112
                ],
                "angle": 0,
                "content": "I note this only because it is another example of how PIC reached a conclusion that was not supported by substantial evidence in the record. Hanson did vote against approving the settlement with DBE."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    606,
                    1168,
                    884,
                    1211
                ],
                "angle": 0,
                "content": "IX. Conclusion"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1217,
                    1203,
                    1739
                ],
                "angle": 0,
                "content": "There are two views of the evidence in this case. One view is that Hanson voted for the Clarifying Ordinance in order to help her rental properties compete with DBE's hotel and to improve her legal defenses in the Federal Case. The other view is that Hanson voted for the Clarifying Ordinance because she was opposed to a project nearly twice as tall as virtually every other building in Dewey Beach. PIC chose the former instead of the latter. The issue is whether that choice is supported by substantial evidence in the record. I have concluded that it is not."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    1798,
                    1201,
                    1897
                ],
                "angle": 0,
                "content": "The decision of the Delaware State Public Integrity Commission is reversed."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    364,
                    1950,
                    765,
                    1996
                ],
                "angle": 0,
                "content": "IT IS SO ORDERED."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2055,
                    581,
                    2105
                ],
                "angle": 0,
                "content": "Del.Super.,2012."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    285,
                    2105,
                    1127,
                    2151
                ],
                "angle": 0,
                "content": "Hanson v. Delaware State Public Integrity Com'n"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    285,
                    2151,
                    1203,
                    2201
                ],
                "angle": 0,
                "content": "Not Reported in A.3d, 2012 WL 3860732"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    290,
                    2201,
                    507,
                    2250
                ],
                "angle": 0,
                "content": "(Del.Super.)"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    288,
                    2306,
                    696,
                    2352
                ],
                "angle": 0,
                "content": "END OF DOCUMENT"
            },
            {
                "block_id": 15,
                "type": "footer",
                "bbox": [
                    744,
                    3098,
                    1800,
                    3151
                ],
                "angle": 0,
                "content": "© 2013 Thomson Reuters. No Claim to Orig. US Gov. Works."
            }
        ]
    }
]