[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    558,
                    284,
                    1927,
                    417
                ],
                "angle": 0,
                "content": "Mapping Instructions to Actions in 3D Environments with Visual Goal Prediction"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    699,
                    491,
                    1091,
                    606
                ],
                "angle": 0,
                "content": "Dipendra Misra\nEyvind Niklasson"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    1123,
                    491,
                    1486,
                    603
                ],
                "angle": 0,
                "content": "Andrew Bennett Max Shatkhin"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1555,
                    491,
                    1821,
                    599
                ],
                "angle": 0,
                "content": "Valts Blukis  \nYoav Artzi"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    300,
                    631,
                    2193,
                    687
                ],
                "angle": 0,
                "content": "Department of Computer Science and Cornell Tech, Cornell University, New York, NY, 10044"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    590,
                    691,
                    1907,
                    799
                ],
                "angle": 0,
                "content": "{dkm, awbennett, valts, yoav}@cs.cornell.edu {een7, ms3448} @cornell.edu"
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    654,
                    929,
                    848,
                    978
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    357,
                    1024,
                    1143,
                    1775
                ],
                "angle": 0,
                "content": "We propose to decompose instruction execution to goal prediction and action generation. We design a model that maps raw visual observations to goals using LINGUNET, a language-conditioned image generation network, and then generates the actions required to complete them. Our model is trained from demonstration only without external resources. To evaluate our approach, we introduce two benchmarks for instruction following: LANI, a navigation task; and CHAI, where an agent executes household instructions. Our evaluation demonstrates the advantages of our model decomposition, and illustrates the challenges posed by our new benchmarks."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    290,
                    1817,
                    650,
                    1869
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    1894,
                    1215,
                    2795
                ],
                "angle": 0,
                "content": "Executing instructions in interactive environments requires mapping natural language and observations to actions. Recent approaches propose learning to directly map from inputs to actions, for example given language and either structured observations (Mei et al., 2016; Suhr and Artzi, 2018) or raw visual observations (Misra et al., 2017; Xiong et al., 2018). Rather than using a combination of models, these approaches learn a single model to solve language, perception, and planning challenges. This reduces the amount of engineering required and eliminates the need for hand-crafted meaning representations. At each step, the agent maps its current inputs to the next action using a single learned function that is executed repeatedly until task completion."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2799,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "Although executing the same computation at each step simplifies modeling, it exemplifies certain inefficiencies; while the agent needs to decide what action to take at each step, identifying its goal is only required once every several steps or even once per execution. The left instruction in Figure 1 illustrates this. The agent can compute its"
            },
            {
                "block_id": 11,
                "type": "image",
                "bbox": [
                    1292,
                    919,
                    1714,
                    1340
                ],
                "angle": 0,
                "content": null,
                "caption": "After reaching the hydrant head towards the blue fence and pass towards the right side of the well."
            },
            {
                "block_id": 13,
                "type": "image",
                "bbox": [
                    1754,
                    919,
                    2173,
                    1340
                ],
                "angle": 0,
                "content": null,
                "caption": "Put the cereal, the sponge, and the dishwashing soap into the cupboard above the sink."
            },
            {
                "block_id": 15,
                "type": "image_caption",
                "bbox": [
                    1267,
                    1532,
                    2193,
                    1704
                ],
                "angle": 0,
                "content": "Figure 1: Example instructions from our two tasks: LANI (left) and CHAI (right). LANI is a landmark navigation task, and CHAI is a corpus of instructions in the CHALET environment."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    1722,
                    2193,
                    2059
                ],
                "angle": 0,
                "content": "goal once given the initial observation, and given this goal can then generate the actions required. In this paper, we study a new model that explicitly distinguishes between goal selection and action generation, and introduce two instruction following benchmark tasks to evaluate it."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    2062,
                    2193,
                    2339
                ],
                "angle": 0,
                "content": "Our model decomposes into goal prediction and action generation. Given a natural language instruction and system observations, the model predicts the goal to complete. Given the goal, the model generates a sequence of actions."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    2346,
                    2195,
                    3020
                ],
                "angle": 0,
                "content": "The key challenge we address is designing the goal representation. We avoid manually designing a meaning representation, and predict the goal in the agent's observation space. Given the image of the environment the agent observes, we generate a probability distribution over the image to highlight the goal location. We treat this prediction as image generation, and develop LINGUNET, a language conditioned variant of the U-NET image-to-image architecture (Ronneberger et al., 2015). Given the visual goal prediction, we generate actions using a recurrent neural network (RNN)."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    3023,
                    2193,
                    3195
                ],
                "angle": 0,
                "content": "Our model decomposition offers two key advantages. First, we can use different learning methods as appropriate for the goal prediction and action"
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1290,
                    3322
                ],
                "angle": 0,
                "content": "2667"
            },
            {
                "block_id": 21,
                "type": "footer",
                "bbox": [
                    401,
                    3325,
                    2074,
                    3367
                ],
                "angle": 0,
                "content": "Proceedings of the 2018 Conference on Empirical Methods in Natural Language Processing, pages 2667-2678"
            },
            {
                "block_id": 22,
                "type": "footer",
                "bbox": [
                    458,
                    3367,
                    2017,
                    3409
                ],
                "angle": 0,
                "content": "Brussels, Belgium, October 31 - November 4, 2018. ©2018 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1223,
                    1171
                ],
                "angle": 0,
                "content": "generation problems. We find supervised learning more effective for goal prediction, where only a limited amount of natural language data is available. For action generation, where exploration is critical, we use policy gradient in a contextual bandit setting (Misra et al., 2017). Second, the goal distribution is easily interpretable by overlaying it on the agent observations. This can be used to increase the safety of physical systems by letting the user verify the goal before any action is executed. Despite the decomposition, our approach retains the advantages of the single-model approach. It does not require designing intermediate representations, and training does not rely on external resources, such as pre-trained parsers or object detectors, instead using demonstrations only."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    1192,
                    1220,
                    2666
                ],
                "angle": 0,
                "content": "We introduce two new benchmark tasks with different levels of complexity of goal prediction and action generation. LANI is a 3D navigation environment and corpus, where an agent navigates between landmarks. The corpus includes 6,000 sequences of natural language instructions, each containing on average 4.7 instructions. CHAI is a corpus of 1,596 instruction sequences, each including 7.7 instructions on average, for CHALET, a 3D house environment (Yan et al., 2018). Instructions combine navigation and simple manipulation, including moving objects and opening containers. Both tasks require solving language challenges, including spatial and temporal reasoning, as well as complex perception and planning problems. While LANI provides a task where most instructions include a single goal, the CHAI instructions often require multiple intermediate goals. For example, the household instruction in Figure 1 can be decomposed to eight goals: opening the cupboard, picking each item and moving it to the cupboard, and closing the cupboard. Achieving each goal requires multiple actions of different types, including moving and acting on objects. This allows us to experiment with a simple variation of our model to generate intermediate goals."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    2687,
                    1223,
                    3195
                ],
                "angle": 0,
                "content": "We compare our approach to multiple recent methods. Experiments on the LANI navigation task indicate that decomposing goal prediction and action generation significantly improves instruction execution performance. While we observe similar trends on the CHAI instructions, results are overall weaker, illustrating the complexity of the task. We also observe that inherent ambiguities in instruction following make exact"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2200,
                    550
                ],
                "angle": 0,
                "content": "goal identification difficult, as demonstrated by imperfect human performance. However, the gap to human-level performance still remains large across both tasks. Our code and data are available at github.com/clic-lab/ciff."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    1267,
                    585,
                    1783,
                    638
                ],
                "angle": 0,
                "content": "2 Technical Overview"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    663,
                    2195,
                    1052
                ],
                "angle": 0,
                "content": "Task Let \\(\\mathcal{X}\\) be the set of all instructions, \\(S\\) the set of all world states, and \\(\\mathcal{A}\\) the set of all actions. An instruction \\(\\bar{x} \\in \\mathcal{X}\\) is a sequence \\(\\langle x_1, \\ldots, x_n \\rangle\\), where each \\(x_i\\) is a token. The agent executes instructions by generating a sequence of actions, and indicates execution completion with the special action STOP."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    1062,
                    2200,
                    1848
                ],
                "angle": 0,
                "content": "The sets of actions \\(\\mathcal{A}\\) and states \\(S\\) are domain specific. In the navigation domain LANI, the actions include moving the agent and changing its orientation. The state information includes the position and orientation of the agent and the different landmarks. The agent actions in the CHALET house environment include moving and changing the agent orientation, as well as an object interaction action. The state encodes the position and orientation of the agent and all objects in the house. For interactive objects, the state also includes their status, for example if a drawer is open or closed. In both domains, the actions are discrete. The domains are described in Section 6."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1859,
                    2198,
                    2476
                ],
                "angle": 0,
                "content": "Model The agent does not observe the world state directly, but instead observes its pose and an RGB image of the environment from its point of view. We define these observations as the agent context \\(\\tilde{s}\\). An agent model is a function from an agent context \\(\\tilde{s}\\) to an action \\(a \\in \\mathcal{A}\\). We model goal prediction as predicting a probability distribution over the agent visual observations, representing the likelihood of locations or objects in the environment being target positions or objects to be acted on. Our model is described in Section 4."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    2487,
                    2198,
                    3065
                ],
                "angle": 0,
                "content": "Learning We assume access to training data with \\(N\\) examples \\(\\{(\\bar{x}^{(i)},s_1^{(i)},s_g^{(i)})\\}_{i = 1}^N\\), where \\(\\bar{x}^{(i)}\\) is an instruction, \\(s_1^{(i)}\\) is a start state, and \\(s_g^{(i)}\\) is the goal state. We decompose learning; training goal prediction using supervised learning, and action generation using oracle goals with policy gradient in a contextual bandit setting. We assume an instrumented environment with access to the world state, which is used to compute rewards during training only. Learning is described in Section 5."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    3076,
                    2195,
                    3202
                ],
                "angle": 0,
                "content": "Evaluation We evaluate task performance on a test set \\(\\{(\\bar{x}^{(i)},s_1^{(i)},s_g^{(i)})\\}_{i = 1}^M\\) , where \\(\\bar{x}^{(i)}\\) is an in"
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2668"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    287,
                    256,
                    1210,
                    445
                ],
                "angle": 0,
                "content": "struction, \\( s_1^{(i)} \\) is a start state, and \\( s_g^{(i)} \\) is the goal state. We evaluate task completion accuracy and the distance of the agent's final state to \\( s_g^{(i)} \\)."
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    287,
                    463,
                    677,
                    515
                ],
                "angle": 0,
                "content": "3 Related Work"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    540,
                    1213,
                    1382
                ],
                "angle": 0,
                "content": "Mapping instruction to action has been studied extensively with intermediate symbolic representations (e.g., Chen and Mooney, 2011; Kim and Mooney, 2012; Artzi and Zettlemoyer, 2013; Artzi et al., 2014; Misra et al., 2015, 2016). Recently, there has been growing interest in direct mapping from raw visual observations to actions (Misra et al., 2017; Xiong et al., 2018; Anderson et al., 2018; Fried et al., 2018). We propose a model that enjoys the benefits of such direct mapping, but explicitly decomposes that task to interpretable goal prediction and action generation. While we focus on natural language, the problem has also been studied using synthetic language (Chaplot et al., 2018; Hermann et al., 2017)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1385,
                    1213,
                    1890
                ],
                "angle": 0,
                "content": "Our model design is related to hierarchical reinforcement learning, where sub-policies at different levels of the hierarchy are used at different frequencies (Sutton et al., 1998). Oh et al. (2017) uses a two-level hierarchy for mapping synthetic language to actions. Unlike our visual goal representation, they use an opaque vector representation. Also, instead of reinforcement learning, our methods emphasize sample efficiency."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1894,
                    1213,
                    2627
                ],
                "angle": 0,
                "content": "Goal prediction is related to referring expression interpretation (Matuszek et al., 2012a; Krishnamurthy and Kollar, 2013; Kazemzadeh et al., 2014; Kong et al., 2014; Yu et al., 2016; Mao et al., 2016; Kitaev and Klein, 2017). While our model solves a similar problem for goal prediction, we focus on detecting visual goals for actions, including both navigation and manipulation, as part of an instruction following model. Using formal goal representation for instruction following was studied by MacGlashan et al. (2015). In contrast, our model generates a probability distribution over images, and does not require an ontology."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2631,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": "Our data collection is related to existing work. LANI is inspired by the HCRC Map Task (Anderson et al., 1991), where a leader directs a follower to navigate between landmarks on a map. We use a similar task, but our scalable data collection process allows for a significantly larger corpus. We also provide an interactive navigation environment, instead of only map diagrams. Unlike Map Task, our leaders and followers do not interact in real time. This abstracts away inter"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1262,
                    263,
                    2195,
                    1452
                ],
                "angle": 0,
                "content": "action challenges, similar to how the SAIL navigation corpus was collected (MacMahon et al., 2006). CHAI instructions were collected using scenarios given to workers, similar to the ATIS collection process (Hemphill et al., 1990; Dahl et al., 1994). Recently, multiple 3D research environments were released. LANI has a significantly larger state space than existing navigation environments (Hermann et al., 2017; Chaplot et al., 2018), and CHALET, the environment used for CHAI, is larger and has more complex manipulation compared to similar environments (Gordon et al., 2018; Das et al., 2018). In addition, only synthetic language data has been released for these environments. An exception is the Room-to-Room dataset (Anderson et al., 2018) that makes use of an environment of connected panoramas of house settings. Although it provides a realistic vision challenge, unlike our environments, the state space is limited to a small number of panoramas and manipulation is not possible."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    1267,
                    1469,
                    1496,
                    1525
                ],
                "angle": 0,
                "content": "4 Model"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1262,
                    1547,
                    2193,
                    2276
                ],
                "angle": 0,
                "content": "We model the agent policy as a neural network. The agent observes the world state \\( s_t \\) at time \\( t \\) as an RGB image \\( \\mathbf{I}_t \\). The agent context \\( \\tilde{s}_t \\), the information available to the agent to select the next action \\( a_t \\), is a tuple \\( (\\bar{x}, \\mathbf{I}_P, \\langle (\\mathbf{I}_1, p_1), \\dots, (\\mathbf{I}_t, p_t) \\rangle) \\), where \\( \\bar{x} \\) is the natural language instructions, \\( \\mathbf{I}_P \\) is a panoramic view of the environment from the starting position at time \\( t = 1 \\), and \\( \\langle (\\mathbf{I}_1, p_1), \\dots, (\\mathbf{I}_t, p_t) \\rangle \\) is the sequence of observations \\( \\mathbf{I}_t \\) and poses \\( p_t \\) up to time \\( t \\). The panorama \\( \\mathbf{I}_P \\) is generated through deterministic exploration by rotating \\( 360^\\circ \\) to observe the environment at the beginning of the execution."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    2280,
                    2193,
                    2673
                ],
                "angle": 0,
                "content": "The model includes two main components: goal prediction and action generation. The agent uses the panorama \\(\\mathbf{I}_P\\) to predict the goal location \\(l_{g}\\). At each time step \\(t\\), a projection of the goal location into the agent's current view \\(\\mathbf{M}_t\\) is given as input to an RNN to generate actions. The probability of an action \\(a_{t}\\) at time \\(t\\) decomposes to:"
            },
            {
                "block_id": 10,
                "type": "equation",
                "bbox": [
                    1305,
                    2680,
                    2153,
                    2852
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} P \\left(a _ {t} \\mid \\tilde {s} _ {t}\\right) = \\sum_ {l _ {g}} \\left(P \\left(l _ {g} \\mid \\bar {x}, \\mathbf {I} _ {P}\\right) \\right. \\\\ P (a _ {t} \\mid l _ {g}, (\\mathbf {I} _ {1}, p _ {1}), \\ldots , (\\mathbf {I} _ {t}, p _ {t})) \\Big) , \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    2866,
                    2190,
                    3030
                ],
                "angle": 0,
                "content": "where the first term puts the complete distribution mass on a single location (i.e., a delta function). Figure 2 illustrates the model."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3058,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "<sup>1</sup>The panorama is a concatenation of deterministic observations along the width dimension. For simplicity, we do not include these deterministic steps in the execution."
            },
            {
                "block_id": 13,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2669"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    493,
                    249,
                    2017,
                    943
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: An illustration for our architecture (Section 4) for the instruction turn left and go to the red oil drum with a LINGUNET depth of \\( m = 4 \\). The instruction \\( \\bar{x} \\) is mapped to \\( \\bar{\\mathbf{x}} \\) with an RNN, and the initial panorama observation \\( \\mathbf{I}_P \\) to \\( \\mathbf{F}_0 \\) with a CNN. LINGUNET generates \\( \\mathbf{H}_1 \\), a visual representation of the goal. First, a sequence of convolutions maps the image features \\( \\mathbf{F}_0 \\) to feature maps \\( \\mathbf{F}_1, \\ldots, \\mathbf{F}_4 \\). The text representation \\( \\bar{\\mathbf{x}} \\) is used to generate the kernels \\( \\mathbf{K}_1, \\ldots, \\mathbf{K}_4 \\), which are convolved to generate the text-conditioned feature maps \\( \\mathbf{G}_1, \\ldots, \\mathbf{G}_4 \\). These feature maps are de-convolved to \\( \\mathbf{H}_1, \\ldots, \\mathbf{H}_4 \\). The goal probability distribution \\( P_g \\) is computed from \\( \\mathbf{H}_1 \\). The goal location is the inferred from the max of \\( P_g \\). Given \\( l_g \\) and \\( p_t \\), the pose at step \\( t \\), the goal mask \\( \\mathbf{M}_t \\) is computed and passed into an RNN that outputs the action to execute."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1333,
                    1215,
                    2462
                ],
                "angle": 0,
                "content": "Goal Prediction To predict the goal location, we generate a probability distribution \\( P_{g} \\) over a feature map \\( \\mathbf{F}_0 \\) generated using convolutions from the initial panorama observation \\( \\mathbf{I}_P \\). Each element in the probability distribution \\( P_{g} \\) corresponds to an area in \\( \\mathbf{I}_P \\). Given the instruction \\( \\bar{x} \\) and panorama \\( \\mathbf{I}_P \\), we first generate their representations. From the panorama \\( \\mathbf{I}_P \\), we generate a feature map \\( \\mathbf{F}_0 = [\\mathrm{CNN}_0(\\mathbf{I}_P); \\mathbf{F}^p] \\), where \\( \\mathrm{CNN}_0 \\) is a two-layer convolutional neural network (CNN; LeCun et al., 1998) with rectified linear units (ReLU; Nair and Hinton, 2010) and \\( \\mathbf{F}^p \\) are positional embeddings. The concatenation is along the channel dimension. The instruction \\( \\bar{x} = \\langle x_1, \\dots, x_n \\rangle \\) is mapped to a sequence of hidden states \\( \\mathbf{l}_i = \\mathrm{LSTM}_x(\\psi_x(x_i), \\mathbf{l}_{i-1}) \\), \\( i = 1, \\dots, n \\) using a learned embedding function \\( \\psi_x \\) and a long short-term memory (LSTM; Hochreiter and Schmidhuber, 1997) RNN \\( \\mathrm{LSTM}_x \\). The instruction representation is \\( \\bar{\\mathbf{x}} = \\mathbf{l}_n \\)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    2469,
                    1215,
                    2925
                ],
                "angle": 0,
                "content": "We generate the probability distribution \\( P_{g} \\) over pixels in \\( \\mathbf{F}_0 \\) using LINGUNET. The architecture of LINGUNET is inspired by the U-NET image generation method (Ronneberger et al., 2015), except that the reconstruction phase is conditioned on the natural language instruction. LINGUNET first applies \\( m \\) convolutional layers to generate a sequence of feature maps \\( \\mathbf{F}_j = \\mathrm{CNN}_j(\\mathbf{F}_{j-1}) \\),"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1262,
                    1333,
                    2195,
                    2122
                ],
                "angle": 0,
                "content": "\\(j = 1\\dots m\\), where each \\(\\mathrm{CNN}_j\\) is a convolutional layer with leaky ReLU non-linearities (Maas et al., 2013) and instance normalization (Ulyanov et al., 2016). The instruction representation \\(\\bar{\\mathbf{x}}\\) is split evenly into \\(m\\) vectors \\(\\{\\bar{\\mathbf{x}}_j\\}_{j=1}^m\\), each is used to create a \\(1\\times 1\\) kernel \\(\\mathbf{K}_j = \\mathrm{AFFINE}_j(\\bar{\\mathbf{x}}_j)\\), where each \\(\\mathrm{AFFINE}_j\\) is an affine transformation followed by normalizing and reshaping. For each \\(\\mathbf{F}_j\\), we apply a 2D \\(1\\times 1\\) convolution using the text kernel \\(\\mathbf{K}_j\\) to generate a text-conditioned feature map \\(\\mathbf{G}_j = \\mathrm{CONVOLVE}(\\mathbf{K}_j,\\mathbf{F}_j)\\), where CONVOLVE convolves the kernel over the feature map. We then perform \\(m\\) deconvolutions to generate a sequence of feature maps \\(\\mathbf{H}_m,\\ldots,\\mathbf{H}_1\\):"
            },
            {
                "block_id": 5,
                "type": "equation",
                "bbox": [
                    1406,
                    2132,
                    2049,
                    2241
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} \\mathbf {H} _ {m} = \\operatorname {D E C O N V} _ {m} \\left(\\operatorname {D R O P O U T} \\left(\\mathbf {G} _ {m}\\right)\\right) \\\\ \\mathbf {H} _ {j} = \\operatorname {D E C O N V} _ {j} \\left(\\left[ \\mathbf {H} _ {j + 1}; \\mathbf {G} _ {j} \\right]\\right). \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1262,
                    2269,
                    2195,
                    2771
                ],
                "angle": 0,
                "content": "DROPOUT is dropout regularization (Srivastava et al., 2014) and each \\(\\mathrm{DECONV}_j\\) is a deconvolution operation followed a leaky ReLU nonlinearity and instance norm. Finally, we generate \\(P_g\\) by applying a softmax to \\(\\mathbf{H}_1\\) and an additional learned scalar bias term \\(b_{g}\\) to represent events where the goal is out of sight. For example, when the agent already stands in the goal position and therefore the panorama does not show it."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1262,
                    2778,
                    2195,
                    3115
                ],
                "angle": 0,
                "content": "We use \\( P_{g} \\) to predict the goal position in the environment. We first select the goal pixel in \\( \\mathbf{F}_0 \\) as the pixel corresponding to the highest probability element in \\( P_{g} \\). We then identify the corresponding 3D location \\( l_{g} \\) in the environment using backward camera projection, which is computed given the"
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    1317,
                    3139,
                    1890,
                    3192
                ],
                "angle": 0,
                "content": "\\(^{3}\\mathrm{DECONV}_{1}\\) does deconvolution only."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2971,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "2We generate \\(\\mathbf{F}^p\\) by creating a channel for each deterministic observation used to create the panorama, and setting all the pixels corresponding to that observation location in the panorama to 1 and all others to 0. The number of observations depends on the agent's camera angle."
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2670"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1213,
                    375
                ],
                "angle": 0,
                "content": "camera parameters and \\( p_1 \\), the agent pose at the beginning of the execution."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    385,
                    1215,
                    1171
                ],
                "angle": 0,
                "content": "Action Generation Given the predicted goal \\(l_{g}\\), we generate actions using an RNN. At each time step \\(t\\), given \\(p_{t}\\), we generate the goal mask \\(\\mathbf{M}_t\\), which has the same shape as the observed image \\(\\mathbf{I}_t\\). The goal mask \\(\\mathbf{M}_t\\) has a value of 1 for each element that corresponds to the goal location \\(l_{g}\\) in \\(\\mathbf{I}_t\\). We do not distinguish between visible or occluded locations. All other elements are set to 0. We also maintain an out-of-sight flag \\(o_t\\) that is set to 1 if (a) \\(l_{g}\\) is not within the agent's view; or (b) the max scoring element in \\(P_{g}\\) corresponds to \\(b_{g}\\), the term for events when the goal is not visible in \\(\\mathbf{I}_P\\). Otherwise, \\(o_t\\) is set to 0. We compute an action generation hidden state \\(y_{t}\\) with an RNN:"
            },
            {
                "block_id": 2,
                "type": "equation",
                "bbox": [
                    347,
                    1189,
                    1156,
                    1241
                ],
                "angle": 0,
                "content": "\\[\ny _ {t} = \\mathrm {L S T M} _ {A} \\left(\\mathrm {A F F I N E} _ {A} \\big ([ \\mathrm {F L A T} (\\mathbf {M} _ {t}); o _ {t} ]), y _ {t - 1}\\right) ,\n\\]"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1273,
                    1213,
                    1662
                ],
                "angle": 0,
                "content": "where \\(\\mathrm{FLAT}\\) flattens \\(\\mathbf{M}_t\\) into a vector, \\(\\mathrm{AFFINE}_A\\) is a learned affine transformation with ReLU, and \\(\\mathrm{LSTM}_A\\) is an LSTM RNN. The previous hidden state \\(y_{t-1}\\) was computed when generating the previous action, and the RNN is extended gradually during execution. Finally, we compute a probability distribution over actions:"
            },
            {
                "block_id": 4,
                "type": "equation",
                "bbox": [
                    354,
                    1680,
                    1146,
                    1789
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} P \\left(a _ {t} \\mid l _ {g}, \\left(\\mathbf {I} _ {1}, p _ {1}\\right), \\dots , \\left(\\mathbf {I} _ {t}, p _ {t}\\right)\\right) = \\\\ \\operatorname {S O F T M A X} \\left(\\operatorname {A F F I N E} _ {p} ([ y _ {t}; \\psi_ {T} (t) ])\\right), \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1817,
                    1215,
                    1985
                ],
                "angle": 0,
                "content": "where \\(\\psi_T\\) is a learned embedding lookup table for the current time (Chaplot et al., 2018) and \\(\\mathrm{AFFINE}_p\\) is a learned affine transformation."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1992,
                    1215,
                    2557
                ],
                "angle": 0,
                "content": "Model Parameters The model parameters \\(\\theta\\) include the parameters of the convolutions \\(\\mathrm{CNN}_0\\) and the components of LINGUNET: \\(\\mathrm{CNN}_j\\), \\(\\mathrm{AFFINE}_j\\), and \\(\\mathrm{DECONV}_j\\) for \\(j = 1, \\ldots, m\\). In addition we learn two affine transformations \\(\\mathrm{AFFINE}_A\\) and \\(\\mathrm{AFFINE}_p\\), two RNNs \\(\\mathrm{LSTM}_x\\) and \\(\\mathrm{LSTM}_A\\), two embedding functions \\(\\psi_x\\) and \\(\\psi_T\\), and the goal distribution bias term \\(b_g\\). In our experiments (Section 7), all parameters are learned without external resources."
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    287,
                    2602,
                    578,
                    2662
                ],
                "angle": 0,
                "content": "5 Learning"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2683,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "Our modeling decomposition enables us to choose different learning algorithms for the two parts. While reinforcement learning is commonly deployed for tasks that benefit from exploration (e.g., Peters and Schaal, 2008; Mnih et al., 2013), these methods require many samples due to their high sample complexity. However, when learning with natural language, only a relatively small number of samples is realistically available. This problem"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    266,
                    2195,
                    827
                ],
                "angle": 0,
                "content": "was addressed in prior work by learning in a contextual bandit setting (Misra et al., 2017) or mixing reinforcement and supervised learning (Xiong et al., 2018). Our decomposition uniquely offers to tease apart the language understanding problem and address it with supervised learning, which generally has lower sample complexity. For action generation though, where exploration can be autonomous, we use policy gradient in a contextual bandit setting (Misra et al., 2017)."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    831,
                    2195,
                    1585
                ],
                "angle": 0,
                "content": "We assume access to training data with \\(N\\) examples \\(\\{(\\bar{x}^{(i)},s_1^{(i)},s_g^{(i)})\\}_{i = 1}^N\\), where \\(\\bar{x}^{(i)}\\) is an instruction, \\(s_1^{(i)}\\) is a start state, and \\(s_g^{(i)}\\) is the goal state. We train the goal prediction component by minimizing the cross-entropy of the predicted distribution with the gold-standard goal distribution. The gold-standard goal distribution is a deterministic distribution with probability one at the pixel corresponding to the goal location if the goal is in the field of view, or probability one at the extra out-of-sight position otherwise. The gold location is the agent's location in \\(s_g^{(i)}\\). We update the model parameters using Adam (Kingma and Ba, 2014)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    1596,
                    2193,
                    1817
                ],
                "angle": 0,
                "content": "We train action generation by maximizing the expected immediate reward the agent observes while exploring the environment. The objective for a single example \\( i \\) and time stamp \\( t \\) is:"
            },
            {
                "block_id": 12,
                "type": "equation",
                "bbox": [
                    1352,
                    1824,
                    2111,
                    1918
                ],
                "angle": 0,
                "content": "\\[\nJ = \\sum_ {a \\in \\mathcal {A}} \\pi (a \\mid \\tilde {s} _ {t}) R ^ {(i)} (s _ {t}, a) + \\lambda H (\\pi (. \\mid \\tilde {s} _ {t})) ,\n\\]"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    1918,
                    2193,
                    2652
                ],
                "angle": 0,
                "content": "where \\( R^{(i)}: \\mathcal{S} \\times \\mathcal{A} \\to \\mathbb{R} \\) is an example-specific reward function, \\( H(\\cdot) \\) is an entropy regularization term, and \\( \\lambda \\) is the regularization coefficient. The reward function \\( R^{(i)} \\) details are described in details in Appendix B. Roughly speaking, the reward function includes two additive components: a problem reward and a shaping term (Ng et al., 1999). The problem reward provides a positive reward for successful task completion, and a negative reward for incorrect completion or collision. The shaping term is positive when the agent gets closer to the goal position, and negative if it is moving away. The gradient of the objective is:"
            },
            {
                "block_id": 14,
                "type": "equation",
                "bbox": [
                    1352,
                    2662,
                    2103,
                    2813
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} \\nabla J = \\sum_ {a \\in \\mathcal {A}} \\pi (a \\mid \\tilde {s} _ {t}) \\nabla \\log \\pi (a \\mid \\tilde {s} _ {t}) R (s _ {t}, a) \\\\ + \\lambda \\nabla H (\\pi (.. | \\tilde {s} _ {t}) . \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1262,
                    2848,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "We approximate the gradient by sampling an action using the policy (Williams, 1992), and use the gold goal location computed from \\( s_g^{(i)} \\). We perform several parallel rollouts to compute gradients and update the parameters using Hogwild! (Recht et al., 2011) and Adam learning rates."
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1287,
                    3325
                ],
                "angle": 0,
                "content": "2671"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    342,
                    252,
                    1166,
                    519
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset Statistic</td><td>LANI</td><td>CHAI</td></tr><tr><td>Number paragraphs</td><td>6,000</td><td>1,596</td></tr><tr><td>Mean instructions per paragraph</td><td>4.7</td><td>7.70</td></tr><tr><td>Mean actions per instruction</td><td>24.6</td><td>54.5</td></tr><tr><td>Mean tokens per instruction</td><td>12.1</td><td>8.4</td></tr><tr><td>Vocabulary size</td><td>2,292</td><td>1,018</td></tr></table>",
                "caption": "Table 1: Summary statistics of the two corpora."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    613,
                    707,
                    663
                ],
                "angle": 0,
                "content": "6 Tasks and Data"
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    691,
                    516,
                    740
                ],
                "angle": 0,
                "content": "6.1 LANI"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    764,
                    1213,
                    1041
                ],
                "angle": 0,
                "content": "The goal of LANI is to evaluate how well an agent can follow navigation instructions. The agent task is to follow a sequence of instructions that specify a path in an environment with multiple landmarks. Figure 1 (left) shows an example instruction."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1048,
                    1213,
                    1831
                ],
                "angle": 0,
                "content": "The environment is a fenced, square, grass field. Each instance of the environment contains between 6-13 randomly placed landmarks, sampled from 63 unique landmarks. The agent can take four types of discrete actions: FORWARD, TURNRIGHT, TURNLEFT, and STOP. The field is of size \\(50 \\times 50\\), the distance of the FORWARD action is 1.5, and the turn angle is \\(15^{\\circ}\\). The environment simulator is implemented in Unity3D. At each time step, the agent performs an action, observes a first person view of the environment as an RGB image, and receives a scalar reward. The simulator provides a socket API to control the agent and the environment."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1838,
                    1213,
                    2059
                ],
                "angle": 0,
                "content": "Agent performance is evaluated using two metrics: task completion accuracy, and stop distance error. A task is completed correctly if the agent stops within an aerial distance of 5 from the goal."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2066,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "We collect a corpus of navigation instructions using crowdsourcing. We randomly generate environments, and generate one reference path for each environment. To elicit linguistically interesting instructions, reference paths are generated to pass near landmarks. We use Amazon Mechanical Turk, and split the annotation process to two tasks. First, given an environment and a reference path, a worker writes an instruction paragraph for following the path. The second task requires another worker to control the agent to perform the instructions and simultaneously mark at each point what part of the instruction was executed. The recording of the second worker creates the final data of segmented instructions and demonstrations. The generated reference path is displayed in both tasks. The second worker could also mark the paragraph as invalid. Both tasks are done from an overhead view of the environment, but workers are instructed to provide instructions for a robot that ob"
            },
            {
                "block_id": 8,
                "type": "image",
                "bbox": [
                    1342,
                    256,
                    2126,
                    680
                ],
                "angle": 0,
                "content": null,
                "caption": "[Go around the pillar on the right hand side] [and head towards the boat, circling around it clockwise.] [When you are facing the tree, walk towards it, and the pass on the right hand side,] [and the left hand side of the cone. Circle around the cone,] [and then walk past the hydrant on your right,] [and the the tree stump.] [Circle around the stump and then stop right behind it.]"
            },
            {
                "block_id": 10,
                "type": "image_caption",
                "bbox": [
                    1265,
                    1003,
                    2193,
                    1220
                ],
                "angle": 0,
                "content": "Figure 3: Segmented instructions in the LANI domain. The original reference path is marked in red (start) and blue (end). The agent, using a drone icon, is placed at the beginning of the path. The follower path is coded in colors to align to the segmented instruction paragraph."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    1238,
                    2193,
                    1515
                ],
                "angle": 0,
                "content": "serves the environment from a first person view. Figure 3 shows a reference path and the written instruction. This data can be used for evaluating both executing sequences of instructions and single instructions in isolation."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    1522,
                    2193,
                    1918
                ],
                "angle": 0,
                "content": "Table 1 shows the corpus statistics. Each paragraph corresponds to a single unique instance of the environment. The paragraphs are split into train, test, and development, with a \\(70\\% / 15\\% / 15\\%\\) split. Finally, we sample 200 single development instructions for qualitative analysis of the language challenge the corpus presents (Table 2)."
            },
            {
                "block_id": 13,
                "type": "title",
                "bbox": [
                    1267,
                    1960,
                    1496,
                    2006
                ],
                "angle": 0,
                "content": "6.2 CHAI"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    2034,
                    2193,
                    3101
                ],
                "angle": 0,
                "content": "The CHAI corpus combines both navigation and simple manipulation in a complex, simulated household environment. We use the CHALET simulator (Yan et al., 2018), a 3D house simulator that provides multiple houses, each with multiple rooms. The environment supports moving between rooms, picking and placing objects, and opening and closing cabinets and similar containers. Objects can be moved between rooms and in and out of containers. The agent observes the world in first-person view, and can take five actions: FORWARD, TURNLEFT, TURNRIGHT, STOP, and INTERACT. The INTERACT action acts on objects. It takes as argument a 2D position in the agent's view. Agent performance is evaluated with two metrics: (a) stop distance, which measures the distance of the agent's final state to the final annotated position; and (b) manipulation accuracy, which compares the set of manipulation actions"
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    1317,
                    3136,
                    2111,
                    3192
                ],
                "angle": 0,
                "content": "4 Appendix A provides statistics for related datasets."
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2672"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    329,
                    256,
                    2153,
                    824
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Category</td><td colspan=\"2\">Count</td><td rowspan=\"2\">Example</td></tr><tr><td>LANI</td><td>CHAI</td></tr><tr><td>Spatial relations between locations</td><td>123</td><td>52</td><td>LANI: go to the right side of the rock\nCHAI: pick up the cup next to the bathtub and place it on…</td></tr><tr><td>Conjunctions of two more locations</td><td>36</td><td>5</td><td>LANI: fly between the mushroom and the yellow cone\nCHAI: … set it on the table next to the juice and milk.</td></tr><tr><td>Temporal coordination of sub-goals</td><td>65</td><td>68</td><td>LANI: at the mushroom turn right and move forward towards the statue\nCHAI: go back to the kitchen and put the glass in the sink.</td></tr><tr><td>Constraints on the shape of trajectory</td><td>94</td><td>0</td><td>LANI: go past the house by the right side of the apple</td></tr><tr><td>Co-reference</td><td>32</td><td>18</td><td>LANI: turn around it and move in front of fern plant\nCHAI: turn left, towards the kitchen door and move through it.</td></tr><tr><td>Comparatives</td><td>2</td><td>0</td><td>LANI: … the small stone closest to the blue and white fences stop</td></tr></table>",
                "caption": "Table 2: Qualitative analysis of the LANI and CHAI corpora. We sample 200 single development instructions from each corpora. For each category, we count how many examples of the 200 contained it and show an example."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    320,
                    954,
                    1190,
                    1634
                ],
                "angle": 0,
                "content": "<table><tr><td>Scenario</td></tr><tr><td>You have several hours before guests begin to arrive for a dinner party. You are preparing a wide variety of meat dishes, and need to put them in the sink. In addition, you want to remove things in the kitchen, and bathroom which you don’t want your guests seeing, like the soaps in the bathroom, and the dish cleaning items. You can put these in the cupboards. Finally, put the dirty dishes around the house in the dishwasher and close it.</td></tr><tr><td>Written Instructions</td></tr><tr><td>[In the kitchen, open the cupboard above the sink.] [Put the cereal, the sponge, and the dishwashing soap into the cupboard above the sink.] [Close the cupboard.] [Pick up the meats and put them into the sink.] [Open the dishwasher, grab the dirty dishes on the counter, and put the dishes into the dishwasher.]</td></tr></table>"
            },
            {
                "block_id": 3,
                "type": "image_caption",
                "bbox": [
                    287,
                    1648,
                    1213,
                    1739
                ],
                "angle": 0,
                "content": "Figure 4: Scenario and segmented instruction from the CHAI corpus."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1768,
                    1213,
                    2325
                ],
                "angle": 0,
                "content": "to a reference set. When measuring distance, to consider the house plan, we compute the minimal aerial distance for each room that must be visited. Yan et al. (2018) provides the full details of the simulator and evaluation. We use five different houses, each with up to six rooms. Each room contains on average 30 objects. A typical room is of size \\(6 \\times 6\\). We set the distance of FORWARD to 0.1, the turn angle to \\(90^{\\circ}\\), and divide the agent's view to a \\(32 \\times 32\\) grid for the INTERACT action."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2336,
                    1215,
                    3009
                ],
                "angle": 0,
                "content": "We collected a corpus of navigation and manipulation instructions using Amazon Mechanical Turk. We created 36 common household scenarios to provide a familiar context to the task.<sup>5</sup> We use two crowdsourcing tasks. First, we provide workers with a scenario and ask them to write instructions. The workers are encouraged to explore the environment and interact with it. We then segment the instructions to sentences automatically. In the second task, workers are presented with the segmented sentences in order and asked to execute them. After finishing a sentence, the workers re"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    961,
                    2195,
                    1238
                ],
                "angle": 0,
                "content": "quest the next sentence. The workers do not see the original scenario. Figure 4 shows a scenario and the written segmented paragraph. Similar to LANI, CHAI data can be used for studying complete paragraphs and single instructions."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1241,
                    2193,
                    1466
                ],
                "angle": 0,
                "content": "Table 1 shows the corpus statistics.\\(^{6}\\) The paragraphs are split into train, test, and development, with a \\(70\\% / 15\\% / 15\\%\\) split. Table 2 shows qualitative analysis of a sample of 200 instructions."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    1267,
                    1497,
                    1786,
                    1557
                ],
                "angle": 0,
                "content": "7 Experimental Setup"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    1575,
                    2193,
                    2985
                ],
                "angle": 0,
                "content": "Method Adaptations for CHAI We apply two modifications to our model to support intermediate goal for the CHAI instructions. First, we train an additional RNN to predict the sequence of intermediate goals given the instruction only. There are two types of goals: NAVIGATION, for action sequences requiring movement only and ending with the STOP action; and INTERACTION, for sequence of movement actions that end with an INTERACT action. For example, for the instruction pick up the red book and go to the kitchen, the sequence of goals will be \\(\\langle\\) INTERACTION, NAVIGATION, NAVIGATION \\(\\rangle\\). This indicates the agent must first move to the object to pick it up via interaction, move to the kitchen door, and finally move within the kitchen. The process of executing an instruction starts with predicting the sequence of goal types. We call our model (Section 4) separately for each goal type. The execution concludes when the final goal is completed. For learning, we create a separate example for each intermediate goal and train the additional RNN separately. The second modification is replacing the backward camera projection for inferring the goal location with ray casting to iden"
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3016,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "The number of actions per instruction is given in the more fine-grained action space used during collection. To make the required number of actions smaller, we use the more coarse action space specified."
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3055,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "<sup>5</sup>We observed that asking workers to simply write instructions without providing a scenario leads to combinations of repetitive instructions unlikely to occur in reality."
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1290,
                    3325
                ],
                "angle": 0,
                "content": "2673"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    310,
                    252,
                    1198,
                    810
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Method</td><td colspan=\"2\">LANI</td><td colspan=\"2\">CHAI</td></tr><tr><td>SD</td><td>TC</td><td>SD</td><td>MA</td></tr><tr><td>STOP</td><td>15.37</td><td>8.20</td><td>2.99</td><td>37.53</td></tr><tr><td>RANDOMWALK</td><td>14.80</td><td>9.66</td><td>2.99</td><td>28.96</td></tr><tr><td>MOSTFREQUENT</td><td>19.31</td><td>2.94</td><td>3.80</td><td>37.53</td></tr><tr><td>MISRA17</td><td>10.54</td><td>22.9</td><td>2.99</td><td>32.25</td></tr><tr><td>CHAPLOT18</td><td>9.05</td><td>31.0</td><td>2.99</td><td>37.53</td></tr><tr><td>Our Approach (OA)</td><td>8.65</td><td>35.72</td><td>2.75</td><td>37.53</td></tr><tr><td>OA w/o RNN</td><td>9.21</td><td>31.30</td><td>3.75</td><td>37.43</td></tr><tr><td>OA w/o Language</td><td>10.65</td><td>23.02</td><td>3.22</td><td>37.53</td></tr><tr><td>OA w/joint</td><td>11.54</td><td>21.76</td><td>2.99</td><td>36.90</td></tr><tr><td>OA w/oracle goals</td><td>2.13</td><td>94.60</td><td>2.19</td><td>41.07</td></tr></table>",
                "caption": "Table 3: Performance on the development data."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    287,
                    912,
                    1213,
                    1024
                ],
                "angle": 0,
                "content": "tify INTERACTION goals, which are often objects that are not located on the ground."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1031,
                    1215,
                    1761
                ],
                "angle": 0,
                "content": "Baselines We compare our approach against the following baselines: (a) STOP: Agent stops immediately; (b) RANDOMWALK: Agent samples actions uniformly until it exhausts the horizon or stops; (c) MOSTFREQUENT: Agent takes the most frequent action in the data, FORWARD for both datasets, until it exhausts the horizon; (d) MISRA17: the approach of Misra et al. (2017); and (e) CHAPLOT18: the approach of Chaplot et al. (2018). We also evaluate goal prediction and compare to the method of Janner et al. (2018) and a CENTER baseline, which always predict the center pixel. Appendix C provides baseline details."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1771,
                    1215,
                    2508
                ],
                "angle": 0,
                "content": "Evaluation Metrics We evaluate using the metrics described in Section 6: stop distance (SD) and task completion (TC) for LANI, and stop distance (SD) and manipulation accuracy (MA) for CHAI. To evaluate the goal prediction, we report the real distance of the predicted goal from the annotated goal and the percentage of correct predictions. We consider a goal correct if it is within a distance of 5.0 for LANI and 1.0 for CHAI. We also report human evaluation for LANI by asking raters if the generated path follows the instruction on a Likert-type scale of 1-5. Raters were shown the generated path, the reference path, and the instruction."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    287,
                    2511,
                    1215,
                    2852
                ],
                "angle": 0,
                "content": "Parameters We use a horizon of 40 for both domains. During training, we allow additional 5 steps to encourage learning even after errors. When using intermediate goals in CHAI, the horizon is used for each intermediate goal separately. All other parameters and detailed in Appendix D."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    287,
                    2887,
                    535,
                    2936
                ],
                "angle": 0,
                "content": "8 Results"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    287,
                    2967,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "Tables 3 and 4 show development and test results. Both sets of experiments demonstrate similar trends. The low performance of STOP, RANDOMWALK, and MOSTFREQUENT demonstrates"
            },
            {
                "block_id": 8,
                "type": "table",
                "bbox": [
                    1312,
                    252,
                    2151,
                    624
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Method</td><td colspan=\"2\">LANI</td><td colspan=\"2\">CHAI</td></tr><tr><td>SD</td><td>TC</td><td>SD</td><td>MA</td></tr><tr><td>STOP</td><td>15.18</td><td>8.29</td><td>3.59</td><td>39.77</td></tr><tr><td>RANDOMWALK</td><td>14.63</td><td>9.76</td><td>3.59</td><td>33.29</td></tr><tr><td>MOSTFrequent</td><td>19.14</td><td>3.15</td><td>4.36</td><td>39.77</td></tr><tr><td>MISRA17</td><td>10.23</td><td>23.2</td><td>3.59</td><td>36.84</td></tr><tr><td>CHAPLOT18</td><td>8.78</td><td>31.9</td><td>3.59</td><td>39.76</td></tr><tr><td>Our Approach</td><td>8.43</td><td>36.9</td><td>3.34</td><td>39.97</td></tr></table>",
                "caption": "Table 4: Performance on the held-out test dataset."
            },
            {
                "block_id": 10,
                "type": "table",
                "bbox": [
                    1314,
                    694,
                    2153,
                    915
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Method</td><td colspan=\"2\">LANI</td><td colspan=\"2\">CHAI</td></tr><tr><td>Dist</td><td>Acc</td><td>Dist</td><td>Acc</td></tr><tr><td>CENTER</td><td>12.0</td><td>19.51</td><td>3.41</td><td>19.0</td></tr><tr><td>Janner et al. (2018)</td><td>9.61</td><td>30.26</td><td>2.81</td><td>28.3</td></tr><tr><td>Our Approach</td><td>8.67</td><td>35.83</td><td>2.12</td><td>40.3</td></tr></table>",
                "caption": "Table 5: Development goal prediction performance. We measure distance (Dist) and accuracy (Acc)."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1262,
                    1045,
                    2193,
                    1550
                ],
                "angle": 0,
                "content": "the challenges of both tasks, and shows the tasks are robust to simple biases. On LANI, our approach outperforms CHAPLOT18, improving task completion (TC) accuracy by \\(5\\%\\), and both methods outperform MISRA17. On CHAI, CHAPLOT18 and MISRA17 both fail to learn, while our approach shows an improvement on stop distance (SD). However, all models perform poorly on CHAI, especially on manipulation (MA)."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    1554,
                    2193,
                    2059
                ],
                "angle": 0,
                "content": "To isolate navigation performance on CHAI, we limit our train and test data to instructions that include navigation actions only. The STOP baseline on these instructions gives a stop distance (SD) of 3.91, higher than the average for the entire data as these instructions require more movement. Our approach gives a stop distance (SD) of 3.24, a \\(17\\%\\) reduction of error, significantly better than the \\(8\\%\\) reduction of error over the entire corpus."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    2066,
                    2193,
                    2627
                ],
                "angle": 0,
                "content": "We also measure human performance on a sample of 100 development examples for both tasks. On LANI, we observe a stop distance error (SD) of 5.2 and successful task completion (TC) \\(63\\%\\) of the time. On CHAI, the human distance error (SD) is 1.34 and the manipulation accuracy is \\(100\\%\\). The imperfect performance demonstrates the inherent ambiguity of the tasks. The gap to human performance is still large though, demonstrating that both tasks are largely open problems."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1262,
                    2631,
                    2195,
                    3195
                ],
                "angle": 0,
                "content": "The imperfect human performance raises questions about automated evaluation. In general, we observe that often measuring execution quality with rigid goals is insufficient. We conduct a human evaluation with 50 development examples from LANI rating human performance and our approach. Figure 5 shows a histogram of the ratings. The mean rating for human followers is 4.38, while our approach's is 3.78; we observe a similar trend to before with this metric. Using"
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2674"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    312,
                    256,
                    1193,
                    557
                ],
                "angle": 0,
                "content": "<table><tr><td>Category</td><td>Present</td><td>Absent</td><td>p-value</td></tr><tr><td>Spatial relations</td><td>8.75</td><td>10.09</td><td>.262</td></tr><tr><td>Location conjunction</td><td>10.19</td><td>9.05</td><td>.327</td></tr><tr><td>Temporal coordination</td><td>11.38</td><td>8.24</td><td>.015</td></tr><tr><td>Trajectory constraints</td><td>9.56</td><td>8.99</td><td>.607</td></tr><tr><td>Co-reference</td><td>12.88</td><td>8.59</td><td>.016</td></tr><tr><td>Comparatives</td><td>10.22</td><td>9.25</td><td>.906</td></tr></table>",
                "caption": "Table 6: Mean goal prediction error for LANI instructions with and without the analysis categories we used in Table 2. The \\( p \\)-values are from two-sided \\( t \\)-tests comparing the means in each row."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    302,
                    761,
                    1113,
                    1041
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 5: Likert rating histogram for expert human follower and our approach for LANI."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    282,
                    1164,
                    1213,
                    1504
                ],
                "angle": 0,
                "content": "judgements on our approach, we correlate the human metric with the SD measure. We observe a Pearson correlation -0.65 (p=5e-7), indicating that our automated metric correlates well with human judgment.\\(^{7}\\) This initial study suggests that our automated evaluation is appropriate for this task."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1508,
                    1213,
                    2069
                ],
                "angle": 0,
                "content": "Our ablations (Table 3) demonstrate the importance of each of the components of the model. We ablate the action generation RNN (w/o RNN), completely remove the language input (w/o Language), and train the model jointly (w/joint Learning). On CHAI especially, ablations results in models that display ineffective behavior. Of the ablations, we observe the largest benefit from decomposing the learning and using supervised learning for the language problem."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2076,
                    1213,
                    2638
                ],
                "angle": 0,
                "content": "We also evaluate our approach with access to oracle goals (Table 3). We observe this improves navigation performance significantly on both tasks. However, the model completely fails to learn a reasonable manipulation behavior for CHAI. This illustrates the planning complexity of this domain. A large part of the improvement in measured navigation behavior is likely due to eliminating much of the ambiguity the automated metric often fails to capture."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    287,
                    2648,
                    1213,
                    2925
                ],
                "angle": 0,
                "content": "Finally, on goal prediction (Table 5), our approach outperforms the method of Janner et al. (2018). Figure 6 and Appendix Figure 7 show example goal predictions. In Table 6, we break down LANI goal prediction results for the analysis cate"
            },
            {
                "block_id": 8,
                "type": "image",
                "bbox": [
                    1322,
                    252,
                    2143,
                    399
                ],
                "angle": 0,
                "content": null,
                "caption": "curve around big rock keeping it to your left ."
            },
            {
                "block_id": 10,
                "type": "image",
                "bbox": [
                    1322,
                    480,
                    2143,
                    627
                ],
                "angle": 0,
                "content": null,
                "caption": "walk over to the cabinets and open the cabinet doors up"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    712,
                    2193,
                    1252
                ],
                "angle": 0,
                "content": "Figure 6: Goal prediction probability maps \\( P_{g} \\) overlaid on the corresponding observed panoramas \\( \\mathbf{I}_{P} \\). The top example shows a result on LANI, the bottom on CHAI. gories we used in Table 2 using the same sample of the data. Appendix E includes a similar table for CHAI. We observe that our approach finds instructions with temporal coordination or co-reference challenging. Co-reference is an expected limitation; with single instructions, the model can not resolve references to previous instructions."
            },
            {
                "block_id": 13,
                "type": "title",
                "bbox": [
                    1267,
                    1259,
                    1582,
                    1308
                ],
                "angle": 0,
                "content": "9 Discussion"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    1322,
                    2193,
                    2781
                ],
                "angle": 0,
                "content": "We propose a model for instruction following with explicit separation of goal prediction and action generation. Our representation of goal prediction is easily interpretable, while not requiring the design of logical ontologies and symbolic representations. A potential limitation of our approach is cascading errors. Action generation relies completely on the predicted goal and is not exposed to the language otherwise. This also suggests a second related limitation: the model is unlikely to successfully reason about instructions that include constraints on the execution itself. While the model may reach the final goal correctly, it is unlikely to account for the intermediate trajectory constraints. As we show (Table 2), such instructions are common in our data. These two limitations may be addressed by allowing action generation access to the instruction. Achieving this while retaining an interpretable goal representation that clearly determines the execution is an important direction for future work. Another important open question concerns automated evaluation, which remains especially challenging when instructions do not only specify goals, but also constraints on how to achieve them. Our resources provide the platform and data to conduct this research."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1267,
                    2795,
                    1669,
                    2844
                ],
                "angle": 0,
                "content": "Acknowledgments"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    2855,
                    2193,
                    3188
                ],
                "angle": 0,
                "content": "This research was supported by NSF (CRII-1656998), Schmidt Sciences, and cloud computing credits from Microsoft. We thank John Langford, Claudia Yan, Bharath Hariharan, Noah Snavely, the Cornell NLP group, and the anonymous reviewers for their advice."
            },
            {
                "block_id": 17,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2971,
                    1213,
                    3139
                ],
                "angle": 0,
                "content": "<sup>7</sup>We did not observe this kind of clear anti-correlation comparing the two results for human performance (Pearson correlation of 0.09 and \\( p = 0.52 \\)). The limited variance in human performance makes correlation harder to test."
            },
            {
                "block_id": 18,
                "type": "page_footnote",
                "bbox": [
                    344,
                    3139,
                    1106,
                    3192
                ],
                "angle": 0,
                "content": "8 Appendix C provides the details of joint learning."
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    285,
                    2971,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1290,
                    3325
                ],
                "angle": 0,
                "content": "2675"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    292,
                    263,
                    535,
                    315
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    329,
                    1213,
                    610
                ],
                "angle": 0,
                "content": "Anne H Anderson, Miles Bader, Ellen Gurman Bard, Elizabeth Boyle, Gwyneth Doherty, Simon Garrod, Stephen Isard, Jacqueline Kowtko, Jan McAllister, Jim Miller, Catherine Sotillo, Henry S. Thompson, and Regina Weinert. 1991. The HCRC map task corpus. Language and Speech, 34."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    641,
                    1213,
                    968
                ],
                "angle": 0,
                "content": "Peter Anderson, Qi Wu, Damien Teney, Jake Bruce, Mark Johnson, Niko Sunderhauf, Ian Reid, Stephen Gould, and Anton van den Hengel. 2018. Vision- and-language navigation: Interpreting visually-grounded navigation instructions in real environments. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    999,
                    1213,
                    1192
                ],
                "angle": 0,
                "content": "Yoav Artzi, Dipanjan Das, and Slav Petrov. 2014. Learning compact lexicons for CCG semantic parsing. In Proceedings of the 2014 Conference on Empirical Methods in Natural Language Processing."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1224,
                    1213,
                    1410
                ],
                "angle": 0,
                "content": "Yoav Artzi and Luke Zettlemoyer. 2013. Weakly supervised learning of semantic parsers for mapping instructions to actions. Transactions of the Association of Computational Linguistics, 1."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1441,
                    1213,
                    1676
                ],
                "angle": 0,
                "content": "Yonatan Bisk, Daniel Marcu, and William Wong. 2016. Towards a dataset for human computer communication via grounded language acquisition. In Proceedings of the AAAI Workshop on Symbiotic Cognitive Systems."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1711,
                    1213,
                    1943
                ],
                "angle": 0,
                "content": "Devendra Singh Chaplot, Kanthashree Mysore Sathyendra, Rama Kumar Pasumarthi, Dheeraj Rajagopal, and Ruslan Salakhutdinov. 2018. Gated-attention architectures for task-oriented language grounding."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    1978,
                    1213,
                    2164
                ],
                "angle": 0,
                "content": "David L. Chen and Raymond J. Mooney. 2011. Learning to interpret natural language navigation instructions from observations. In Proceedings of the National Conference on Artificial Intelligence."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2199,
                    1213,
                    2480
                ],
                "angle": 0,
                "content": "Deborah A Dahl, Madeleine Bates, Michael Brown, William Fisher, Kate Hunicke-Smith, David Pallett, Christine Pao, Alexander Rudnicky, and Elizabeth Shriberg. 1994. Expanding the scope of the ATIS task: The ATIS-3 corpus. In Proceedings of the workshop on Human Language Technology."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2511,
                    1213,
                    2746
                ],
                "angle": 0,
                "content": "Abhishek Das, Samyak Datta, Georgia Gkioxari, Stefan Lee, Devi Parikh, and Dhruv Batra. 2018. Embodied question answering. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2778,
                    1213,
                    3055
                ],
                "angle": 0,
                "content": "Daniel Fried, Ronghang Hu, Volkan Cirik, Anna Rohrbach, Jacob Andreas, Louis-Philippe Morency, Taylor Berg-Kirkpatrick, Kate Saenko, Dan Klein, and Trevor Darrell. 2018. Speaker-follower models for vision-and-language navigation. CoRR, abs/1806.02724."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    292,
                    3090,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "Daniel Gordon, Aniruddha Kembhavi, Mohammad Rastegari, Joseph Redmon, Dieter Fox, and Ali"
            },
            {
                "block_id": 12,
                "type": "list",
                "bbox": [
                    292,
                    329,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1317,
                    266,
                    2190,
                    452
                ],
                "angle": 0,
                "content": "Farhadi. 2018. Iqa: Visual question answering in interactive environments. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1272,
                    498,
                    2190,
                    687
                ],
                "angle": 0,
                "content": "Charles T. Hemphill, John J. Godfrey, and George R. Doddington. 1990. The ATIS spoken language systems pilot corpus. In Proceedings of the DARPA speech and natural language workshop."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    729,
                    2190,
                    1052
                ],
                "angle": 0,
                "content": "Karl Moritz Hermann, Felix Hill, Simon Green, Fumin Wang, Ryan Faulkner, Hubert Soyer, David Szepesvari, Wojciech Czarnecki, Max Jaderberg, Denis Teplyashin, Marcus Wainwright, Chris Apps, Demis Hassabis, and Phil Blunsom. 2017. Grounded language learning in a simulated 3D world. CoRR, abs/1706.06551."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1098,
                    2190,
                    1196
                ],
                "angle": 0,
                "content": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. *Neural computation*, 9."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1241,
                    2190,
                    1427
                ],
                "angle": 0,
                "content": "Michael Janner, Karthik Narasimhan, and Regina Barzilay. 2018. Representation learning for grounded spatial reasoning. Transactions of the Association for Computational Linguistics, 6."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1473,
                    2190,
                    1704
                ],
                "angle": 0,
                "content": "Sahar Kazemzadeh, Vicente Ordonez, Mark Matten, and Tamara L. Berg. 2014. Referitgame: Referring to objects in photographs of natural scenes. In Proceedings of the Conference on Empirical Methods in Natural Language Processing."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1750,
                    2190,
                    2031
                ],
                "angle": 0,
                "content": "Joohyun Kim and Raymond Mooney. 2012. Unsupervised PCFG induction for grounded language learning with highly ambiguous supervision. In Proceedings of the Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2073,
                    2190,
                    2259
                ],
                "angle": 0,
                "content": "Diederik Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. In Proceedings of the International Conference on Learning Representations."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2304,
                    2190,
                    2494
                ],
                "angle": 0,
                "content": "Nikita Kitaev and Dan Klein. 2017. Where is misty? interpreting spatial descriptors by modeling regions in space. In Proceedings of the Conference on Empirical Methods in Natural Language Processing."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2536,
                    2190,
                    2771
                ],
                "angle": 0,
                "content": "Chen Kong, Dahua Lin, Mohit Bansal, Raquel Urtasun, and Sanja Fidler. 2014. What are you talking about? text-to-image coreference. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2816,
                    2190,
                    3002
                ],
                "angle": 0,
                "content": "Jayant Krishnamurthy and T. Kollar. 2013. Jointly learning to parse and perceive: Connecting natural language to the physical world. Transactions of the Association for Computational Linguistics, 1."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1272,
                    3044,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": "Yann LeCun, Léon Bottou, Yoshua Bengio, and Patrick Haffner. 1998. Gradient-based learning applied to document recognition. Proceedings of the IEEE, 86."
            },
            {
                "block_id": 25,
                "type": "list",
                "bbox": [
                    1272,
                    266,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 26,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2676"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    295,
                    270,
                    1208,
                    452
                ],
                "angle": 0,
                "content": "Andrew L Maas, Awni Y Hannun, and Andrew Y Ng. 2013. Rectifier nonlinearities improve neural network acoustic models. In Proceedings of the international conference on machine learning."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    295,
                    487,
                    1208,
                    761
                ],
                "angle": 0,
                "content": "James MacGlashan, Monica Babes-Vroman, Marie desJardins, Michael L. Littman, Smaranda Muresan, S Bertel Squire, Stefanie Tellex, Dilip Arumugam, and Lei Yang. 2015. Grounding english commands to reward functions. In Robotics: Science and Systems."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    295,
                    796,
                    1208,
                    1027
                ],
                "angle": 0,
                "content": "Matthew MacMahon, Brian Stankiewics, and Benjamin Kuipers. 2006. Walk the talk: Connecting language, knowledge, action in route instructions. In Proceedings of the National Conference on Artificial Intelligence."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    295,
                    1062,
                    1208,
                    1333
                ],
                "angle": 0,
                "content": "Junhua Mao, Jonathan Huang, Alexander Toshev, Oana Camburu, Alan Yuille, and Kevin Murphy. 2016. Generation and Comprehension of Unambiguous Object Descriptions. In Proceedings of IEEE Conference on Computer Vision and Pattern Recognition."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    295,
                    1371,
                    1208,
                    1603
                ],
                "angle": 0,
                "content": "Cynthia Matuszek, Nicholas FitzGerald, Luke Zettle-moyer, Liefeng Bo, and Dieter Fox. 2012a. A joint model of language and perception for grounded attribute learning. In Proceedings of the International Conference on Machine Learning."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    295,
                    1634,
                    1208,
                    1866
                ],
                "angle": 0,
                "content": "Cynthia Matuszek, Evan Herbst, Luke Zettlemoyer, and Dieter Fox. 2012b. Learning to parse natural language commands to a robot control system. In Proceedings of the International Symposium on Experimental Robotics."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    295,
                    1901,
                    1208,
                    2174
                ],
                "angle": 0,
                "content": "Hongyuan Mei, Mohit Bansal, and R. Matthew Walter. 2016. What to talk about and how? selective generation using lstms with coarse-to-fine alignment. In Proceedings of the Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    295,
                    2210,
                    1208,
                    2441
                ],
                "angle": 0,
                "content": "Dipendra Misra, John Langford, and Yoav Artzi. 2017. Mapping instructions and visual observations to actions with reinforcement learning. In Proceedings of the Conference on Empirical Methods in Natural Language Processing."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    295,
                    2476,
                    1210,
                    2701
                ],
                "angle": 0,
                "content": "Dipendra K. Misra, Jaeyong Sung, Kevin Lee, and Ashutosh Saxena. 2016. Tell me dave: Context-sensitive grounding of natural language to manipulation instructions. The International Journal of Robotics Research, 35."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    295,
                    2739,
                    1208,
                    3016
                ],
                "angle": 0,
                "content": "Kumar Dipendra Misra, Kejia Tao, Percy Liang, and Ashutosh Saxena. 2015. Environment-driven lexicon induction for high-level instructions. In Proceedings of the Annual Meeting of the Association for Computational Linguistics and the International Joint Conference on Natural Language Processing."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    295,
                    3048,
                    1208,
                    3188
                ],
                "angle": 0,
                "content": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Alex Graves, Ioannis Antonoglou, Daan Wierstra, and Martin A. Riedmiller. 2013. Playing atari with"
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    295,
                    270,
                    1210,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1322,
                    270,
                    2188,
                    361
                ],
                "angle": 0,
                "content": "deep reinforcement learning. In Advances in Neural Information Processing Systems."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1275,
                    403,
                    2188,
                    585
                ],
                "angle": 0,
                "content": "Vinod Nair and Geoffrey E Hinton. 2010. Rectified linear units improve restricted boltzmann machines. In Proceedings of the international conference on machine learning."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1275,
                    624,
                    2188,
                    855
                ],
                "angle": 0,
                "content": "Andrew Y. Ng, Daishi Harada, and Stuart J. Russell. 1999. Policy invariance under reward transformations: Theory and application to reward shaping. In Proceedings of the International Conference on Machine Learning."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1275,
                    894,
                    2188,
                    1122
                ],
                "angle": 0,
                "content": "Junhyuk Oh, Satinder P. Singh, Honglak Lee, and Pushmeet Kohli. 2017. Zero-shot task generalization with multi-task deep reinforcement learning. In Proceedings of the international conference on machine learning."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1275,
                    1164,
                    2188,
                    1301
                ],
                "angle": 0,
                "content": "Jan Peters and Stefan Schaal. 2008. Reinforcement learning of motor skills with policy gradients. *Neural networks*, 21."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1275,
                    1343,
                    2188,
                    1529
                ],
                "angle": 0,
                "content": "Benjamin Recht, Christopher Re, Stephen Wright, and Feng Niu. 2011. Hogwild: A lock-free approach to parallelizing stochastic gradient descent. In Advances in Neural Information Processing Systems."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1275,
                    1568,
                    2188,
                    1792
                ],
                "angle": 0,
                "content": "Olaf Ronneberger, Philipp Fischer, and Thomas Brox. 2015. U-net: Convolutional networks for biomedical image segmentation. In International Conference on Medical image computing and computer-assisted intervention."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1275,
                    1838,
                    2188,
                    2020
                ],
                "angle": 0,
                "content": "John Schulman, Philipp Moritz, Sergey Levine, Michael I. Jordan, and Pieter Abbeel. 2015. High-dimensional continuous control using generalized advantage estimation. CoRR, abs/1506.02438."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1275,
                    2062,
                    2188,
                    2290
                ],
                "angle": 0,
                "content": "Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: A simple way to prevent neural networks from overfitting. The Journal of Machine Learning Research, 15."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1275,
                    2332,
                    2188,
                    2560
                ],
                "angle": 0,
                "content": "Alane Suhr and Yoav Artzi. 2018. Situated mapping of sequential instructions to actions with single-step reward observation. In Proceedings of the Annual Meeting of the Association for Computational Linguistics."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1275,
                    2599,
                    2188,
                    2785
                ],
                "angle": 0,
                "content": "Richard S. Sutton, Doina Precup, and Satinder P. Singh. 1998. Intra-option learning about temporally abstract actions. In Proceedings of the international conference on machine learning."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1275,
                    2823,
                    2188,
                    3006
                ],
                "angle": 0,
                "content": "Dmitry Ulyanov, Andrea Vedaldi, and Victor S. Lempitsky. 2016. Instance normalization: The missing ingredient for fast stylization. CoRR, abs/1607.08022."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1275,
                    3048,
                    2188,
                    3188
                ],
                "angle": 0,
                "content": "Ronald J. Williams. 1992. Simple statistical gradient-following algorithms for connectionist reinforcement learning. Machine Learning, 8."
            },
            {
                "block_id": 25,
                "type": "list",
                "bbox": [
                    1275,
                    270,
                    2188,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 26,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1292,
                    3325
                ],
                "angle": 0,
                "content": "2677"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    295,
                    270,
                    1210,
                    543
                ],
                "angle": 0,
                "content": "Wenhan Xiong, Xiaoxiao Guo, Mo Yu, Shiyu Chang, Bowen Zhou, and William Yang Wang. 2018. Scheduled policy optimization for natural language communication with intelligent agents. In Proceedings of the International Joint Conferences on Artificial Intelligence."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    295,
                    582,
                    1210,
                    761
                ],
                "angle": 0,
                "content": "Claudia Yan, Dipendra Kumar Misra, Andrew Bennett, Aaron Walsman, Yonatan Bisk, and Yoav Artzi. 2018. Chalet: Cornell house agent learning environment. CoRR, abs/1801.07357."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    295,
                    799,
                    1210,
                    982
                ],
                "angle": 0,
                "content": "Licheng Yu, Patrick Poirson, Shan Yang, Alexander C. Berg, and Tamara L. Berg. 2016. Modeling context in referring expressions. In Proceedings of the European Conference on Computer Vision."
            },
            {
                "block_id": 3,
                "type": "list",
                "bbox": [
                    295,
                    270,
                    1210,
                    982
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 4,
                "type": "page_number",
                "bbox": [
                    1193,
                    3279,
                    1290,
                    3322
                ],
                "angle": 0,
                "content": "2678"
            }
        ]
    }
]