[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    193,
                    323,
                    561,
                    686
                ],
                "angle": 0,
                "content": "DEPARTMENT OF STATE UNITED STATES OF AMERICA"
            },
            {
                "block_id": 1,
                "type": "header",
                "bbox": [
                    594,
                    425,
                    1456,
                    508
                ],
                "angle": 0,
                "content": "Functional Bureau Strategy"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    744,
                    1613,
                    1800,
                    1679
                ],
                "angle": 0,
                "content": "OFFICE OF GLOBAL CRIMINAL JUSTICE"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1050,
                    2343,
                    1496,
                    2395
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 4,
                "type": "footer",
                "bbox": [
                    290,
                    3032,
                    777,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    1053,
                    151,
                    1494,
                    207
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    441,
                    405,
                    948,
                    471
                ],
                "angle": 0,
                "content": "Table of Contents"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    344,
                    537,
                    2249,
                    594
                ],
                "angle": 0,
                "content": "1. Executive Statement and Mission Statement 1"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    344,
                    627,
                    2249,
                    683
                ],
                "angle": 0,
                "content": "2. Bureau Strategic Framework 4"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    344,
                    712,
                    2249,
                    768
                ],
                "angle": 0,
                "content": "3. Bureau Goals and Objectives 6"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    344,
                    798,
                    2249,
                    858
                ],
                "angle": 0,
                "content": "4. Bureau Cross-Cutting Management Objectives 16"
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    344,
                    537,
                    2249,
                    858
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    290,
                    3032,
                    777,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 8,
                "type": "footer",
                "bbox": [
                    1058,
                    3092,
                    1489,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1496,
                    207
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2261,
                    214
                ],
                "angle": 0,
                "content": "Page 1 of 17"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    364,
                    306,
                    1685,
                    376
                ],
                "angle": 0,
                "content": "1. Executive Statement and Mission Statement"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    471,
                    2249,
                    1267
                ],
                "angle": 0,
                "content": "The Office of Global Criminal Justice (GCJ) – led by the Ambassador at Large for Global Criminal Justice – advises the Secretary of State, other Department principals, and U.S. diplomats in the field on issues related to war crimes, crimes against humanity, and genocide. The Office plays a key role in formulating U.S. policy on the prevention of, responses to, and accountability for such atrocities and other grave human rights abuses and violations. Our work advances key U.S. national security priorities, including protecting and expanding human rights; promoting and defending strong, accountable democracies that deliver for their people; addressing deep-seated grievances that can lead to cycles of violence; and reversing trends toward authoritarianism that put our national security and prosperity at risk."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    288,
                    1333,
                    1670,
                    1392
                ],
                "angle": 0,
                "content": "To advance these broad aims, GCJ pursues several important goals."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    283,
                    1455,
                    2249,
                    2904
                ],
                "angle": 0,
                "content": "First, the Office promotes and supports the global system of accountability for atrocity crimes. The Office coordinates the U.S. government's engagement with and support for international, hybrid, and mixed tribunals exercising jurisdiction over war crimes, crimes against humanity, and genocide committed around the world. This includes efforts to establish a positive and constructive relationship with the International Criminal Court when its work is aligned with U.S. values and national security interests; liaising with and supporting specialized international, hybrid, and national tribunals prosecuting such crimes committed in specific jurisdictions, including the former Yugoslavia, Rwanda, Sierra Leone, Cambodia, the Central African Republic, and Guatemala; as well as tracking, providing guidance on, and helping coordinate various forms of support to foreign authorities engaged in legal proceedings involving individuals and entities accused of committing atrocities. The Office works closely with other bureaus, the interagency, other governments, international institutions, and nongovernmental organizations to establish and assist international and domestic commissions of inquiry, fact-finding missions, investigative mechanisms, and tribunals to investigate, document, and prosecute atrocities in every region of the globe, including in Syria, Iraq, Burma, and Ukraine. The office supports efforts of other Department and interagency elements to"
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1489,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2254,
                    211
                ],
                "angle": 0,
                "content": "Page 2 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    288,
                    303,
                    2162,
                    455
                ],
                "angle": 0,
                "content": "deploy other tools – including multilateral engagement, sanctions, and visa restrictions – to prevent, deter, mitigate, and respond to atrocities."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    521,
                    2231,
                    1676
                ],
                "angle": 0,
                "content": "Second, GCJ advises the Department and the interagency on the appropriate use of a wide range of transitional justice tools to redress legacies of past or ongoing atrocities, prevent future atrocities, and promote long-term, sustainable peace. These tools include truth, missing persons, and reconciliation commissions; lustrations; amnesties; reparations; institutional reforms and guarantees of non-repetition; memorialization efforts; and documentation and evidence preservation efforts. The Office coordinates and contributes to the deployment of a range of diplomatic, legal, economic, military, and intelligence tools to help expose the truth, judge those responsible, protect and assist victims, enable reconciliation, deter atrocities, and build the rule of law. Recognizing that it is in the U.S. national interest to prevent atrocities before they are committed, GCJ plays an active role in implementing justice-focused atrocity prevention tools, including through the Atrocity Prevention Task Force. GCJ offers expertise to ensure that strategies to provide justice (broadly defined) for past repression and abuses are designed to help prevent the recurrence of atrocities."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1742,
                    2256,
                    2267
                ],
                "angle": 0,
                "content": "Third, GCJ develops and implements programs targeting and supporting justice and accountability, including in transitional justice, investigation, documentation, and apprehension of fugitives. The Office is also responsible for implementing the War Crimes Rewards Program, which provides rewards to people who provide information leading to the arrest, transfer, or conviction of certain individuals accused of war crimes, genocide, or crimes against humanity by international, hybrid, or mixed tribunals, as designated by the Secretary of State."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    283,
                    2326,
                    2221,
                    2847
                ],
                "angle": 0,
                "content": "A failure to achieve these goals and objectives will lead to impunity for atrocities and unaddressed grievances, heightening the risk of future atrocities and instability across the globe. GCJ, is constantly seeking to build relationships and coalitions of partners, including at multilateral institutions, to achieve its goals and help mitigate these serious risks. GCJ is also committed to working with partners to develop new, creative, and innovative tools to support justice and accountability across the globe."
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1496,
                    207
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2261,
                    214
                ],
                "angle": 0,
                "content": "Page 3 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    303,
                    2246,
                    1009
                ],
                "angle": 0,
                "content": "This strategy has been designed in consultation with GCJ staff, will be disseminated internally once completed, and will be shared with all new hires as they come on board. GCJ leadership will recommend that staff both refer to this strategy to guide their work and keep track of their actions and outcomes in order to report back toward progress in implementing this strategy in our collective work. GCJ will mainstream and update the principles, approaches, and priorities contained herein in its annual strategy review meetings with an eye toward continuous progress toward refinement and implementation. GCJ will recommend that staff report on their progress toward this strategy as part of their annual performance reviews."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    1069,
                    2231,
                    1412
                ],
                "angle": 0,
                "content": "Mission Statement: GCJ promotes key U.S. national security priorities by (1) supporting the global system of accountability for atrocity crimes; (2) promoting transitional justice tools to redress past or ongoing atrocities; and (3) designing and implementing programs to strengthen accountability and transitional justice approaches and tools."
            },
            {
                "block_id": 4,
                "type": "footer",
                "bbox": [
                    300,
                    3029,
                    790,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 5,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1489,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 4 of 17"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    362,
                    306,
                    1249,
                    376
                ],
                "angle": 0,
                "content": "2. Bureau Strategic Framework"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    288,
                    475,
                    2073,
                    653
                ],
                "angle": 0,
                "content": "Bureau Goal 1: Promote and Support a global system of accountability for atrocity crimes"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    362,
                    739,
                    2182,
                    983
                ],
                "angle": 0,
                "content": "- Bureau Objective 1.1: Strengthen the technical, legal, and institutional capacity and political will of governments and international institutions to hold those most responsible for atrocity crimes to account through credible criminal justice processes."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    1019,
                    2139,
                    1349
                ],
                "angle": 0,
                "content": "- Bureau Objective 1.2: Increase support for international and regional mechanisms aimed at laying the foundation for future justice processes, including fact-finding missions, commissions of inquiry, documentation initiatives, and investigative mechanisms."
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    362,
                    739,
                    2182,
                    1349
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1435,
                    2182,
                    1613
                ],
                "angle": 0,
                "content": "Bureau Goal 2: Redress past and prevent future atrocities through support for transitional justice strategies and mechanisms"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    362,
                    1699,
                    2238,
                    2125
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.1: Strengthen the technical, legal, and institutional capacity and political will of relevant governments to create and implement holistic transitional justice strategies and mechanisms involving judicial and non-judicial strategies that provide justice for victims, hold perpetrators accountable, and take steps to prevent the recurrence of atrocities by addressing the root causes of past abuse."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    362,
                    2161,
                    2223,
                    2313
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.2: Enhance the capacity of victims, marginalized communities, and civil society in relevant countries to advocate for and participate in justice processes."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    364,
                    2346,
                    2246,
                    2682
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.3: Strengthen U.S. government and popular knowledge and understanding of transitional justice and its relevance to atrocity and conflict prevention, stabilization of fragile states, advancing equity and rights for all, democracy, human rights, and international peace and security."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    362,
                    1699,
                    2246,
                    2682
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "footer",
                "bbox": [
                    300,
                    3029,
                    790,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 13,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1489,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 5 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    306,
                    2236,
                    485
                ],
                "angle": 0,
                "content": "Bureau Goal 3: Develop, implement, and strengthen foreign assistance programs supporting transitional justice, documentation, and fugitive apprehension"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    362,
                    551,
                    2009,
                    699
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.1: Implement foreign assistance programs that establish and strengthen transitional justice mechanisms."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    362,
                    735,
                    2152,
                    976
                ],
                "angle": 0,
                "content": "• Bureau Objective 3.2: Promote meaningful justice and accountability for atrocities and serious human rights violations through State Department and USAID foreign assistance programming, outside of GCJ."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    1013,
                    2249,
                    1349
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.3: Contribute to efforts to locate, apprehend, and facilitate the arrest of designated individuals wanted for war crimes, genocide, and crimes against humanity through the robust implementation, and effective management, of State Department's War Crimes Rewards Program."
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    362,
                    551,
                    2249,
                    1349
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1435,
                    2249,
                    1716
                ],
                "angle": 0,
                "content": "Bureau Cross-Cutting Management Objective 1: Increase diversity, equity, inclusion and accessibility, and effective recruitment, retention, and promotion of a diverse, qualified workforce."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    1805,
                    2164,
                    2187
                ],
                "angle": 0,
                "content": "Bureau Cross-Cutting Management Objective 2: Institute and adhere to best workplace policies, leadership and management principles, standards, and procedures, including with respect to transparency in decision-making and the empowerment of staff."
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    300,
                    3029,
                    787,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 10,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1489,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1489,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 6 of 17"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    364,
                    306,
                    1249,
                    376
                ],
                "angle": 0,
                "content": "3. Bureau Goals and Objectives"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    288,
                    475,
                    2073,
                    653
                ],
                "angle": 0,
                "content": "Bureau Goal 1: Promote and Support a global system of accountability for atrocity crimes"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    362,
                    739,
                    2256,
                    1445
                ],
                "angle": 0,
                "content": "- **Bureau Goal 1 Description:** GCJ plays an important role in advancing U.S. foreign policy, in the Department and the interagency, related to accountability for atrocities. Since the Nuremberg Trials following WWII, the United States has provided leadership in international response to atrocities. GCJ advancement of this historic leadership role involves supporting accountability initiatives at the international, multilateral, and national levels. GCJ advances these policy priorities through strategic planning and interagency coordination, targeting programming, and engagement with and capacity building of host governments, civil society actors, and multilateral institutions."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1521,
                    2195,
                    1768
                ],
                "angle": 0,
                "content": "Bureau Objective 1.1: Strengthen the technical, legal, and institutional capacity and political will of governments and international institutions to hold those most responsible for atrocity crimes to account through credible criminal justice processes."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    364,
                    1834,
                    2244,
                    3003
                ],
                "angle": 0,
                "content": "- Bureau Objective 1.1 Justification and Linkages: Designing and implementing war crimes trials is a highly technical task requiring specific expertise due to the nature of the crimes, the number of victims and perpetrators, unique legal and evidentiary issues, and complicated political implications. It therefore requires personnel with specialized background and experience to help make these processes as impactful as possible. GCJ's efforts in this regard are aligned with the Interim National Security Strategic Guidance's (INSSG) commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" as well as the 2022 Joint Strategic Plan's (JSP) Strategic Goals 1 (including Objective 1.4, 1.5) and 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, break cycles of"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    300,
                    3032,
                    790,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 8,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1489,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2254,
                    211
                ],
                "angle": 0,
                "content": "Page 7 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    300,
                    2249,
                    1184
                ],
                "angle": 0,
                "content": "violence, and build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law. The Biden-Harris Administration has made a commitment to use bilateral and multilateral engagement to promote human rights and accountability. GCJ will support engagement with multilateral institutions and organizations, including the United Nations Security Council, the U.N. Human Rights Council, the Organization of American States, the European Union, the African Union, the Organisation of Security and Cooperation in Europe, and other regional institutions, in their endeavors to further international and regional peace and security, promote human rights, and pursue accountability for atrocities."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    1221,
                    2249,
                    1656
                ],
                "angle": 0,
                "content": "- Bureau Objective 1.1 Risk Considerations: Not achieving this objective will result in impunity for atrocities, and trials that are not credible, do not meet international standards, or put victims and witnesses at additional risk. GCJ will work to develop strong relationships and trust with regional bureaus, posts, and relevant governments and their populations to facilitate our ability to provide necessary feedback and support."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1729,
                    2231,
                    1973
                ],
                "angle": 0,
                "content": "Bureau Objective 1.2: Increase support for international and regional mechanisms aimed at laying the foundation for future justice processes, including fact-finding missions, commissions of inquiry, documentation initiatives, and investigative mechanisms."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    2039,
                    2249,
                    2930
                ],
                "angle": 0,
                "content": "- Bureau Objective 1.2 Justification and Linkages: There are many situations in which atrocity crimes have been committed where, for one reason or another, there are no credible options for holding those responsible to account in the immediate term. Experience has shown that in these situations, it is still important for information and evidence to be gathered quickly, preserved, and analyzed in a way that it can be useful at a time when prosecutions may be possible in the future. GCJ's efforts in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" and with 2022 JSP Strategic Goal 1 (including Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP"
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1496,
                    207
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2261,
                    211
                ],
                "angle": 0,
                "content": "Page 8 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    303,
                    2256,
                    732
                ],
                "angle": 0,
                "content": "emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, and break cycles of violence, build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    441,
                    788,
                    2249,
                    2036
                ],
                "angle": 0,
                "content": "As evidence of the Biden-Harris Administration's commitment to use bilateral and multilateral engagement to promote human rights and accountability, Secretary Blinken directed immediate reengagement with the United Nations Human Rights Council (HRC), a key multilateral forum for furthering international human rights and promoting government accountability for human rights violations. As part of this effort, GCJ will support the Biden Administration's immediate reengagement with the HRC by contributing to Embassy Geneva's work. GCJ will also support ongoing engagement with other multilateral institutions and organizations, including the United Nations Security Council, the Organization of American States, the European Union, the African Union, and other regional institutions, as they work to further international and regional peace and security and to promote human rights. These international and regional mechanisms play a critical role in establishing mechanisms to document and investigate atrocities. Bureau Objective 1.2 Risk Considerations: Not achieving this objective will lead to"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    436,
                    2072,
                    2261,
                    2600
                ],
                "angle": 0,
                "content": "the loss of critical evidence that would facilitate the prosecution of those responsible for atrocities. The lack of documentation and evidence gathering may also affect the long-term political will for the creation of a criminal justice process over the mid- to long-term. GCJ will engage international partners, including governments and civil society actors, to build a strong community of practice surrounding these mechanisms. We will also work to support the success of current mechanisms to demonstrate their value."
            },
            {
                "block_id": 5,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    798,
                    3092
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1050,
                    151,
                    1489,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1994,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 9 of 17"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    288,
                    303,
                    2187,
                    478
                ],
                "angle": 0,
                "content": "Bureau Goal 2: Redress past and prevent future atrocities through support for transitional justice strategies and mechanisms"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    551,
                    2249,
                    1527
                ],
                "angle": 0,
                "content": "- **Bureau Goal 2 Description:** GCJ is the department's policy lead on transitional justice. Transitional justice refers to a range of measures—judicial and non-judicial, formal and informal, retributive and restorative—employed by countries transitioning out of armed conflict or repressive regimes to redress legacies of atrocities and to promote long-term, sustainable peace. Meaningful and impactful transitional justice requires a holistic approach utilizing a range of transitional justice mechanisms including criminal accountability, truth-telling, reparation, institutional reform, memorialization, and other guarantees of non-recurrence of atrocities. GCJ uses its technical expertise to advance these policy priorities through interagency coordination, targeting programming, and engagement with and capacity building of host governments, civil society actors, and multilateral institutions."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1607,
                    2195,
                    2039
                ],
                "angle": 0,
                "content": "Bureau Objective 2.1: Strengthen the technical, legal, and institutional capacity and political will of relevant governments to create and implement holistic transitional justice strategies and mechanisms involving judicial and non-judicial strategies that provide justice for victims, hold perpetrators accountable, and take steps to prevent the recurrence of atrocities by addressing the root causes of past abuse."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    2102,
                    2254,
                    2993
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.1 Justification and Linkages: Responding to legacies of atrocities through justice and accountability is something countries (it is hoped) deal with rarely; as a result, most countries lack the domestic expertise and experience to address these issues in a way that reflects, and builds on, international best practice and experience. Countries facing these issues are also likely confronting significant resource constraints as they seek to emerge from conflict and repression. They therefore often need international assistance to respond in a way that will best support long-term peace and stability. GCJ's efforts in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" and with 2022 JSP Strategic Goal 1 (including"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    300,
                    3032,
                    790,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1037,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1966,
                    151,
                    2254,
                    211
                ],
                "angle": 0,
                "content": "Page 10 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    300,
                    2246,
                    818
                ],
                "angle": 0,
                "content": "Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, break cycles of violence, and build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    854,
                    2256,
                    1366
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.1 Risk Considerations: Not achieving this objective will lead to insufficient or non-credible transitional justice processes in countries that desperately need them, resulting in increased risk of instability and recurrence of atrocities. GCJ will work with relevant regional bureaus, posts, and government interlocutors to build trust and relationships that will facilitate our engagement to advise and support on these issues."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1452,
                    2164,
                    1603
                ],
                "angle": 0,
                "content": "Bureau Objective 2.2: Enhance the capacity of victims, marginalized communities, and civil society in relevant countries to advocate for and participate in justice processes."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    1673,
                    2249,
                    2834
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.2 Justification and Linkages: Effective transitional justice processes, must be driven and perceived to be owned by the people, even if they are often implemented by government actors. This can be particularly challenging and dangerous in places where victims' communities are marginalized and those responsible for past atrocities maintain positions of power and influence, or in places still in the midst of conflict. GCJ's efforts to support victims, marginalized communities and civil society in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions...and revitalize America's unmatched network of alliances and partnerships,\" and with 2022 JSP Strategic Goal 1 (including Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, break cycles of violence, and"
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 12,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1037,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1966,
                    151,
                    2254,
                    211
                ],
                "angle": 0,
                "content": "Page 11 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    300,
                    2236,
                    455
                ],
                "angle": 0,
                "content": "build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    488,
                    2249,
                    1098
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.2 Risk Considerations: Not achieving this objective will lead to a lack of transitional justice where it is needed or the top-down design and creation of transitional justice strategies and mechanisms that will fail without the buy in and ownership of the people. GCJ will continue to travel to relevant countries to meet with all stakeholders, including civil society and those potentially under threat for their support for justice and accountability. We will also build and maintain robust victim and civil society relationships."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1178,
                    2241,
                    1514
                ],
                "angle": 0,
                "content": "Bureau Objective 2.3: Strengthen U.S. government and popular knowledge and understanding of transitional justice and its relevance to atrocity and conflict prevention, stabilization of fragile states, advancing equity and rights for all, democracy, human rights, and international peace and security."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    364,
                    1580,
                    2254,
                    2745
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.3 Justification and Linkages: Credibly and thoughtfully addressing justice and accountability for past atrocities is critical to bringing an end to cycles of violence and to promoting liberal democracy, respect for human rights, and rule of law. GCJ's efforts to support victims, marginalized communities and civil society in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" and with 2022 JSP Strategic Goal 1 (including Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, and break cycles of violence, build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3029,
                    790,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 13,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1037,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1966,
                    151,
                    2254,
                    211
                ],
                "angle": 0,
                "content": "Page 12 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    364,
                    303,
                    2246,
                    825
                ],
                "angle": 0,
                "content": "- Bureau Objective 2.3 Risk Considerations: Not achieving this objective will lead a U.S. foreign policy with a weakened ability to prevent atrocities and conflicts, stabilize fragile states, and support long-term peace and stability. GCJ will be proactive in seeking to build relationships across the department and interagency, raise our profile through public affairs and diplomacy, and seek to insert ourselves within the training architecture of the State Department."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    907,
                    2080,
                    1188
                ],
                "angle": 0,
                "content": "Bureau Goal 3: Develop and implement, and strengthen foreign assistance programs supporting transitional justice, documentation, and fugitive apprehension"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    364,
                    1277,
                    2254,
                    2442
                ],
                "angle": 0,
                "content": "- Bureau Goal 3 Description: GCJ seeks to strengthen U.S. foreign policy related to transitional justice through shaping and providing foreign assistance that reinforces our policy goals. Given the office's specialized expertise, GCJ designs and implements transitional justice programming and continues to advise and coordinate with other parts of State and USAID that are also funding this work. Congress and the White House have earmarked funding for GCJ to provide its own foreign assistance funding to support transitional justice efforts, especially but not limited to criminal accountability for atrocities. Given the cross-cutting nature of transitional justice, several State Department bureaus design and implement programming focused on or related to transitional justice including DRL, INL, GWI, CSO, IRF as well as relevant regional bureaus and embassies. USAID also designs and implements programming related to transitional justice. As such, GCJ regularly coordinates with these offices, including sitting on panels to select programs and participating in donor meetings."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    433,
                    2501,
                    2218,
                    2745
                ],
                "angle": 0,
                "content": "GCJ also has a longstanding Congressional mandate to oversee the State Department’s War Crimes Reward Program, which helps to locate and apprehend individuals designated by Congress who are wanted by credible international war crimes tribunals."
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    787,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1486,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 14,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1037,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1966,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 13 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    283,
                    303,
                    2190,
                    455
                ],
                "angle": 0,
                "content": "Bureau Objective 3.1: Implement foreign assistance programs that establish and strengthen transitional justice mechanisms."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    521,
                    2231,
                    1676
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.1 Justification and Linkages: Congress provided GCJ with earmarked funds in recognition of the fact that certain foreign assistance support for transitional justice was not being or able to be provided through other bureaus or agencies, as well as in recognition of GCJ's expertise. GCJ's efforts in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" and with 2022 JSP Strategic Goal 1 (including Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, break cycles of violence, and build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    362,
                    1712,
                    2228,
                    2148
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.1 Risk Considerations: Not achieving this objective will lead to a weak foreign policy supported only by words and lacking the resources needed to implement challenging processes in places which that often have the least capacity and resources of their own. GCJ will strengthen its programmatic capacity and processes and seek to better integrate them within the larger foreign assistance community."
            },
            {
                "block_id": 5,
                "type": "list",
                "bbox": [
                    362,
                    521,
                    2231,
                    2148
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    283,
                    2220,
                    2249,
                    2465
                ],
                "angle": 0,
                "content": "Bureau Objective 3.2: Promote meaningful justice and accountability for atrocities and serious human rights violations through State Department and USAID foreign assistance programming, outside of GCJ."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    362,
                    2534,
                    2236,
                    2963
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.2 Justification and Linkages: Foreign assistance to support different aspects of transitional justice goes through a variety of bureaus at the State Department and USAID due to the cross-cutting nature of transitional justice issues. As the transitional justice policy lead, GCJ therefore provides input and guidance to these various efforts to ensure broader coordination across the U.S. government. GCJ’s"
            },
            {
                "block_id": 8,
                "type": "footer",
                "bbox": [
                    298,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 15,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1040,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1966,
                    151,
                    2254,
                    211
                ],
                "angle": 0,
                "content": "Page 14 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    300,
                    2256,
                    1095
                ],
                "angle": 0,
                "content": "efforts in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" and aligned with 2022 JSP Strategic Goal 1 (including Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, break cycles of violence, and build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    1128,
                    2210,
                    1739
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.2 Risk Considerations: Not achieving this objective will lead to insufficient resources going to address justice and accountability for atrocities. Given that GCJ's current earmark is a very small percentage of overall foreign assistance available to address justice and accountability for atrocities, GCJ will continue to build and strengthen its relationships with other State Department bureaus working on transitional justice programming and continuing its coordination efforts with USAID to increase the overall impact of these types of programs."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    283,
                    1818,
                    2221,
                    2154
                ],
                "angle": 0,
                "content": "Bureau Objective 3.3: Contribute to efforts to locate, apprehend, and facilitate the arrest of designated individuals wanted for war crimes, genocide, and crimes against humanity through the robust implementation, and effective management, of State Department's War Crimes Rewards Program."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    362,
                    2220,
                    2205,
                    2923
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.3 Justification and Linkages: GCJ has a Congressional mandate to oversee the WCRP to help locate, apprehend, and facilitate the arrest of designated individuals implicated in atrocity crimes. GCJ's efforts in this regard are aligned with the INSSG's commitment to \"reclaim our place in international institutions ... and revitalize America's unmatched network of alliances and partnerships,\" and with 2022 JSP Strategic Goal 1 (including Objective 1.4, 1.5) and Goal 3 (including Objectives 3.1, 3.2). The Administration's INSSG and the 2022 JSP emphasize the importance of promoting and protecting human rights through revitalizing international institutions"
            },
            {
                "block_id": 6,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 7,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 16,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1040,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1968,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 15 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    436,
                    303,
                    2228,
                    633
                ],
                "angle": 0,
                "content": "and alliances, as well as working with local partners and national institutions to prevent and resolve conflict, break cycles of violence, and build accountable and inclusive institutions, including in the security and justice sectors, that reflect democratic values and the rule of law."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    369,
                    669,
                    2221,
                    1188
                ],
                "angle": 0,
                "content": "- Bureau Objective 3.3 Risk Considerations: Not achieving this objective will lead to those most responsible for some of the world's most serious crimes remaining at large, enjoying impunity, and remaining a threat to stability. GCJ will continue to raise awareness of the WCRP, particularly in high impact communities, and liaise with relevant international tribunals, the IC, and law enforcement to work together to apprehend these fugitives."
            },
            {
                "block_id": 4,
                "type": "footer",
                "bbox": [
                    300,
                    3032,
                    787,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 5,
                "type": "footer",
                "bbox": [
                    1058,
                    3092,
                    1489,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 17,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1037,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1966,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 16 of 17"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    359,
                    306,
                    1736,
                    376
                ],
                "angle": 0,
                "content": "4. Bureau Cross-Cutting Management Objectives"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    283,
                    478,
                    2246,
                    755
                ],
                "angle": 0,
                "content": "Bureau Cross-Cutting Management Objective 1: Increase diversity, equity, inclusion and accessibility, and effective recruitment, retention, and promotion of a diverse, qualified workforce."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    362,
                    831,
                    2256,
                    1904
                ],
                "angle": 0,
                "content": "- Bureau Cross-Cutting Management Objective 1 Justification and Linkages: As stated in the INSSG, “for our national security strategy to be effective, it is essential to invest in our national security workforce, institutions, and partnerships ... [and] ensure our workforce represents the diversity of the country.” GCJ’s foreign policy role in assisting societies around the world in transitioning from legacies of mass atrocities and authoritarianism is deepened by a complex understanding of underlying discrimination, marginalization, inequalities, inequities, and polarization in those societies. Such an understanding is enhanced by the perspectives and experience of a diverse workforce, including at senior levels. This management objective is also justified by Executive Orders 14035, 14031, 12985, 12988, 14020; the Memorandum on Revitalizing America’s Foreign Policy and National Security Workforce, Institutions, and Partnerships; and the Government-Wide Strategic Plan to Advance DEIA in the Federal Workplace."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    362,
                    1933,
                    2254,
                    2356
                ],
                "angle": 0,
                "content": "- Bureau Cross-Cutting Management Objective 1 Risk Considerations: Not achieving this objective will lead to a GCJ team that is not optimized to achieve our objectives and will negatively affect staff morale. GCJ will ensure that our hiring, retention, and promotion strategies reflect the importance of this goal and that the team responsible for these issues is diverse and representative."
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    362,
                    831,
                    2256,
                    2356
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    283,
                    2442,
                    2147,
                    2725
                ],
                "angle": 0,
                "content": "Bureau Cross-Cutting Management Objective 2: Institute and adhere to best workplace policies, leadership and management principles, standards, and procedures, including with respect to transparency."
            },
            {
                "block_id": 8,
                "type": "footer",
                "bbox": [
                    298,
                    3032,
                    790,
                    3088
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 9,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1491,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    },
    {
        "page_id": 18,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "header",
                "bbox": [
                    1040,
                    151,
                    1476,
                    204
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            },
            {
                "block_id": 1,
                "type": "page_number",
                "bbox": [
                    1968,
                    151,
                    2254,
                    207
                ],
                "angle": 0,
                "content": "Page 17 of 17"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    364,
                    303,
                    2256,
                    1838
                ],
                "angle": 0,
                "content": "- Bureau Cross-Cutting Management Objective 2 Justification and Linkages: A June 2021 report on GCJ issued by the Office of the Inspector General found that the previous Ambassador at Large and the current Office Director \"did not communicate and collaborate with most of the office's staff ... [and did not] encourage an atmosphere of open dialogue and trust ... which contributed to divisions mistrust, and morale problems in the office.\" (ISP-I-21-28, June 2021). Specifically, staff members raised concerns that \"communication and information flow worsened [...] causing employee uncertainty about leadership's goals and priorities; leadership cut off or excluded staff members from office discussions and did not advise staff of essential information they needed to do their jobs [...] and hiring decisions lacked transparency and created perceptions of unfairness, bias, or discrimination in hiring new staff, which fueled mistrust and was demoralizing.\" The Report also found that the acting Senior Official, who has since left, took steps to improve information sharing, collaboration, and communication. This Management Objective is necessary to ensure GCJ's maximal effectiveness, improve workforce culture and morale, restore trust, and ensure that changes in \"tone at the top\" instituted by the new Senior Bureau Official are carried through by other senior management. This Management Objective is justified by 3 Foreign Affairs Manual 1214."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    364,
                    1864,
                    2249,
                    2748
                ],
                "angle": 0,
                "content": "- Bureau Cross-Cutting Management Objective 2 Risk Considerations: Not achieving this objective will significantly affect the morale of the office and may result in experienced staff leaving GCJ. It will also decrease the effectiveness of GCJ's small team to achieve its considerable mandate. GCJ leadership will launch a confidential climate survey through the Department's Ombudsperson to gauge the staff's views on office structure and dynamics to ensure that these facilitate their work and leave them feeling empowered professionally. GCJ leadership will consult broadly with staff on key strategy and staffing decisions, ensure clear and timely communications to staff on all issues related to their work and portfolios and include a diverse range of staff on hiring panels."
            },
            {
                "block_id": 4,
                "type": "footer",
                "bbox": [
                    303,
                    3032,
                    790,
                    3085
                ],
                "angle": 0,
                "content": "Approved: May 5, 2022"
            },
            {
                "block_id": 5,
                "type": "footer",
                "bbox": [
                    1055,
                    3092,
                    1489,
                    3144
                ],
                "angle": 0,
                "content": "FOR PUBLIC RELEASE"
            }
        ]
    }
]