[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    501,
                    280,
                    1992,
                    420
                ],
                "angle": 0,
                "content": "When and Why are Pre-trained Word Embeddings Useful for Neural Machine Translation?"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    736,
                    491,
                    1761,
                    610
                ],
                "angle": 0,
                "content": "Ye Qi, Devendra Singh Sachan, Matthieu Felix, Sarguna Janani Padmanabhan, Graham Neubig"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    565,
                    610,
                    1930,
                    666
                ],
                "angle": 0,
                "content": "Language Technologies Institute, Carnegie Mellon University, USA"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    446,
                    670,
                    2056,
                    729
                ],
                "angle": 0,
                "content": "{yeq, dsachan, matthief, sjpadman, gneubig}@andrew.cmu.edu"
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    652,
                    852,
                    850,
                    905
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    354,
                    954,
                    1143,
                    1754
                ],
                "angle": 0,
                "content": "The performance of Neural Machine Translation (NMT) systems often suffers in low-resource scenarios where sufficiently large-scale parallel corpora cannot be obtained. Pre-trained word embeddings have proven to be invaluable for improving performance in natural language analysis tasks, which often suffer from paucity of data. However, their utility for NMT has not been extensively explored. In this work, we perform five sets of experiments that analyze when we can expect pre-trained word embeddings to help in NMT tasks. We show that such embeddings can be surprisingly effective in some cases – providing gains of up to 20 BLEU points in the most favorable setting.\\(^1\\)"
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    290,
                    1799,
                    650,
                    1848
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1890,
                    1215,
                    2736
                ],
                "angle": 0,
                "content": "Pre-trained word embeddings have proven to be highly useful in neural network models for NLP tasks such as sequence tagging (Lample et al., 2016; Ma and Hovy, 2016) and text classification (Kim, 2014). However, it is much less common to use such pre-training in NMT (Wu et al., 2016), largely because the large-scale training corpora used for tasks such as WMT\\(^2\\) tend to be several orders of magnitude larger than the annotated data available for other tasks, such as the Penn Treebank (Marcus et al., 1993). However, for low-resource languages or domains, it is not necessarily the case that bilingual data is available in abundance, and therefore the effective use of monolingual data becomes a more desirable option."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2739,
                    1215,
                    3023
                ],
                "angle": 0,
                "content": "Researchers have worked on a number of methods for using monolingual data in NMT systems (Cheng et al., 2016; He et al., 2016; Ramachandran et al., 2016). Among these, pre-trained word embeddings have been used either in standard"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    852,
                    2195,
                    1248
                ],
                "angle": 0,
                "content": "translation systems (Neishi et al., 2017; Artetxe et al., 2017) or as a method for learning translation lexicons in an entirely unsupervised manner (Conneau et al., 2017; Gangi and Federico, 2017). Both methods show potential improvements in BLEU score when pre-training is properly integrated into the NMT system."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1252,
                    2195,
                    1592
                ],
                "angle": 0,
                "content": "However, from these works, it is still not clear as to when we can expect pre-trained embeddings to be useful in NMT, or why they provide performance improvements. In this paper, we examine these questions more closely, conducting five sets of experiments to answer the following questions:"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1282,
                    1638,
                    2190,
                    1806
                ],
                "angle": 0,
                "content": "Q1 Is the behavior of pre-training affected by language families and other linguistic features of source and target languages? (§3)"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1282,
                    1827,
                    2190,
                    1943
                ],
                "angle": 0,
                "content": "Q2 Do pre-trained embeddings help more when the size of the training data is small? (§4)"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1285,
                    1964,
                    2190,
                    2132
                ],
                "angle": 0,
                "content": "Q3 How much does the similarity of the source and target languages affect the efficacy of using pre-trained embeddings? (§5)"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1285,
                    2153,
                    2188,
                    2269
                ],
                "angle": 0,
                "content": "Q4 Is it helpful to align the embedding spaces between the source and target languages? (§6)"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1285,
                    2287,
                    2190,
                    2459
                ],
                "angle": 0,
                "content": "Q5 Do pre-trained embeddings help more in multilingual systems as compared to bilingual systems? (§7)"
            },
            {
                "block_id": 16,
                "type": "list",
                "bbox": [
                    1282,
                    1638,
                    2190,
                    2459
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 17,
                "type": "title",
                "bbox": [
                    1267,
                    2508,
                    1786,
                    2564
                ],
                "angle": 0,
                "content": "2 Experimental Setup"
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1262,
                    2599,
                    2195,
                    3108
                ],
                "angle": 0,
                "content": "In order to perform experiments in a controlled, multilingual setting, we created a parallel corpus from TED talks transcripts. Specifically, we prepare data between English (EN) and three pairs of languages, where the two languages in the pair are similar, with one being relatively low-resourced compared to the other: Galician (GL) and Portuguese (PT), Azerbaijan (AZ) and Turkish (TR), and Belarusian (BE) and Russian (RU)."
            },
            {
                "block_id": 19,
                "type": "page_footnote",
                "bbox": [
                    285,
                    3051,
                    1215,
                    3143
                ],
                "angle": 0,
                "content": "<sup>1</sup>Scripts/data to replicate experiments are available at https://github.com/neulab/word-embeddings-for-nmt"
            },
            {
                "block_id": 20,
                "type": "page_footnote",
                "bbox": [
                    342,
                    3139,
                    823,
                    3192
                ],
                "angle": 0,
                "content": "\\(^{2}\\)http://www.statmt.org/wmt17/"
            },
            {
                "block_id": 21,
                "type": "list",
                "bbox": [
                    285,
                    3051,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 22,
                "type": "page_footnote",
                "bbox": [
                    1322,
                    3139,
                    1969,
                    3192
                ],
                "angle": 0,
                "content": "\\(^{3}\\)https://www.ted.com/participate/translate"
            },
            {
                "block_id": 23,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "529"
            },
            {
                "block_id": 24,
                "type": "footer",
                "bbox": [
                    850,
                    3301,
                    1622,
                    3350
                ],
                "angle": 0,
                "content": "Proceedings of NAACL-HLT 2018, pages 529-535"
            },
            {
                "block_id": 25,
                "type": "footer",
                "bbox": [
                    533,
                    3350,
                    1942,
                    3399
                ],
                "angle": 0,
                "content": "New Orleans, Louisiana, June 1 - 6, 2018. ©2018 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    409,
                    256,
                    1096,
                    599
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>train</td><td>dev</td><td>test</td></tr><tr><td>GL → EN</td><td>10,017</td><td>682</td><td>1,007</td></tr><tr><td>PT → EN</td><td>51,785</td><td>1,193</td><td>1,803</td></tr><tr><td>AZ → EN</td><td>5,946</td><td>671</td><td>903</td></tr><tr><td>TR → EN</td><td>182,450</td><td>4,045</td><td>5,029</td></tr><tr><td>BE → EN</td><td>4,509</td><td>248</td><td>664</td></tr><tr><td>RU → EN</td><td>208,106</td><td>4,805</td><td>5,476</td></tr></table>",
                "caption": "Table 1: Number of sentences for each language pair."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    708,
                    1213,
                    1375
                ],
                "angle": 0,
                "content": "The languages in each pair are similar in vocabulary, grammar and sentence structure (Matthews, 1997), which controls for language characteristics and also improves the possibility of transfer learning in multi-lingual models (in §7). They also represent different language families – GL/PT are Romance; AZ/TR are Turkic; BE/RU are Slavic – allowing for comparison across languages with different characteristics. Tokenization was done using Moses tokenizer<sup>4</sup> and hard punctuation symbols were used to identify sentence boundaries. Table 1 shows data sizes."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1385,
                    1213,
                    1946
                ],
                "angle": 0,
                "content": "For our experiments, we use a standard 1-layer encoder-decoder model with attention (Bahdanau et al., 2014) with a beam size of 5 implemented in xnmt\\(^{5}\\) (Neubig et al., 2018). Training uses a batch size of 32 and the Adam optimizer (Kingma and Ba, 2014) with an initial learning rate of 0.0002, decaying the learning rate by 0.5 when development loss decreases (Denkowski and Neubig, 2017). We evaluate the model's performance using BLEU metric (Papineni et al., 2002)."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1953,
                    1215,
                    2627
                ],
                "angle": 0,
                "content": "We use available pre-trained word embeddings (Bojanowski et al., 2016) trained using fastText\\(^{6}\\) on Wikipedia\\(^{7}\\) for each language. These word embeddings (Mikolov et al., 2017) incorporate character-level, phrase-level and positional information of words and are trained using CBOw algorithm (Mikolov et al., 2013). The dimension of word embeddings is set to 300. The embedding layer weights of our model are initialized using these pre-trained word vectors. In baseline models without pre-training, we use Glorot and Bengio (2010)'s uniform initialization."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    287,
                    2673,
                    977,
                    2732
                ],
                "angle": 0,
                "content": "3 Q1: Efficacy of Pre-training"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2764,
                    1213,
                    2929
                ],
                "angle": 0,
                "content": "In our first set of experiments, we examine the efficacy of pre-trained word embeddings across the various languages in our corpus. In addition to"
            },
            {
                "block_id": 7,
                "type": "table",
                "bbox": [
                    1374,
                    256,
                    2093,
                    687
                ],
                "angle": 0,
                "content": "<table><tr><td rowspan=\"2\">Src → \n→ Trg</td><td>std</td><td>pre</td><td>std</td><td>pre</td></tr><tr><td>std</td><td>std</td><td>pre</td><td>pre</td></tr><tr><td>GL → EN</td><td>2.2</td><td>13.2</td><td>2.8</td><td>12.8</td></tr><tr><td>PT → EN</td><td>26.2</td><td>30.3</td><td>26.1</td><td>30.8</td></tr><tr><td>AZ → EN</td><td>1.3</td><td>2.0</td><td>1.6</td><td>2.0</td></tr><tr><td>TR → EN</td><td>14.9</td><td>17.6</td><td>14.7</td><td>17.9</td></tr><tr><td>BE → EN</td><td>1.6</td><td>2.5</td><td>1.3</td><td>3.0</td></tr><tr><td>RU → EN</td><td>18.5</td><td>21.2</td><td>18.7</td><td>21.1</td></tr></table>",
                "caption": "Table 2: Effect of pre-training on BLEU score over six languages. The systems use either random initialization (std) or pre-training (pre) on both the source and target sides."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    947,
                    2193,
                    1399
                ],
                "angle": 0,
                "content": "providing additional experimental evidence supporting the findings of other recent work on using pre-trained embeddings in NMT (Neishi et al., 2017; Artetxe et al., 2017; Gangi and Federico, 2017), we also examine whether pre-training is useful across a wider variety of language pairs and if it is more useful on the source or target side of a translation pair."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    1403,
                    2193,
                    1960
                ],
                "angle": 0,
                "content": "The results in Table 2 clearly demonstrate that pre-training the word embeddings in the source and/or target languages helps to increase the BLEU scores to some degree. Comparing the second and third columns, we can see the increase is much more significant with pre-trained source language embeddings. This indicates that the majority of the gain from pre-trained word embeddings results from a better encoding of the source sentence."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    1971,
                    2193,
                    2588
                ],
                "angle": 0,
                "content": "The gains from pre-training in the higher-resource languages are consistent: \\(\\approx 3\\) BLEU points for all three language pairs. In contrast, for the extremely low-resource languages, the gains are either quite small (AZ and BE) or very large, as in GL which achieves a gain of up to 11 BLEU points. This finding is interesting in that it indicates that word embeddings may be particularly useful to bootstrap models that are on the threshold of being able to produce reasonable translations, as is the case for GL in our experiments."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1265,
                    2641,
                    2046,
                    2701
                ],
                "angle": 0,
                "content": "4 Q2: Effect of Training Data Size"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    2736,
                    2195,
                    3129
                ],
                "angle": 0,
                "content": "The previous experiment had interesting implications regarding available data size and effect of pre-training. Our next series of experiments examines this effect in a more controlled environment by down-sampling the training data for the higher-resource languages to 1/2, 1/4 and 1/8 of their original sizes."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1312,
                    3136,
                    2190,
                    3192
                ],
                "angle": 0,
                "content": "From the BLEU scores in Figure 1, we can see"
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2964,
                    1126,
                    3048
                ],
                "angle": 0,
                "content": "4https://github.com/moses-smt/mosesdecoder/blob/master/scripts/tokenizer/tokenizer.perl"
            },
            {
                "block_id": 16,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3051,
                    850,
                    3097
                ],
                "angle": 0,
                "content": "\\(^{5}\\)https://github.com/neulab/xnmt/"
            },
            {
                "block_id": 17,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3097,
                    1054,
                    3143
                ],
                "angle": 0,
                "content": "\\(^{6}\\)https://github.com/facebookresearch/fastText/"
            },
            {
                "block_id": 18,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3143,
                    808,
                    3188
                ],
                "angle": 0,
                "content": "<sup>7</sup>https://dumps.wikimedia.org/"
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    285,
                    2964,
                    1126,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1203,
                    3234,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "530"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    320,
                    249,
                    1180,
                    827
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 1,
                "type": "image",
                "bbox": [
                    317,
                    827,
                    1180,
                    1399
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: BLEU and BLEU gain by data size."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1525,
                    1215,
                    2087
                ],
                "angle": 0,
                "content": "that for all three languages the gain in BLEU score demonstrates a similar trend to that found in GL in the previous section: the gain is highest when the baseline system is poor but not too poor, usually with a baseline BLEU score in the range of 3-4. This suggests that at least a moderately effective system is necessary before pre-training takes effect, but once there is enough data to capture the basic characteristics of the language, pre-training can be highly effective."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    287,
                    2136,
                    1101,
                    2199
                ],
                "angle": 0,
                "content": "5 Q3: Effect of Language Similarity"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2234,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "The main intuitive hypothesis as to why pretraining works is that the embedding space becomes more consistent, with semantically similar words closer together. We can also make an additional hypothesis: if the two languages in the translation pair are more linguistically similar, the semantic neighborhoods will be more similar between the two languages (i.e. semantic distinctions or polysemy will likely manifest themselves in more similar ways across more similar languages). As a result, we may expect that the gain from pre-training of embeddings may be larger when the source and target languages are more similar. To examine this hypothesis, we selected Portuguese as the target language, which when following its language family tree from top to bottom, belongs to Indo-European, Romance,"
            },
            {
                "block_id": 6,
                "type": "table",
                "bbox": [
                    1285,
                    256,
                    2183,
                    561
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>Lang. Family</td><td>std</td><td>pre</td></tr><tr><td>ES → PT</td><td>West-Iberian</td><td>17.8</td><td>24.8 (+7.0)</td></tr><tr><td>FR → PT</td><td>Western Romance</td><td>12.4</td><td>18.1 (+5.7)</td></tr><tr><td>IT → PT</td><td>Romance</td><td>14.5</td><td>19.2 (+4.7)</td></tr><tr><td>RU → PT</td><td>Indo-European</td><td>2.4</td><td>8.6 (+6.2)</td></tr><tr><td>HE → PT</td><td>No Common</td><td>3.0</td><td>11.9 (+8.9)</td></tr></table>",
                "caption": "Table 3: Effect of linguistic similarity and pre-training on BLEU. The language family in the second column is the most recent common ancestor of source and target language."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    813,
                    2193,
                    1034
                ],
                "angle": 0,
                "content": "Western Romance, and West-Iberian families. We then selected one source language from each family above.<sup>8</sup> To avoid the effects of training set size, all pairs were trained on 40,000 sentences."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1041,
                    2195,
                    1606
                ],
                "angle": 0,
                "content": "From Table 3, we can see that the BLEU scores of Es, FR, and IT do generally follow this hypothesis. As we move to very different languages, RU and HE see larger accuracy gains than their more similar counterparts FR and IT. This can be largely attributed to the observation from the previous section that systems with larger headroom to improve tend to see larger increases; RU and HE have very low baseline BLEU scores, so it makes sense that their increases would be larger."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    1648,
                    2029,
                    1764
                ],
                "angle": 0,
                "content": "6 Q4: Effect of Word Embedding Alignment"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    1799,
                    2193,
                    2641
                ],
                "angle": 0,
                "content": "Until now, we have been using embeddings that have been trained independently in the source and target languages, and as a result there will not necessarily be a direct correspondence between the embedding spaces in both languages. However, we can postulate that having consistent embedding spaces across the two languages may be beneficial, as it would allow the NMT system to more easily learn correspondences between the source and target. To test this hypothesis, we adopted the approach proposed by Smith et al. (2017) to learn orthogonal transformations that convert the word embeddings of multiple languages to a single space and used these aligned embeddings instead of independent ones."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1262,
                    2648,
                    2193,
                    2985
                ],
                "angle": 0,
                "content": "From Table 4, we can see that somewhat surprisingly, the alignment of word embeddings was not beneficial for training, with gains or losses essentially being insignificant across all languages. This, in a way, is good news, as it indicates that a priori alignment of embeddings may not be neces"
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3016,
                    2193,
                    3188
                ],
                "angle": 0,
                "content": "8 English was excluded because the TED talks were originally in English, which results in it having much higher BLEU scores than the other languages due to it being direct translation instead of pivoted through English like the others."
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1205,
                    3230,
                    1275,
                    3279
                ],
                "angle": 0,
                "content": "531"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    401,
                    256,
                    1104,
                    648
                ],
                "angle": 0,
                "content": "<table><tr><td>Dataset</td><td>unaligned</td><td>aligned</td></tr><tr><td>GL → EN</td><td>12.8</td><td>11.5 (−1.3)</td></tr><tr><td>PT → EN</td><td>30.8</td><td>30.6 (−0.2)</td></tr><tr><td>AZ → EN</td><td>2.0</td><td>2.1 (+0.1)</td></tr><tr><td>TR → EN</td><td>17.9</td><td>17.7 (−0.2)</td></tr><tr><td>BE → EN</td><td>3.0</td><td>3.0 (+0.0)</td></tr><tr><td>RU → EN</td><td>21.1</td><td>21.4 (+0.3)</td></tr></table>",
                "caption": "Table 4: Correlation between word embedding alignment and BLEU score in bilingual translation task."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    334,
                    813,
                    1171,
                    1038
                ],
                "angle": 0,
                "content": "<table><tr><td>Train</td><td>Eval</td><td>bi</td><td>std</td><td>pre</td><td>align</td></tr><tr><td>GL + PT</td><td>GL</td><td>2.2</td><td>17.5</td><td>20.8</td><td>22.4</td></tr><tr><td>AZ + TR</td><td>AZ</td><td>1.3</td><td>5.4</td><td>5.9</td><td>7.5</td></tr><tr><td>BE + RU</td><td>BE</td><td>1.6</td><td>10.0</td><td>7.9</td><td>9.6</td></tr></table>",
                "caption": "Table 5: Effect of pre-training on multilingual translation into English. bi is a bilingual system trained on only the eval source language and all others are multi-lingual systems trained on two similar source languages."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1347,
                    1213,
                    1515
                ],
                "angle": 0,
                "content": "sary in the context of NMT, since the NMT system can already learn a reasonable projection of word embeddings during its normal training process."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    287,
                    1568,
                    989,
                    1627
                ],
                "angle": 0,
                "content": "7 Q5: Effect of Multilinguality"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1662,
                    1213,
                    2280
                ],
                "angle": 0,
                "content": "Finally, it is of interest to consider pre-training in multilingual translation systems that share an encoder or decoder between multiple languages (Johnson et al., 2016; Firat et al., 2016), which is another promising way to use additional data (this time from another language) as a way to improve NMT. Specifically, we train a model using our pairs of similar low-resource and higher-resource languages, and test on only the low-resource language. For those three pairs, the similarity of GL/PT is the highest while BE/RU is the lowest."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2290,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "We report the results in Table 5. When applying pre-trained embeddings, the gains in each translation pair are roughly in order of their similarity, with GL/PT showing the largest gains, and BE/RU showing a small decrease. In addition, it is also interesting to note that as opposed to previous section, aligning the word embeddings helps to increase the BLEU scores for all three tasks. These increases are intuitive, as a single encoder is used for both of the source languages, and the encoder would have to learn a significantly more complicated transform of the input if the word embeddings for the languages were in a semantically separate space. Pre-training and alignment ensures that the word embeddings of the two source languages are put into similar vector spaces, allowing"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2190,
                    375
                ],
                "angle": 0,
                "content": "the model to learn in a similar fashion as it would if training on a single language."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    382,
                    2193,
                    831
                ],
                "angle": 0,
                "content": "Interestingly, \\(\\mathrm{BE} \\rightarrow \\mathrm{EN}\\) does not seem to benefit from pre-training in the multilingual scenario, which hypothesize is due to the fact that: 1) Belarusian and Russian are only partially mutually intelligible (Corbett and Comrie, 2003), i.e., they are not as similar; 2) the Slavic languages have comparatively rich morphology, making sparsity in the trained embeddings a larger problem."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    884,
                    1538,
                    940
                ],
                "angle": 0,
                "content": "8 Analysis"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    1267,
                    982,
                    1773,
                    1034
                ],
                "angle": 0,
                "content": "8.1 Qualitative Analysis"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    1062,
                    2193,
                    1796
                ],
                "angle": 0,
                "content": "Finally, we perform a qualitative analysis of the translations from GL \\(\\rightarrow\\) EN, which showed one of the largest increases in quantitative numbers. As can be seen from Table 6, pre-training not only helps the model to capture rarer vocabulary but also generates sentences that are more grammatically well-formed. As highlighted in the table cells, the best system successfully translates a person's name (\"chris\") and two multi-word phrases (\"big lawyer\" and \"patent legislation\"), indicating the usefulness of pre-trained embeddings in providing a better representation of less frequent concepts when used with low-resource languages."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    1799,
                    2193,
                    2304
                ],
                "angle": 0,
                "content": "In contrast, the bilingual model without pretrained embeddings substitutes these phrases for common ones (\"i\"), drops them entirely, or produces grammatically incorrect sentences. The incomprehension of core vocabulary causes deviation of the sentence semantics and thus increases the uncertainty in predicting next words, generating several phrasal loops which are typical in NMT systems."
            },
            {
                "block_id": 14,
                "type": "title",
                "bbox": [
                    1267,
                    2357,
                    2036,
                    2466
                ],
                "angle": 0,
                "content": "8.2 Analysis of Frequently Generated \\( n \\)-grams."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    2490,
                    2193,
                    3055
                ],
                "angle": 0,
                "content": "We additionally performed pairwise comparisons between the top 10 n-grams that each system (selected from the task GL \\(\\rightarrow\\) EN) is better at generating, to further understand what kind of words pre-training is particularly helpful for. The results displayed in Table 7 demonstrate that pretraining helps both with words of low frequency in the training corpus, and even with function words such as prepositions. On the other hand, the improvements in systems without pre-trained embed"
            },
            {
                "block_id": 16,
                "type": "page_footnote",
                "bbox": [
                    1267,
                    3101,
                    2190,
                    3192
                ],
                "angle": 0,
                "content": "<sup>9</sup>Analysis was performed using compare-mt.py from https://github.com/neubig/util-scripts/."
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "532"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    295,
                    263,
                    2210,
                    624
                ],
                "angle": 0,
                "content": "<table><tr><td>source</td><td>(risos) e é que chris é un grande avogado, pero non sabía case nada sobre lexislación de patentes e absolutamente nada sobre xenética.</td></tr><tr><td>reference</td><td>( laughter) now chris is a really brilliant lawyer, but he knew almost nothing about patent law and certainly nothing about genetics.</td></tr><tr><td>bi:std</td><td>( laughter) and i &#x27;m not a little bit of a little bit of a little bit of and ( laughter) and i &#x27;m going to be able to be a lot of years.</td></tr><tr><td>multi:pre-align</td><td>( laughter) and chris is a big lawyer, but i did n&#x27;t know almost anything about patent legislation and absolutely nothing about genetic.</td></tr></table>",
                "caption": "Table 6: Example translations of \\( \\mathrm{{GL}} \\rightarrow  \\mathrm{{EN}} \\) ."
            },
            {
                "block_id": 2,
                "type": "table",
                "bbox": [
                    320,
                    733,
                    1136,
                    1248
                ],
                "angle": 0,
                "content": "<table><tr><td colspan=\"2\">bi:std</td><td colspan=\"2\">bi:pre</td></tr><tr><td>) so</td><td>2/0</td><td>about</td><td>0/53</td></tr><tr><td>( laughter ) i</td><td>2/0</td><td>people</td><td>0/49</td></tr><tr><td>) i</td><td>2/0</td><td>or</td><td>0/43</td></tr><tr><td>laughter ) i</td><td>2/0</td><td>these</td><td>0/39</td></tr><tr><td>) and</td><td>2/0</td><td>with</td><td>0/38</td></tr><tr><td>they were</td><td>1/0</td><td>because</td><td>0/37</td></tr><tr><td>have to</td><td>5/2</td><td>like</td><td>0/36</td></tr><tr><td>a new</td><td>1/0</td><td>could</td><td>0/35</td></tr><tr><td>to do ,</td><td>1/0</td><td>all</td><td>0/34</td></tr><tr><td>’’ and then</td><td>1/0</td><td>two</td><td>0/32</td></tr></table>"
            },
            {
                "block_id": 3,
                "type": "table_footnote",
                "bbox": [
                    312,
                    1262,
                    1141,
                    1308
                ],
                "angle": 0,
                "content": "(a) Pairwise comparison between two bilingual models"
            },
            {
                "block_id": 4,
                "type": "table",
                "bbox": [
                    1188,
                    733,
                    2160,
                    1248
                ],
                "angle": 0,
                "content": "<table><tr><td colspan=\"2\">multi:std</td><td colspan=\"2\">multi:pre+align</td></tr><tr><td>here</td><td>6/0</td><td>on the</td><td>0/14</td></tr><tr><td>again,</td><td>4/0</td><td>like</td><td>1/20</td></tr><tr><td>several</td><td>4/0</td><td>should</td><td>0/9</td></tr><tr><td>you &#x27;re going</td><td>4/0</td><td>court</td><td>0/9</td></tr><tr><td>&#x27;ve</td><td>4/0</td><td>judge</td><td>0/7</td></tr><tr><td>we &#x27;ve</td><td>4/0</td><td>testosterone</td><td>0/6</td></tr><tr><td>you &#x27;re going to</td><td>4/0</td><td>patents</td><td>0/6</td></tr><tr><td>people,</td><td>4/0</td><td>patent</td><td>0/6</td></tr><tr><td>what are</td><td>3/0</td><td>test</td><td>0/6</td></tr><tr><td>the room</td><td>3/0</td><td>with</td><td>1/12</td></tr></table>"
            },
            {
                "block_id": 5,
                "type": "table_footnote",
                "bbox": [
                    1228,
                    1262,
                    2113,
                    1311
                ],
                "angle": 0,
                "content": "(b) Pairwise comparison between two multilingual models"
            },
            {
                "block_id": 6,
                "type": "table_caption",
                "bbox": [
                    285,
                    1350,
                    2193,
                    1452
                ],
                "angle": 0,
                "content": "Table 7: Top 10 n-grams that one system did a better job of producing. The numbers in the figure, separated by a slash, indicate how many times each n-gram is generated by each of the two systems."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1540,
                    1205,
                    1648
                ],
                "angle": 0,
                "content": "dings were not very consistent, and largely focused on high-frequency words."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    287,
                    1683,
                    940,
                    1739
                ],
                "angle": 0,
                "content": "8.3 F-measure of Target Words"
            },
            {
                "block_id": 9,
                "type": "image",
                "bbox": [
                    310,
                    1803,
                    1180,
                    2360
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: The f-measure of target words in bilingual translation task PT \\(\\rightarrow\\) EN"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    285,
                    2557,
                    1213,
                    2953
                ],
                "angle": 0,
                "content": "Finally, we performed a comparison of the f-measure of target words, bucketed by frequency in the training corpus. As displayed in Figure 2, this shows that pre-training manages to improve the accuracy of translation for the entire vocabulary, but particularly for words that are of low frequency in the training corpus."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    287,
                    2992,
                    617,
                    3044
                ],
                "angle": 0,
                "content": "9 Conclusion"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    287,
                    3080,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "This paper examined the utility of considering pretrained word embeddings in NMT from a number"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    1540,
                    2195,
                    2213
                ],
                "angle": 0,
                "content": "of angles. Our conclusions have practical effects on the recommendations for when and why pretrained embeddings may be effective in NMT, particularly in low-resource scenarios: (1) there is a sweet-spot where word embeddings are most effective, where there is very little training data but not so little that the system cannot be trained at all, (2) pre-trained embeddings seem to be more effective for more similar translation pairs, (3) a priori alignment of embeddings may not be necessary in bilingual scenarios, but is helpful in multi-lingual training scenarios."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1267,
                    2290,
                    1697,
                    2346
                ],
                "angle": 0,
                "content": "Acknowledgements"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1262,
                    2402,
                    2193,
                    3132
                ],
                "angle": 0,
                "content": "Parts of this work were sponsored by Defense Advanced Research Projects Agency Information Innovation Office (I2O). Program: Low Resource Languages for Emergent Incidents (LORELEI). Issued by DARPA/I2O under Contract No. HR0011-15-C-0114. The views and conclusions contained in this document are those of the authors and should not be interpreted as representing the official policies, either expressed or implied, of the U.S. Government. The U.S. Government is authorized to reproduce and distribute reprints for Government purposes notwithstanding any copyright notation here on."
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "533"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    292,
                    263,
                    535,
                    315
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    295,
                    343,
                    1213,
                    491
                ],
                "angle": 0,
                "content": "Mikel Artetxe, Gorka Labaka, Eneko Agirre, and Kyunghyun Cho. 2017. Unsupervised neural machine translation. arXiv preprint arXiv:1710.11041"
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    295,
                    564,
                    1213,
                    750
                ],
                "angle": 0,
                "content": "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2014. Neural machine translation by jointly learning to align and translate. arXiv e-prints abs/1409.0473. https://arxiv.org/abs/1409.0473."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    295,
                    785,
                    1213,
                    971
                ],
                "angle": 0,
                "content": "Piotr Bojanowski, Edouard Grave, Armand Joulin, and Tomas Mikolov. 2016. Enriching word vectors with subword information. arXiv preprint arXiv:1607.04606."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    295,
                    1006,
                    1213,
                    1196
                ],
                "angle": 0,
                "content": "Yong Cheng, Wei Xu, Zhongjun He, Wei He, Hua Wu, Maosong Sun, and Yang Liu. 2016. Semi-supervised learning for neural machine translation. arXiv preprint arXiv:1606.04596."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    295,
                    1231,
                    1213,
                    1417
                ],
                "angle": 0,
                "content": "Alexis Conneau, Guillaume Lample, Marc'Aurelio Ranzato, Ludovic Denoyer, and Hervé Jégou. 2017. Word translation without parallel data. arXiv preprint arXiv:1710.04087."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    295,
                    1452,
                    1213,
                    1550
                ],
                "angle": 0,
                "content": "Greville Corbett and Bernard Comrie. 2003. The Slavonic Languages. Routledge."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    295,
                    1582,
                    1213,
                    1768
                ],
                "angle": 0,
                "content": "Michael Denkowski and Graham Neubig. 2017. Stronger baselines for trustable results in neural machine translation. arXiv preprint arXiv:1706.09733."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    295,
                    1806,
                    1213,
                    1992
                ],
                "angle": 0,
                "content": "Orhan First, Kyunghyun Cho, and Yoshua Bengio. 2016. Multi-way, multilingual neural machine translation with a shared attention mechanism. arXiv preprint arXiv:1601.01073."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    295,
                    2027,
                    1213,
                    2217
                ],
                "angle": 0,
                "content": "Mattia Antonino Di Gangi and Marcello Federico. 2017. Monolingual embeddings for low resourced neural machine translation. In International Workshop on Spoken Language Translation (IWSLT)."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    295,
                    2248,
                    1213,
                    2483
                ],
                "angle": 0,
                "content": "Xavier Glorot and Yoshua Bengio. 2010. Understanding the difficulty of training deep feedforward neural networks. In Proceedings of the Thirteenth International Conference on Artificial Intelligence and Statistics. pages 249-256."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    295,
                    2518,
                    1213,
                    2708
                ],
                "angle": 0,
                "content": "Di He, Yingce Xia, Tao Qin, Liwei Wang, Nenghai Yu, Tieyan Liu, and Wei-Ying Ma. 2016. Dual learning for machine translation. In Advances in Neural Information Processing Systems. pages 820-828."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    295,
                    2739,
                    1213,
                    2883
                ],
                "angle": 0,
                "content": "Melvin Johnson et al. 2016. Google's multilingual neural machine translation system: Enabling zero-shot translation. arXiv preprint arXiv:1611.04558."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    295,
                    2915,
                    1213,
                    3013
                ],
                "angle": 0,
                "content": "Yoon Kim. 2014. Convolutional neural networks for sentence classification. In In EMNLP. CiteSeer."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    295,
                    3044,
                    1213,
                    3185
                ],
                "angle": 0,
                "content": "Diederik Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980."
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    295,
                    343,
                    1213,
                    3185
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2190,
                    452
                ],
                "angle": 0,
                "content": "Guillaume Lample, Miguel Ballesteros, Sandeep Subramanian, Kazuya Kawakami, and Chris Dyer. 2016. Neural architectures for named entity recognition. In HLT-NAACL."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    491,
                    2190,
                    817
                ],
                "angle": 0,
                "content": "Xuezhe Ma and Eduard Hovy. 2016. End-to-end sequence labeling via bi-directional LSTM-cnns-crf. In Proceedings of the 54th Annual Meeting of the Association for Computational Linguistics (Volume 1: Long Papers). Association for Computational Linguistics, Berlin, Germany, pages 1064-1074. http://www.aclweb.org/anthology/P16-1101."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    848,
                    2190,
                    1034
                ],
                "angle": 0,
                "content": "Mitchell P Marcus, Mary Ann Marcinkiewicz, and Beatrice Santorini. 1993. Building a large annotated corpus of english: The penn treebank. Computational linguistics 19(2):313-330."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1073,
                    2190,
                    1304
                ],
                "angle": 0,
                "content": "P.H. Matthews. 1997. The Concise Oxford Dictionary of Linguistics.. Oxford Paperback Reference / Oxford University Press, Oxford. Oxford University Press, Incorporated. https://books.google.com/books?id=aYoYAAAAIAAJ."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1340,
                    2190,
                    1525
                ],
                "angle": 0,
                "content": "Tomas Mikolov, Edouard Grave, Piotr Bojanowski, Christian Puhrsch, and Armand Joulin. 2017. Advances in pre-training distributed word representations."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1564,
                    2190,
                    1799
                ],
                "angle": 0,
                "content": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. pages 3111-3119."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1831,
                    2190,
                    2203
                ],
                "angle": 0,
                "content": "Masato Neishi, Jin Sakuma, Satoshi Tohda, Shonosuke Ishiwatari, Naoki Yoshinaga, and Masashi Toyoda. 2017. A bag of useful tricks for practical neural machine translation: Embedding layer initialization and large batch size. In Proceedings of the 4th Workshop on Asian Translation (WAT2017). Asian Federation of Natural Language Processing, Taipei, Taiwan, pages 99-109."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2238,
                    2190,
                    2648
                ],
                "angle": 0,
                "content": "Graham Neubig, Matthias Sperber, Xinyi Wang, Matthieu Felix, Austin Matthews, Sarguna Padmanabhan, Ye Qi, Devendra Singh Sachan, Philip Arthur, Pierre Godard, John Hewitt, Rachid Riad, and Liming Wang. 2018. XNMT: The extensible neural machine translation toolkit. In Conference of the Association for Machine Translation in the Americas (AMTA) Open Source Software Showcase. Boston."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2687,
                    2190,
                    2967
                ],
                "angle": 0,
                "content": "Kishore Papineni, Salim Roukos, Todd Ward, and Wei-Jing Zhu. 2002. Bleu: a method for automatic evaluation of machine translation. In Proceedings of the 40th annual meeting on association for computational linguistics. Association for Computational Linguistics, pages 311-318."
            },
            {
                "block_id": 25,
                "type": "ref_text",
                "bbox": [
                    1272,
                    3002,
                    2190,
                    3185
                ],
                "angle": 0,
                "content": "Prajit Ramachandran, Peter J Liu, and Quoc V Le. 2016. Unsupervised pretraining for sequence to sequence learning. arXiv preprint arXiv:1611.02683"
            },
            {
                "block_id": 26,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2190,
                    3185
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 27,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "534"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1215,
                    456
                ],
                "angle": 0,
                "content": "Samuel L Smith, David HP Turban, Steven Hamblin, and Nils Y Hammerla. 2017. Offline bilingual word vectors, orthogonal transformations and the inverted softmax. arXiv preprint arXiv:1702.03859."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    487,
                    1215,
                    1083
                ],
                "angle": 0,
                "content": "Yonghui Wu, Mike Schuster, Zhifeng Chen, Quoc V. Le, Mohammad Norouzi, Wolfgang Macherey, Maxim Krikun, Yuan Cao, Qin Gao, Klaus Macherey, Jeff Klingner, Apurva Shah, Melvin Johnson, Xiaobing Liu, Lukasz Kaiser, Stephan Gouws, Yoshikiyo Kato, Taku Kudo, Hideto Kazawa, Keith Stevens, George Kurian, Nishant Patil, Wei Wang, Cliff Young, Jason Smith, Jason Riesa, Alex Rudnick, Oriol Vinyals, Gregory S. Corrado, Macduff Hughes, and Jeffrey Dean. 2016. Google's neural machine translation system: Bridging the gap between human and machine translation. CoRR abs/1609.08144."
            },
            {
                "block_id": 2,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1215,
                    1083
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 3,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1277,
                    3276
                ],
                "angle": 0,
                "content": "535"
            }
        ]
    }
]