[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    630,
                    259,
                    1855,
                    396
                ],
                "angle": 0,
                "content": "Conversations Gone Awry: Detecting Early Signs of Conversational Failure"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    414,
                    427,
                    2108,
                    547
                ],
                "angle": 0,
                "content": "Justine Zhang and Jonathan P. Chang and Cristian Danescu-Niculescu-Mizil* Cornell University"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    483,
                    550,
                    2014,
                    613
                ],
                "angle": 0,
                "content": "{jz727,jpc362} \\(@\\) cornell.edu,cristian@cs.cornell.edu"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    659,
                    992,
                    778
                ],
                "angle": 0,
                "content": "Lucas Dixon and Nithum Thain Jigsaw"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    218,
                    778,
                    997,
                    838
                ],
                "angle": 0,
                "content": "{ldixon,nthain}@google.com"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1096,
                    659,
                    1478,
                    778
                ],
                "angle": 0,
                "content": "Yiqing Hua Cornell University"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1027,
                    782,
                    1545,
                    834
                ],
                "angle": 0,
                "content": "yh663@cornell.edu"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1607,
                    659,
                    2188,
                    841
                ],
                "angle": 0,
                "content": "Dario Taraborelli  \nWikimedia Foundation  \ndario@wikimedia.org"
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    652,
                    912,
                    850,
                    964
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    354,
                    1006,
                    1146,
                    1627
                ],
                "angle": 0,
                "content": "One of the main challenges online social systems face is the prevalence of antisocial behavior, such as harassment and personal attacks. In this work, we introduce the task of predicting from the very start of a conversation whether it will get out of hand. As opposed to detecting undesirable behavior after the fact, this task aims to enable early, actionable prediction at a time when the conversation might still be salvaged."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    354,
                    1648,
                    1146,
                    2150
                ],
                "angle": 0,
                "content": "To this end, we develop a framework for capturing pragmatic devices—such as politeness strategies and rhetorical prompts—used to start a conversation, and analyze their relation to its future trajectory. Applying this framework in a controlled setting, we demonstrate the feasibility of detecting early warning signs of antisocial behavior in online discussions."
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    290,
                    2192,
                    650,
                    2241
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    379,
                    2266,
                    1019,
                    2311
                ],
                "angle": 0,
                "content": "\"Or vedi l'anim di color cui vinse l'ira.\"1"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    513,
                    2325,
                    1210,
                    2374
                ],
                "angle": 0,
                "content": "Dante Alighieri, Divina Commedia, Inferno"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    285,
                    2395,
                    1215,
                    3076
                ],
                "angle": 0,
                "content": "Online conversations have a reputation for going awry (Hinds and Mortensen, 2005; Gheitasy et al., 2015): antisocial behavior (Shepherd et al., 2015) or simple misunderstandings (Churchill and Bly, 2000; Yamashita and Ishida, 2006) hamper the efforts of even the best intentioned collaborators. Prior computational work has focused on characterizing and detecting content exhibiting antisocial online behavior: trolling (Cheng et al., 2015, 2017), hate speech (Warner and Hirschberg, 2012; Davidson et al., 2017), harassment (Yin et al., 2009), personal attacks (Wulczyn et al.,"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    912,
                    2190,
                    1024
                ],
                "angle": 0,
                "content": "2017) or, more generally, toxicity (Chandrasekharan et al., 2017; Pavlopoulos et al., 2017b)."
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    1027,
                    2193,
                    1420
                ],
                "angle": 0,
                "content": "Our goal is crucially different: instead of identifying antisocial comments after the fact, we aim to detect warning signs indicating that a civil conversation is at risk of derailing into such undesirable behaviors. Such warning signs could provide potentially actionable knowledge at a time when the conversation is still salvageable."
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    1427,
                    2195,
                    1989
                ],
                "angle": 0,
                "content": "As a motivating example, consider the pair of conversations in Figure 1. Both exchanges took place in the context of the Wikipedia discussion page for the article on the Dyatlov Pass Incident, and both show (ostensibly) civil disagreement between the participants. However, only one of these conversations will eventually turn awry and delve into a personal attack (\"Wow, you're coming off as a total d**k. [...] What the hell is wrong with you?\"), while the other will remain civil."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1265,
                    1992,
                    2193,
                    2606
                ],
                "angle": 0,
                "content": "As humans, we have some intuition about which conversation is more likely to derail.2 We may note the repeated, direct questioning with which A1 opens the exchange, and that A2 replies with yet another question. In contrast, B1's softer, hedged approach (\"it seems\", \"I don't think\") appears to invite an exchange of ideas, and B2 actually addresses the question instead of stonewalling. Could we endow artificial systems with such intuitions about the future trajectory of conversations?"
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    2616,
                    2193,
                    3062
                ],
                "angle": 0,
                "content": "In this work we aim to computationally capture linguistic cues that predict a conversation's future health. Most existing conversation modeling approaches aim to detect characteristics of an observed discussion or predict the outcome after the discussion concludes—e.g., whether it involves a present dispute (Allen et al., 2014; Wang and Cardie, 2014) or contributes to the even-"
            },
            {
                "block_id": 20,
                "type": "page_footnote",
                "bbox": [
                    1267,
                    3101,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": "\\( {}^{2} \\) In fact, humans achieve an accuracy of 72% on this balanced task, showing that it is feasible, but far from trivial."
            },
            {
                "block_id": 21,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3097,
                    833,
                    3143
                ],
                "angle": 0,
                "content": "* Corresponding senior author."
            },
            {
                "block_id": 22,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3143,
                    1210,
                    3188
                ],
                "angle": 0,
                "content": "1 \"Now you see the souls of those whom anger overcame.\""
            },
            {
                "block_id": 23,
                "type": "list",
                "bbox": [
                    347,
                    3097,
                    1210,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 24,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1350"
            },
            {
                "block_id": 25,
                "type": "footer",
                "bbox": [
                    307,
                    3301,
                    2160,
                    3395
                ],
                "angle": 0,
                "content": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 1350-1361 Melbourne, Australia, July 15 - 20, 2018. ©2018 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    312,
                    270,
                    1195,
                    484
                ],
                "angle": 0,
                "content": "A1: Why there's no mention of it here? Namely, an altercation with a foreign intelligence group? True, by the standards of sources some require it wouldn't even come close, not to mention having some really weak points, but it doesn't mean that it doesn't exist."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    429,
                    508,
                    1180,
                    596
                ],
                "angle": 0,
                "content": "A2: So what you're saying is we should put a bad source in the article because it exists?"
            },
            {
                "block_id": 2,
                "type": "list",
                "bbox": [
                    312,
                    270,
                    1195,
                    596
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    1252,
                    270,
                    2138,
                    526
                ],
                "angle": 0,
                "content": "B1: Is the St. Petersburg Times considered a reliable source by wikipedia? It seems that the bulk of this article is coming from that one article, which speculates about missile launches and UFOs. I'm going to go through and try and find corroborating sources and maybe do a rewrite of the article. I don't think this article should rely on one so-so source."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    1367,
                    550,
                    2118,
                    634
                ],
                "angle": 0,
                "content": "B2: I would assume that it's as reliable as any other mainstream news source."
            },
            {
                "block_id": 5,
                "type": "list",
                "bbox": [
                    1252,
                    270,
                    2138,
                    634
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 6,
                "type": "image_caption",
                "bbox": [
                    285,
                    687,
                    2193,
                    859
                ],
                "angle": 0,
                "content": "Figure 1: Two examples of initial exchanges from conversations concerning disagreements between editors working on the Wikipedia article about the Dyatlov Pass Incident. Only one of the conversations will eventually turn awry, with an interlocutor launching into a personal attack."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    933,
                    1213,
                    1157
                ],
                "angle": 0,
                "content": "tual solution of a problem (Niculae and Danescu-Niculescu-Mizil, 2016). In contrast, for this new task we need to discover interactional signals of the future trajectory of an ongoing conversation."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    1161,
                    1213,
                    2003
                ],
                "angle": 0,
                "content": "We make a first approach to this problem by analyzing the role of politeness (or lack thereof) in keeping conversations on track. Prior work has shown that politeness can help shape the course of offline (Clark, 1979; Clark and Schunk, 1980), as well as online interactions (Burke and Kraut, 2008), through mechanisms such as softening the perceived force of a message (Fraser, 1980), acting as a buffer between conflicting interlocutor goals (Brown and Levinson, 1987), and enabling all parties to save face (Goffman, 1955). This suggests the potential of politeness to serve as an indicator of whether a conversation will sustain its initial civility or eventually derail, and motivates its consideration in the present work."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2006,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "Recent studies have computationally operationalized prior formulations of politeness by extracting linguistic cues that reflect politeness strategies (Danescu-Niculescu-Mizil et al., 2013; Aubakirova and Bansal, 2016). Such research has additionally tied politeness to social factors such as individual status (Danescu-Niculescu-Mizil et al., 2012; Krishnan and Eisenstein, 2015), and the success of requests (Althoff et al., 2014) or of collaborative projects (Ortu et al., 2015). However, to the best of our knowledge, this is the first computational investigation of the relation between politeness strategies and the future trajectory of the conversations in which they are deployed. Furthermore, we generalize beyond predefined politeness strategies by using an unsupervised method to discover additional rhetorical prompts used to initiate different types of conversations that may be specific to online collaborative settings, such as coordinating work (Kittur and Kraut, 2008) or conducting factual checks."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    933,
                    2195,
                    1438
                ],
                "angle": 0,
                "content": "We explore the role of such pragmatic and rhetorical devices in foretelling a particularly perplexing type of conversational failure: when participants engaged in previously civil discussion start to attack each other. This type of derailment \"from within\" is arguably more disruptive than other forms of antisocial behavior, such as vandalism or trolling, which the interlocutors have less control over or can choose to ignore."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    1438,
                    2193,
                    2287
                ],
                "angle": 0,
                "content": "We study this phenomenon in a new dataset of Wikipedia talk page discussions, which we compile through a combination of machine learning and crowdsourced filtering. The dataset consists of conversations which begin with ostensibly civil comments, and either remain healthy or derail into personal attacks. Starting from this data, we construct a setting that mitigates effects which may trivialize the task. In particular, some topical contexts (such as politics and religion) are naturally more susceptible to antisocial behavior (Kittur et al., 2009; Cheng et al., 2015). We employ techniques from causal inference (Rosenbaum, 2010) to establish a controlled framework that focuses our study on topic-agnostic linguistic cues."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    2287,
                    2193,
                    2792
                ],
                "angle": 0,
                "content": "In this controlled setting, we find that pragmatic cues extracted from the very first exchange in a conversation (i.e., the first comment-reply pair) can indeed provide some signal of whether the conversation will subsequently go awry. For example, conversations prompted by hedged remarks sustain their initial civility more so than those prompted by forceful questions, or by direct language addressing the other interlocutor."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1312,
                    2795,
                    2059,
                    2848
                ],
                "angle": 0,
                "content": "In summary, our main contributions are:"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1317,
                    2869,
                    2190,
                    3034
                ],
                "angle": 0,
                "content": "- We articulate the new task of detecting early on whether a conversation will derail into personal attacks;"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1317,
                    3069,
                    2190,
                    3181
                ],
                "angle": 0,
                "content": "- We devise a controlled setting and build a labeled dataset to study this phenomenon;"
            },
            {
                "block_id": 16,
                "type": "list",
                "bbox": [
                    1317,
                    2869,
                    2190,
                    3181
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1287,
                    3279
                ],
                "angle": 0,
                "content": "1351"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    337,
                    266,
                    1210,
                    431
                ],
                "angle": 0,
                "content": "- We investigate how politeness strategies and other rhetorical devices are tied to the future trajectory of a conversation."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    456,
                    1215,
                    1017
                ],
                "angle": 0,
                "content": "More broadly, we show the feasibility of automatically detecting warning signs of future misbehavior in collaborative interactions. By providing a labeled dataset together with basic methodology and several baselines, we open the door to further work on understanding factors which may derail or sustain healthy online conversations. To facilitate such future explorations, we distribute the data and code as part of the Cornell Conversational Analysis Toolkit.<sup>3</sup>"
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1055,
                    855,
                    1112
                ],
                "angle": 0,
                "content": "2 Further Related Work"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1143,
                    1215,
                    3118
                ],
                "angle": 0,
                "content": "Antisocial behavior. Prior work has studied a wide range of disruptive interactions in various online platforms like Reddit and Wikipedia, examining behaviors like aggression (Kayany, 1998), harassment (Chatzakou et al., 2017; Vitak et al., 2017), and bullying (Akbulut et al., 2010; Kwak et al., 2015; Singh et al., 2017), as well as their impact on aspects of engagement like user retention (Collier and Bear, 2012; Wikimedia Support and Safety Team, 2015) or discussion quality (Arazy et al., 2013). Several studies have sought to develop machine learning techniques to detect signatures of online toxicity, such as personal insults (Yin et al., 2009), harassment (Sood et al., 2012) and abusive language (Nobata et al., 2016; Gambäck and Sikdar, 2017; Pavlopoulos et al., 2017a; Wulczyn et al., 2017). These works focus on detecting toxic behavior after it has already occurred; a notable exception is Cheng et al. (2017), which predicts future community enforcement against users in news-based discussions. Our work similarly aims to understand future antisocial behavior; however, our focus is on studying the trajectory of a conversation rather than the behavior of individuals across disparate discussions. Discourse analysis. Our present study builds on a large body of prior work in computationally modeling discourse. Both unsupervised (Ritter et al., 2010) and supervised (Zhang et al., 2017a) approaches have been used to categorize behavioral patterns on the basis of the language that ensues in a conversation, in the particular realm of online discussions. Models of conversational behavior have also been used to predict conversation outcomes, such as betrayal in games (Niculae et al.,"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2190,
                    431
                ],
                "angle": 0,
                "content": "2015), and success in team problem solving settings (Fu et al., 2017) or in persuading others (Tan et al., 2016; Zhang et al., 2016)."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    438,
                    2195,
                    1055
                ],
                "angle": 0,
                "content": "While we are inspired by the techniques employed in these approaches, our work is concerned with predicting the future trajectory of an ongoing conversation as opposed to a post-hoc outcome. In this sense, we build on prior work in modeling conversation trajectory, which has largely considered structural aspects of the conversation (Kumar et al., 2010; Backstrom et al., 2013). We complement these structural models by seeking to extract potential signals of future outcomes from the linguistic discourse within the conversation."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1267,
                    1112,
                    2091,
                    1171
                ],
                "angle": 0,
                "content": "3 Finding Conversations Gone Awry"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1210,
                    2193,
                    2220
                ],
                "angle": 0,
                "content": "We develop our framework for understanding linguistic markers of conversational trajectories in the context of Wikipedia's talk page discussions—public forums in which contributors convene to deliberate on editing matters such as evaluating the quality of an article and reviewing the compliance of contributions with community guidelines. The dynamic of conversational derailment is particularly intriguing and consequential in this setting by virtue of its collaborative, goal-oriented nature. In contrast to unstructured commenting forums, cases where one collaborator turns on another over the course of an initially civil exchange constitute perplexing pathologies. In turn, these toxic attacks are especially disruptive in Wikipedia since they undermine the social fabric of the community as well as the ability of editors to contribute (Henner and Sefidari, 2016)."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    2231,
                    2193,
                    2567
                ],
                "angle": 0,
                "content": "To approach this domain we reconstruct a complete view of the conversational process in the edit history of English Wikipedia by translating sequences of revisions of each talk page into structured conversations. This yields roughly 50 million conversations across 16 million talk pages."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    2574,
                    2193,
                    3188
                ],
                "angle": 0,
                "content": "Roughly one percent of Wikipedia comments are estimated to exhibit antisocial behavior (Wulczyn et al., 2017). This illustrates a challenge for studying conversational failure: one has to sift through many conversations in order to find even a small set of examples. To avoid such a prohibitively exhaustive analysis, we first use a machine learning classifier to identify candidate conversations that are likely to contain a toxic contribution, and then use crowdsourcing to vet the resulting labels and construct our controlled dataset."
            },
            {
                "block_id": 10,
                "type": "page_footnote",
                "bbox": [
                    342,
                    3139,
                    1156,
                    3188
                ],
                "angle": 0,
                "content": "<sup>3</sup>http://convokit.infosci.cornell.edu"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1295,
                    3279
                ],
                "angle": 0,
                "content": "1352"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 1,
                "type": "table",
                "bbox": [
                    305,
                    431,
                    1081,
                    529
                ],
                "angle": 0,
                "content": "<table><tr><td>Annotators</td><td>Conversations</td><td>Agreement</td></tr><tr><td>367</td><td>4,022</td><td>67.8%</td></tr></table>",
                "caption": "Job 2: Civil start. We split conversations into snippets of three consecutive comments. We ask three annotators to determine whether any of the comments in a snippet is toxic."
            },
            {
                "block_id": 3,
                "type": "table",
                "bbox": [
                    1309,
                    431,
                    2108,
                    519
                ],
                "angle": 0,
                "content": "<table><tr><td>Annotators</td><td>Conversations</td><td>Snippets</td><td>Agreement</td></tr><tr><td>247</td><td>1,252</td><td>2,181</td><td>87.5%</td></tr></table>",
                "caption": "Table 1: Descriptions of crowdsourcing jobs, with relevant statistics. More details in Appendix A."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    282,
                    715,
                    1215,
                    1333
                ],
                "angle": 0,
                "content": "Candidate selection. Our goal is to analyze how the start of a civil conversation is tied to its potential future derailment into personal attacks. Thus, we only consider conversations that start out as ostensibly civil, i.e., where at least the first exchange does not exhibit any toxic behavior,[4] and that continue beyond this first exchange. To focus on the especially perplexing cases when the attacks come from within, we seek examples where the attack is initiated by one of the two participants in the initial exchange."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1340,
                    1215,
                    2181
                ],
                "angle": 0,
                "content": "To select candidate conversations to include in our collection, we use the toxicity classifier provided by the Perspective API,\\(^{5}\\) which is trained on Wikipedia talk page comments that have been annotated by crowdworkers (Wulczyn et al., 2016). This provides a toxicity score \\( t \\) for all comments in our dataset, which we use to preselect two sets of conversations: (a) candidate conversations that are civil throughout, i.e., conversations in which all comments (including the initial exchange) are not labeled as toxic (\\( t < 0.4 \\)); and (b) candidate conversations that turn toxic after the first (civil) exchange, i.e., conversations in which the \\( N \\)-th comment (\\( N > 2 \\)) is labeled toxic (\\( t \\geq 0.6 \\)), but all the preceding comments are not (\\( t < 0.4 \\))."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2188,
                    1215,
                    2974
                ],
                "angle": 0,
                "content": "Crowdsourced filtering. Starting from these candidate sets, we use crowdsourcing to vet each conversation and select a subset that are perceived by humans to either stay civil throughout (\"on-track\" conversations), or start civil but end with a personal attack (\"awry-turning\" conversations). To inform the design of this human-filtering process and to check its effectiveness, we start from a seed set of 232 conversations manually verified by the authors to end in personal attacks (more details about the selection of the seed set and its role in the crowd-sourcing process can be found in Appendix A). We take particular care to not over-constrain crowdworker interpretations of"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    715,
                    2195,
                    940
                ],
                "angle": 0,
                "content": "what personal attacks may be, and to separate toxicity from civil disagreement, which is recognized as a key aspect of effective collaborations (Coser, 1956; De Dreu and Weingart, 2003)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    947,
                    2195,
                    1960
                ],
                "angle": 0,
                "content": "We design and deploy two filtering jobs using the CrowdFlower platform, summarized in Table 1 and detailed in Appendix A. Job 1 is designed to select conversations that contain a \"rude, insulting, or disrespectful\" comment towards another user in the conversation—i.e., a personal attack. In contrast to prior work labeling antisocial comments in isolation (Sood et al., 2012; Wulczyn et al., 2017), annotators are asked to label personal attacks in the context of the conversations in which they occur, since antisocial behavior can often be context-dependent (Cheng et al., 2017). In fact, in order to ensure that the crowdworkers read the entire conversation, we also ask them to indicate who is the target of the attack. We apply this task to the set of candidate awry-turning conversations, selecting the \\(14\\%\\) which all three annotators perceived as ending in a personal attack.[6]"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    1967,
                    2198,
                    2588
                ],
                "angle": 0,
                "content": "Job 2 is designed to filter out conversations that do not actually start out as civil. We run this job to ensure that the awry-turning conversations are civil up to the point of the attack—i.e., they turn awry—discarding \\(5\\%\\) of the candidates that passed Job 1. We also use it to verify that the candidate on-track conversations are indeed civil throughout, discarding \\(1\\%\\) of the respective candidates. In both cases we filter out conversations in which three annotators could identify at least one comment that is \"rude, insulting, or disrespectful\"."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    2595,
                    2200,
                    3048
                ],
                "angle": 0,
                "content": "Controlled setting. Finally, we need to construct a setting that affords for meaningful comparison between conversations that derail and those that stay on track, and that accounts for trivial topical confounds (Kittur et al., 2009; Cheng et al., 2015). We mitigate topical confounds using matching, a technique developed for causal inference in observational studies (Rubin, 2007). Specifically, start-"
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3009,
                    1213,
                    3139
                ],
                "angle": 0,
                "content": "4 For the sake of generality, in this work we focus on this most basic conversational unit: the first comment-reply pair starting a conversation."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    342,
                    3139,
                    1061,
                    3188
                ],
                "angle": 0,
                "content": "5https://www.perspectiveapi.com/"
            },
            {
                "block_id": 14,
                "type": "list",
                "bbox": [
                    287,
                    3009,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    1267,
                    3097,
                    2195,
                    3192
                ],
                "angle": 0,
                "content": "<sup>6</sup>We opted to use unanimity in this task to account for the highly subjective nature of the phenomenon."
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1353"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1210,
                    712
                ],
                "angle": 0,
                "content": "ing from our human-vetted collection of conversations, we pair each awry-turning conversation, with an on-track conversation, such that both took place on the same talk page. If we find multiple such pairs, we only keep the one in which the paired conversations take place closest in time, to tighten the control for topic. Conversations that cannot be paired are discarded."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    719,
                    1215,
                    1059
                ],
                "angle": 0,
                "content": "This procedure yields a total of 1,270 paired awry-turning and on-track conversations (including our initial seed set), spanning 582 distinct talk pages (averaging 1.1 pairs per page, maximum 8) and 1,876 (overlapping) topical categories. The average length of a conversation is 4.6 comments."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1112,
                    1007,
                    1171
                ],
                "angle": 0,
                "content": "4 Capturing Pragmatic Devices"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1210,
                    1215,
                    1936
                ],
                "angle": 0,
                "content": "We now describe our framework for capturing linguistic cues that might inform a conversation's future trajectory. Crucially, given our focus on conversations that start seemingly civil, we do not expect overtly hostile language—such as insults (Yin et al., 2009)—to be informative. Instead, we seek to identify pragmatic markers within the initial exchange of a conversation that might serve to reveal or exacerbate underlying tensions that eventually come to the fore, or conversely suggest sustainable civility. In particular, in this work we explore how politeness strategies and rhetorical prompts reflect the future health of a conversation."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1946,
                    1215,
                    2395
                ],
                "angle": 0,
                "content": "Politeness strategies. Politeness can reflect a-priori good will and help navigate potentially face-threatening acts (Goffman, 1955; Lakoff, 1973), and also offers hints to the underlying intentions of the interlocutors (Fraser, 1980). Hence, we may naturally expect certain politeness strategies to signal that a conversation is likely to stay on track, while others might signal derailment."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2402,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "In particular, we consider a set of pragmatic devices signaling politeness drawn from Brown and Levinson (1987). These linguistic features reflect two overarching types of politeness. Positive politeness strategies encourage social connection and rapport, perhaps serving to maintain cohesion throughout a conversation; such strategies include gratitude (\"thanks for your help\"), greetings (\"hey, how is your day so far\") and use of \"please\", both at the start (\"Please find sources for your edit...\") and in the middle (\"Could you please help with...?\") of a sentence. Negative politeness strategies serve to dampen an interlocutor's imposition on an addressee, often through conveying"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2195,
                    1052
                ],
                "angle": 0,
                "content": "indirectness or uncertainty on the part of the commenter. Both commenters in example B (Fig. 1) employ one such strategy, hedging, perhaps seeking to soften an impending disagreement about a source's reliability (\"I don't think...\", \"I would assume...\"). We also consider markers of impolite behavior, such as the use of direct questions (\"Why's there no mention of it?\") and sentence-initial second person pronouns (\"Your sources don't matter...\"), which may serve as forceful-sounding contrasts to negative politeness markers. Following Danescu-Niculescu-Mizil et al. (2013), we extract such strategies by pattern matching on the dependency parses of comments."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    1073,
                    2195,
                    2087
                ],
                "angle": 0,
                "content": "Types of conversation prompts. To complement our pre-defined set of politeness strategies, we seek to capture domain-specific rhetorical patterns used to initiate conversations. For instance, in a collaborative setting, we may expect conversations that start with an invitation for working together to signal less tension between the participants than those that start with statements of dispute. We discover types of such conversation prompts in an unsupervised fashion by extending a framework used to infer the rhetorical role of questions in (offline) political debates (Zhang et al., 2017b) to more generally extract the rhetorical functions of comments. The procedure follows the intuition that the rhetorical role of a comment is reflected in the type of replies it is likely to elicit. As such, comments which tend to trigger similar replies constitute a particular type of prompt."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    2104,
                    2193,
                    2781
                ],
                "angle": 0,
                "content": "To implement this intuition, we derive two different low-rank representations of the common lexical phrasings contained in comments (agnostic to the particular topical content discussed), automatically extracted as recurring sets of arcs in the dependency parses of comments. First, we derive reply-vectors of phrasings, which reflect their propensities to co-occur. In particular, we perform singular value decomposition on a term-document matrix \\(\\mathcal{R}\\) of phrasings and replies as \\(\\mathcal{R} \\approx \\hat{\\mathcal{R}} = U_R S V_R^T\\), where rows of \\(U_R\\) are low-rank reply-vectors for each phrasing."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    2799,
                    2193,
                    3195
                ],
                "angle": 0,
                "content": "Next, we derive prompt-vectors for the phrasings, which reflect similarities in the subsequent replies that a phrasing prompts. We construct a prompt-reply matrix \\(\\mathcal{P} = (p_{ij})\\) where \\(p_{ij} = 1\\) if phrasing \\(j\\) occurred in a reply to a comment containing phrasing \\(i\\). We project \\(\\mathcal{P}\\) into the same space as \\(U_R\\) by solving for \\(\\hat{\\mathcal{P}}\\) in \\(\\mathcal{P} = \\hat{\\mathcal{P}} SV_R^T\\) as"
            },
            {
                "block_id": 10,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1354"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    297,
                    256,
                    2195,
                    880
                ],
                "angle": 0,
                "content": "<table><tr><td>Prompt Type</td><td>Description</td><td>Examples</td></tr><tr><td>Factual check</td><td>Statements about article content, pertaining to or contending issues like factual accuracy.</td><td>The terms are used interchangeably in the US.\nThe census is not talking about families here.</td></tr><tr><td>Moderation</td><td>Rebukes or disputes concerning moderation decisions such as blocks and reversions.</td><td>If you continue, you may be blocked from editing.\nHe&#x27;s accused me of being a troll.</td></tr><tr><td>Coordination</td><td>Requests, questions, and statements of intent pertaining to collaboratively editing an article.</td><td>It&#x27;s a long list so I could do with your help.\nLet me know if you agree with this and I&#x27;ll go ahead [...]</td></tr><tr><td>Casual remark</td><td>Casual, highly conversational aside-remarks.</td><td>What&#x27;s with this flag image?\nI&#x27;m surprised there wasn&#x27;t an article before.</td></tr><tr><td>Action statement</td><td>Requests, statements, and explanations about various editing actions.</td><td>Please consider improving the article to address the issues [...] The page was deleted as self-promotion.</td></tr><tr><td>Opinion</td><td>Statements seeking or expressing opinions about editing challenges and decisions.</td><td>I think that it should be the other way around.\nThis article seems to have a lot of bias.</td></tr></table>",
                "caption": "Table 2: Prompt types automatically extracted from talk page conversations, with interpretations and examples from the data. Bolded text indicate common prompt phrasings extracted by the framework. Further examples are shown in Appendix B, Table 4."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1192,
                    1215,
                    1817
                ],
                "angle": 0,
                "content": "\\(\\hat{\\mathcal{P}} = \\mathcal{P}V_{R}S^{-1}\\). Each row of \\(\\hat{\\mathcal{P}}\\) is then a prompt-vector of a phrasing, such that the prompt-vector for phrasing \\(i\\) is close to the reply-vector for phrasing \\(j\\) if comments with phrasing \\(i\\) tend to prompt replies with phrasing \\(j\\). Clustering the rows of \\(\\hat{\\mathcal{P}}\\) then yields \\(k\\) conversational prompt types that are unified by their similarity in the space of replies. To infer the prompt type of a new comment, we represent the comment as an average of the representations of its constituent phrasings (i.e., rows of \\(\\hat{\\mathcal{P}}\\)) and assign the resultant vector to a cluster.\\(^7\\)"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1824,
                    1215,
                    2676
                ],
                "angle": 0,
                "content": "To determine the prompt types of comments in our dataset, we first apply the above procedure to derive a set of prompt types from a disjoint (unlabeled) corpus of Wikipedia talk page conversations (Danescu-Niculescu-Mizil et al., 2012). After initial examination of the framework's output on this external data, we chose to extract \\( k = 6 \\) prompt types, shown in Table 2 along with our interpretations. These prompts represent signatures of conversation-starters spanning a wide range of topics and contexts which reflect core elements of Wikipedia, such as moderation disputes and coordination (Kittur et al., 2007; Kittur and Kraut, 2008). We assign each comment in our present dataset to one of these types."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    1267,
                    1196,
                    1540,
                    1255
                ],
                "angle": 0,
                "content": "5 Analysis"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1262,
                    1290,
                    2195,
                    1908
                ],
                "angle": 0,
                "content": "We are now equipped to computationally explore how the pragmatic devices used to start a conversation can signal its future health. Concretely, to quantify the relative propensity of a linguistic marker to occur at the start of awry-turning versus on-track conversations, we compute the log-odds ratio of the marker occurring in the initial exchange—i.e., in the first or second comments—of awry-turning conversations, compared to initial exchanges in the on-track setting. These quantities are depicted in Figure 2A.\\(^{10}\\)"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    1262,
                    1915,
                    2193,
                    2648
                ],
                "angle": 0,
                "content": "Focusing on the first comment (represented as \\(\\diamondsuit\\)s), we find a rough correspondence between linguistic directness and the likelihood of future personal attacks. In particular, comments which contain direct questions, or exhibit sentence-initial you (i.e., “\\(2^{\\text{nd}}\\) person start”), tend to start awry-turning conversations significantly more often than ones that stay on track (both \\(p < 0.001\\)).<sup>11</sup> This effect coheres with our intuition that directness signals some latent hostility from the conversation's initiator, and perhaps reinforces the forcefulness of contentious impositions (Brown and Levinson, 1987). This interpretation is also sug-"
            },
            {
                "block_id": 7,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2715,
                    1213,
                    2890
                ],
                "angle": 0,
                "content": "<sup>7</sup>We scale rows of \\( U_R \\) and \\( \\hat{\\mathcal{P}} \\) to unit norm. We assign comments whose vector representation has \\( (\\ell_2) \\) distance \\( \\geq 1 \\) to all cluster centroids to an extra, infrequently-occurring null type which we ignore in subsequent analyses."
            },
            {
                "block_id": 8,
                "type": "page_footnote",
                "bbox": [
                    285,
                    2890,
                    1213,
                    3139
                ],
                "angle": 0,
                "content": "<sup>8</sup>We experimented with more prompt types as well, finding that while the methodology recovered finer-grained types, and obtained qualitatively similar results and prediction accuracies as described in Sections 5 and 6, the assignment of comments to types was relatively sparse due to the small data size, resulting in a loss of statistical power."
            },
            {
                "block_id": 9,
                "type": "page_footnote",
                "bbox": [
                    337,
                    3139,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": "9While the particular prompt types we discover are spe"
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    285,
                    2715,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    2676,
                    2190,
                    2764
                ],
                "angle": 0,
                "content": "cific to Wikipedia, the methodology for inferring them is unsupervised and is applicable in other conversational settings."
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    2764,
                    2190,
                    3020
                ],
                "angle": 0,
                "content": "To reduce clutter we only depict features which occur a minimum of 50 times and have absolute log-odds \\(\\geq 0.2\\) in at least one of the data subsets. The markers indicated as statistically significant for Figure 2A remain so after a Bonferroni correction, with the exception of factual checks, hedges (lexicon, \\(\\diamond\\)), gratitude \\((\\diamond)\\), and opinion."
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    1265,
                    3020,
                    2193,
                    3185
                ],
                "angle": 0,
                "content": "11 All \\( p \\) values in this section are computed as two-tailed binomial tests, comparing the proportion of awry-turning conversations exhibiting a particular device to the proportion of on-track conversations."
            },
            {
                "block_id": 14,
                "type": "list",
                "bbox": [
                    1265,
                    2676,
                    2193,
                    3185
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 15,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1355"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    305,
                    263,
                    1118,
                    1333
                ],
                "angle": 0,
                "content": null,
                "caption": "A. First & second comment"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1161,
                    263,
                    1649,
                    1333
                ],
                "angle": 0,
                "content": null,
                "caption": "B. Attacker initiated"
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    1669,
                    263,
                    2188,
                    1333
                ],
                "angle": 0,
                "content": null,
                "caption": "C. Non-attacker initiated"
            },
            {
                "block_id": 6,
                "type": "image_caption",
                "bbox": [
                    282,
                    1438,
                    2193,
                    1939
                ],
                "angle": 0,
                "content": "Figure 2: Log-odds ratios of politeness strategies and prompt types exhibited in the first and second comments of conversations that turn awry, versus those that stay on-track. All: Purple and green markers denote log-odds ratios in the first and second comments, respectively; points are solid if they reflect significant \\((p < 0.05)\\) log-odds ratios with an effect size of at least 0.2. A: \\(\\diamondsuit\\)s and \\(\\square\\)s denote first and second comment log-odds ratios, respectively; * denotes statistically significant differences at the \\(p < 0.05(^*)\\), \\(p < 0.01(^{**})\\) and \\(p < 0.001(^{***})\\) levels for the first comment (two-tailed binomial test); + denotes corresponding statistical significance for the second comment. B and C: \\(\\nabla\\)s and \\(\\bigcirc\\)s correspond to effect sizes in the comments authored by the attacker and non-attacker, respectively, in attacker initiated (B) and non-attacker initiated (C) conversations."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2038,
                    1213,
                    2206
                ],
                "angle": 0,
                "content": "gusted by the relative propensity of the factual check prompt, which tends to cue disputes regarding an article's factual content (\\(p < 0.05\\))."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    285,
                    2220,
                    1213,
                    2894
                ],
                "angle": 0,
                "content": "In contrast, comments which initiate on-track conversations tend to contain gratitude \\((p < 0.05)\\) and greetings \\((p < 0.001)\\), both positive politeness strategies. Such conversations are also more likely to begin with coordination prompts \\((p < 0.05)\\), signaling active efforts to foster constructive teamwork. Negative politeness strategies are salient in on-track conversations as well, reflected by the use of hedges \\((p < 0.01)\\) and opinion prompts \\((p < 0.05)\\), which may serve to soften impositions or factual contentions (Hübler, 1983)."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2911,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "These effects are echoed in the second comment—i.e., the first reply (represented as \\(\\square\\)s). Interestingly, in this case we note that the difference in pronoun use is especially marked. First replies in conversations that eventually de"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    2038,
                    2193,
                    2543
                ],
                "angle": 0,
                "content": "rail tend to contain more second person pronouns (\\(p < 0.001\\)), perhaps signifying a replier pushing back to contest the initiator; in contrast, on-track conversations have more sentence-initial I/We (i.e., “\\(1^{\\text{st}}\\) person start”, \\(p < 0.001\\)), potentially indicating the replier’s willingness to step into the conversation and work with—rather than argue against—the initiator (Tausczik and Pennebaker, 2010)."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    2571,
                    2195,
                    3195
                ],
                "angle": 0,
                "content": "Distinguishing interlocutor behaviors. Are the linguistic signals we observe solely driven by the eventual attacker, or do they reflect the behavior of both actors? To disentangle the attacker and nonattackers' roles in the initial exchange, we examine their language use in these two possible cases: when the future attacker initiates the conversation, or is the first to reply. In attacker-initiated conversations (Figure 2B, 608 conversations), we see that both actors exhibit a propensity for the linguistically direct markers (e.g., direct questions)"
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1356"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    263,
                    1215,
                    1108
                ],
                "angle": 0,
                "content": "that tend to signal future attacks. Some of these markers are used particularly often by the non-attacking replier in awry-turning conversations (e.g., second person pronouns, \\( p < 0.001 \\), \\(\\bigcirc\\)s), further suggesting the dynamic of the replier pushing back at—and perhaps even escalating—the attacker's initial hint of aggression. Among conversations initiated instead by the non-attacker (Figure 2C, 662 conversations), the non-attacker's linguistic behavior in the first comment (\\(\\bigcirc\\)s) is less distinctive from that of initiators in the on-track setting (i.e., log-odds ratios closer to 0); markers of future derailment are (unsurprisingly) more pronounced once the eventual attacker (\\(\\bigtriangledown\\)s) joins the conversation in the second comment.[12]"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    1108,
                    1215,
                    1340
                ],
                "angle": 0,
                "content": "More broadly, these results reveal how different politeness strategies and rhetorical prompts deployed in the initial stages of a conversation are tied to its future trajectory."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1375,
                    935,
                    1434
                ],
                "angle": 0,
                "content": "6 Predicting Future Attacks"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1462,
                    1215,
                    1915
                ],
                "angle": 0,
                "content": "We now show that it is indeed feasible to predict whether a conversation will turn awry based on linguistic properties of its very first exchange, providing several baselines for this new task. In doing so, we demonstrate that the pragmatic devices examined above encode signals about the future trajectory of conversations, capturing some of the intuition humans are shown to have."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1915,
                    1215,
                    2648
                ],
                "angle": 0,
                "content": "We consider the following balanced prediction task: given a pair of conversations, which one will eventually lead to a personal attack? We extract all features from the very first exchange in a conversation—i.e., a comment-reply pair, like those illustrated in our introductory example (Figure 1). We use logistic regression and report accuracies on a leave-one-page-out cross validation, such that in each fold, all conversation pairs from a given talk page are held out as test data and pairs from all other pages are used as training data (thus preventing the use of page-specific information). Prediction results are summarized in Table 3."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2652,
                    1215,
                    2876
                ],
                "angle": 0,
                "content": "Language baselines. As baselines, we consider several straightforward features: word count (which performs at chance level), sentiment lexicon (Liu et al., 2005) and bag of words."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2876,
                    1215,
                    2992
                ],
                "angle": 0,
                "content": "Pragmatic features. Next, we test the predictive power of the prompt types and politeness"
            },
            {
                "block_id": 7,
                "type": "table",
                "bbox": [
                    1272,
                    256,
                    2200,
                    926
                ],
                "angle": 0,
                "content": "<table><tr><td>Feature set</td><td># features</td><td>Accuracy</td></tr><tr><td>Bag of words</td><td>5,000</td><td>56.7%</td></tr><tr><td>Sentiment lexicon</td><td>4</td><td>55.4%</td></tr><tr><td>Politeness strategies</td><td>38</td><td>60.5%</td></tr><tr><td>Prompt types</td><td>12</td><td>59.2%</td></tr><tr><td>Pragmatic (all)</td><td>50</td><td>61.6%</td></tr><tr><td>Interlocutor features</td><td>5</td><td>51.2%</td></tr><tr><td>Trained toxicity</td><td>2</td><td>60.5%</td></tr><tr><td>Toxicity + Pragmatic</td><td>52</td><td>64.9%</td></tr><tr><td>Humans</td><td></td><td>72.0%</td></tr></table>",
                "caption": "Table 3: Accuracies for the balanced future-prediction task. Features based on pragmatic devices are bolded, reference points are italicized."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1213,
                    2195,
                    1557
                ],
                "angle": 0,
                "content": "strategies features introduced in Section 4. The 12 prompt type features (6 features for each comment in the initial exchange) achieve \\(59.2\\%\\) accuracy, and the 38 politeness strategies features (19 per comment) achieve \\(60.5\\%\\) accuracy. The pragmatic features combine to reach \\(61.6\\%\\) accuracy."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1557,
                    2198,
                    2287
                ],
                "angle": 0,
                "content": "Reference points. To better contextualize the performance of our features, we compare their predictive accuracy to the following reference points: Interlocutor features: Certain kinds of interlocutors are potentially more likely to be involved in awry-turning conversations. For example, perhaps newcomers or anonymous participants are more likely to derail interactions than more experienced editors. We consider a set of features representing participants' experience on Wikipedia (i.e., number of edits) and whether the comment authors are anonymous. In our task, these features perform at the level of random chance."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2287,
                    2198,
                    2795
                ],
                "angle": 0,
                "content": "Trained toxicity: We also compare with the toxicity score of the exchange from the Perspective API classifier—a perhaps unfair reference point, since this supervised system was trained on additional human-labeled training examples from the same domain and since it was used to create the very data on which we evaluate. This results in an accuracy of \\(60.5\\%\\); combining trained toxicity with our pragmatic features achieves \\(64.9\\%\\)."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    2795,
                    2198,
                    3195
                ],
                "angle": 0,
                "content": "Humans: A sample of 100 pairs were labeled by (non-author) volunteer human annotators. They were asked to guess, from the initial exchange, which conversation in a pair will lead to a personal attack. Majority vote across three annotators was used to determine the human labels, resulting in an accuracy of \\(72\\%\\). This confirms that humans have"
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    285,
                    3013,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "12 As an interesting avenue for future work, we note that some markers used by non-attacking initiators potentially still anticipate later attacks, suggested by, e.g., the relative prevalence of sentence-initial you \\((p < 0.05, \\bigcirc \\mathrm{s})\\)."
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1357"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1210,
                    547
                ],
                "angle": 0,
                "content": "some intuition about whether a conversation might be heading in a bad direction, which our features can partially capture. In fact, the classifier using pragmatic features is accurate on \\(80\\%\\) of the examples that humans also got right."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    550,
                    1210,
                    1168
                ],
                "angle": 0,
                "content": "Attacks on the horizon. Finally, we seek to understand whether cues extracted from the first exchange can predict future discussion trajectory beyond the immediate next couple of comments. We thus repeat the prediction experiments on the subset of conversations in which the first personal attack happens after the fourth comment (282 pairs), and find that the pragmatic devices used in the first exchange maintain their predictive power (67.4% accuracy), while the sentiment and bag of words baselines drop to the level of random chance."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1175,
                    1215,
                    1459
                ],
                "angle": 0,
                "content": "Overall, these initial results show the feasibility of reconstructing some of the human intuition about the future trajectory of an ostensibly civil conversation in order to predict whether it will eventually turn awry."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1508,
                    1019,
                    1564
                ],
                "angle": 0,
                "content": "7 Conclusions and Future Work"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1606,
                    1215,
                    2392
                ],
                "angle": 0,
                "content": "In this work, we started to examine the intriguing phenomenon of conversational derailment, studying how the use of pragmatic and rhetorical devices relates to future conversational failure. Our investigation centers on the particularly perplexing scenario in which one participant of a civil discussion later attacks another, and explores the new task of predicting whether an initially healthy conversation will derail into such an attack. To this end, we develop a computational framework for analyzing how general politeness strategies and domain-specific rhetorical prompts deployed in the initial stages of a conversation are tied to its future trajectory."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2399,
                    1215,
                    3016
                ],
                "angle": 0,
                "content": "Making use of machine learning and crowdsourcing tools, we formulate a tightly-controlled setting that enables us to meaningfully compare conversations that stay on track with those that go awry. The human accuracy on predicting future attacks in this setting (72%) suggests it is feasible at least at the level of human intuition. We show that our computational framework can recover some of that intuition, hinting at the potential of automated methods to identify signals of the future trajectories of online conversations."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    3023,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "Our approach has several limitations which open avenues for future work. Our correlational analyses do not provide any insights into causal"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2195,
                    1052
                ],
                "angle": 0,
                "content": "mechanisms of derailment, which randomized experiments could address. Additionally, since our procedure for collecting and vetting data focused on precision rather than recall, it might miss more subtle attacks that are overlooked by the toxicity classifier. Supplementing our investigation with other indicators of antisocial behavior, such as editors blocking one another, could enrich the range of attacks we study. Noting that our framework is not specifically tied to Wikipedia, it would also be valuable to explore the varied ways in which this phenomenon arises in other (possibly non-collaborative) public discussion venues, such as Reddit and Facebook Pages."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    1055,
                    2195,
                    1617
                ],
                "angle": 0,
                "content": "While our analysis focused on the very first exchange in a conversation for the sake of generality, more complex modeling could extend its scope to account for conversational features that more comprehensively span the interaction. Beyond the present binary classification task, one could explore a sequential formulation predicting whether the next turn is likely to be an attack as a discussion unfolds, capturing conversational dynamics such as sustained escalation."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    1624,
                    2193,
                    2353
                ],
                "angle": 0,
                "content": "Finally, our study of derailment offers only one glimpse into the space of possible conversational trajectories. Indeed, a manual investigation of conversations whose eventual trajectories were misclassified by our models—as well as by the human annotators—suggests that interactions which initially seem prone to attacks can nonetheless maintain civility, by way of level-headed interlocutors, as well as explicit acts of reparation. A promising line of future work could consider the complementary problem of identifying pragmatic strategies that can help bring uncivil conversations back on track."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    2402,
                    2193,
                    3195
                ],
                "angle": 0,
                "content": "Acknowledgements. We are grateful to the anonymous reviewers for their thoughtful comments and suggestions, and to Maria Antoniak, Valts Blukis, Liye Fu, Sam Havron, Jack Hessel, Ishaan Jhaveri, Lillian Lee, Alex Niculescu-Mizil, Alexandra Schofield, Laure Thompson, Andrew Wang, Leila Zia and the members of the Wikimedia Foundation anti-harassment program for extremely insightful (on-track) conversations and for assisting with data annotation efforts. This work is supported in part by NSF CAREER Award IIS-1750615, NSF Grant SES-1741441, a Google Faculty Award, a WMF gift and a CrowdFlower AI for Everyone Award."
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1358"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    292,
                    263,
                    535,
                    315
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    295,
                    340,
                    1215,
                    526
                ],
                "angle": 0,
                "content": "Yavuz Akbulut, Yusuf Levent Sahin, and Bahadir Eristi. 2010. Cyberbullying victimization among Turkish online social utility members. Journal of Educational Technology & Society."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    295,
                    561,
                    1213,
                    747
                ],
                "angle": 0,
                "content": "Kelsey Allen, Giuseppe Carenini, and Raymond T Ng. 2014. Detecting disagreement in conversations using pseudo-monologic rhetorical structure. In Proceedings of EMNLP."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    295,
                    778,
                    1213,
                    964
                ],
                "angle": 0,
                "content": "Tim Althoff, Cristian Danescu-Niculescu-Mizil, and Dan Jurafsky. 2014. How to ask for a favor: A case study on the success of altruistic requests. In Proceedings of ICWSM."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    295,
                    996,
                    1213,
                    1227
                ],
                "angle": 0,
                "content": "Ofer Arazy, Lisa Yeo, and Oded Nov. 2013. Stay on the Wikipedia task: When task-related disagreements slip into personal and procedural conflicts. Journal of the Association for Information Science and Technology."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    295,
                    1262,
                    1213,
                    1403
                ],
                "angle": 0,
                "content": "Malika Aubakirova and Mohit Bansal. 2016. Interpreting neural networks to improve politeness comprehension. In Proceedings of EMNLP."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    295,
                    1434,
                    1213,
                    1620
                ],
                "angle": 0,
                "content": "Lars Backstrom, Jon Kleinberg, Lillian Lee, and Cristian Danescu-Niculescu-Mizil. 2013. Characterizing and curating conversation threads: Expansion, focus, volume, re-entry. In Proceedings of WSDM."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    295,
                    1655,
                    1213,
                    1796
                ],
                "angle": 0,
                "content": "Penelope Brown and Stephen Levinson. 1987. Politeness: Some universals in language usage. Cambridge University Press."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    295,
                    1827,
                    1213,
                    1967
                ],
                "angle": 0,
                "content": "Moira Burke and Robert Kraut. 2008. Mind your Ps and Qs: The impact of politeness and rudeness in online communities. In Proceedings of CSCW."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    295,
                    1999,
                    1213,
                    2231
                ],
                "angle": 0,
                "content": "Eshwar Chandrasekharan, Umashanthi Pavalanathan, Anirudh Srinivasan, Adam Glynn, Jacob Eisenstein, and Eric Gilbert. 2017. You can't stay here: The efficacy of Reddit's 2015 ban examined through hate speech. In Proceedings of CSCW."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    295,
                    2262,
                    1213,
                    2494
                ],
                "angle": 0,
                "content": "Despoina Chatzakou, Nicolas Kourtellis, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, and Athena Vakali. 2017. Measuring #GamerGate: A tale of hate, sexism, and bullying. In Proceedings of WWW."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    295,
                    2529,
                    1213,
                    2715
                ],
                "angle": 0,
                "content": "Justin Cheng, Michael Bernstein, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2017. Anyone can become a troll: Causes of trolling behavior in online discussions. In Proceedings of CSCW."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    295,
                    2750,
                    1213,
                    2887
                ],
                "angle": 0,
                "content": "Justin Cheng, Cristian Danescu-Niculescu-Mizil, and Jure Leskovec. 2015. Antisocial behavior in online discussion communities. In Proceedings of ICWSM."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    295,
                    2922,
                    1213,
                    3062
                ],
                "angle": 0,
                "content": "Elizabeth F Churchill and Sara Bly. 2000. Culture vultures: Considering culture and communication in virtual environments. SIGGroup Bulletin."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    295,
                    3094,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "Herbert H Clark. 1979. Responding to indirect speech acts. Cognitive psychology."
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    295,
                    340,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2190,
                    364
                ],
                "angle": 0,
                "content": "Herbert H Clark and Dale H Schunk. 1980. Polite responses to polite requests. Cognition."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    399,
                    2190,
                    585
                ],
                "angle": 0,
                "content": "Benjamin Collier and Julia Bear. 2012. Conflict, criticism, or confidence: An empirical examination of the gender gap in Wikipedia contributions. In Proceedings of CSCW."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    627,
                    2190,
                    722
                ],
                "angle": 0,
                "content": "Lewis A Coser. 1956. The Functions of Social Conflict. Routledge."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    757,
                    2190,
                    943
                ],
                "angle": 0,
                "content": "Cristian Danescu-Niculescu-Mizil, Lillian Lee, Bo Pang, and Jon Kleinberg. 2012. Echoes of power: Language effects and power differences in social interaction. In Proceedings of WWW."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    982,
                    2190,
                    1171
                ],
                "angle": 0,
                "content": "Cristian Danescu-Niculescu-Mizil, Moritz Sudhof, Dan Jurafsky, Jure Leskovec, and Christopher Potts. 2013. A computational approach to politeness with application to social factors. In Proceedings of ACL."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1210,
                    2190,
                    1396
                ],
                "angle": 0,
                "content": "Thomas Davidson, Dana Warmsley, Michael Macy, and Ingmar Weber. 2017. Automated hate speech detection and the problem of offensive language. In Proceedings of ICWSM."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1434,
                    2190,
                    1620
                ],
                "angle": 0,
                "content": "Carsten K De Dreu and Laurie R Weingart. 2003. Task versus relationship conflict, team performance, and team member satisfaction: A meta-analysis. Journal of Applied Psychology."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1659,
                    2190,
                    1754
                ],
                "angle": 0,
                "content": "Bruce Fraser. 1980. Conversational mitigation. Journal of Pragmatics."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1792,
                    2190,
                    1975
                ],
                "angle": 0,
                "content": "Liye Fu, Lillian Lee, and Cristian Danescu-Niculescu-Mizil. 2017. When confidence and competence collide: Effects on online decision-making discussions. In Proceedings of WWW."
            },
            {
                "block_id": 25,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2017,
                    2190,
                    2203
                ],
                "angle": 0,
                "content": "Björn Gambäck and Utpal Kumar Sikdar. 2017. Using convolutional neural networks to classify hatespeech. In Proceedings of the Workshop on Abusive Language Online."
            },
            {
                "block_id": 26,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2241,
                    2190,
                    2427
                ],
                "angle": 0,
                "content": "Ali Gheitasy, José Abdelnour-Nocera, and Bonnie Nardi. 2015. Socio-technical gaps in online collaborative consumption (OCC): An example of the Etsy community. In Proceedings of ICDC."
            },
            {
                "block_id": 27,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2466,
                    2190,
                    2560
                ],
                "angle": 0,
                "content": "Erving Goffman. 1955. On face-work: An analysis of ritual elements in social interaction. *Psychiatry*."
            },
            {
                "block_id": 28,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2599,
                    2190,
                    2785
                ],
                "angle": 0,
                "content": "Christophe Henner and Maria Sefidari. 2016. Media Foundation Board on healthy multimedia community culture, inclusivity, and safe spaces. Media Blog."
            },
            {
                "block_id": 29,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2823,
                    2190,
                    3051
                ],
                "angle": 0,
                "content": "Pamela J Hinds and Mark Mortensen. 2005. Understanding conflict in geographically distributed teams: The moderating effects of shared identity, shared context, and spontaneous communication. Organization Science."
            },
            {
                "block_id": 30,
                "type": "ref_text",
                "bbox": [
                    1272,
                    3094,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": "Axel Hübler. 1983. *Understatements and Hedges in English*. John Benjamins Publishing."
            },
            {
                "block_id": 31,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 32,
                "type": "page_number",
                "bbox": [
                    1195,
                    3230,
                    1292,
                    3279
                ],
                "angle": 0,
                "content": "1359"
            }
        ]
    },
    {
        "page_id": 10,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1213,
                    456
                ],
                "angle": 0,
                "content": "Joseph M Kayany. 1998. Contexts of uninhibited online behavior: Flaming in social newsgroups on usenet. Journal of the Association for Information Science and Technology."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    494,
                    1213,
                    680
                ],
                "angle": 0,
                "content": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2009. What's in Wikipedia?: Mapping topics and conflict using socially annotated category structure. In Proceedings of CHI."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    722,
                    1213,
                    866
                ],
                "angle": 0,
                "content": "Aniket Kittur and Robert E Kraut. 2008. Harnessing the wisdom of crowds in Wikipedia: Quality through coordination. In Proceedings of CSCW."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    905,
                    1213,
                    1048
                ],
                "angle": 0,
                "content": "Aniket Kittur, Bongwon Suh, Bryan A Pendleton, and Ed H Chi. 2007. He says, she says: Conflict and coordination in Wikipedia. In Proceedings of CHI."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1087,
                    1213,
                    1273
                ],
                "angle": 0,
                "content": "Vinodh Krishnan and Jacob Eisenstein. 2015. \"You're Mr. Lebowski, I'm the Dude\": Inducing address term formality in signed social networks. In Proceedings of NAACL."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1315,
                    1213,
                    1455
                ],
                "angle": 0,
                "content": "Ravi Kumar, Mohammad Mahdian, and Mary McGlohon. 2010. Dynamics of conversations. In Proceedings of KDD."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1497,
                    1213,
                    1683
                ],
                "angle": 0,
                "content": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring cyberbullying and other toxic behavior in team competition online games. In Proceedings of CHI."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    1725,
                    1213,
                    1866
                ],
                "angle": 0,
                "content": "Robin T Lakoff. 1973. The logic of politeness: Mind- ing your P's and Q's. In Proceedings of the Chicago Linguistic Society."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    1908,
                    1213,
                    2048
                ],
                "angle": 0,
                "content": "Bing Liu, Minqing Hu, and Junsheng Cheng. 2005. Opinion observer: Analyzing and comparing opinions on the web. In Proceedings of WWW."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2090,
                    1213,
                    2231
                ],
                "angle": 0,
                "content": "Vlad Niculae and Cristian Danescu-Niculescu-Mizil. 2016. Conversational markers of constructive discussions. In Proceedings of NAACL."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2273,
                    1213,
                    2459
                ],
                "angle": 0,
                "content": "Vlad Niculae, Srijan Kumar, Jordan Boyd-Graber, and Cristian Danescu-Niculescu-Mizil. 2015. Linguistic harbingers of betrayal: A case study on an online strategy game. In Proceedings of ACL."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    292,
                    2501,
                    1213,
                    2687
                ],
                "angle": 0,
                "content": "Chikashi Nobata, Joel Tetreault, Achint Thomas, Yashar Mehdad, and Yi Chang. 2016. Abusive language detection in online user content. In Proceedings of WWW."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    292,
                    2729,
                    1213,
                    2960
                ],
                "angle": 0,
                "content": "Marco Ortu, Bram Adams, Giuseppe Destefanis, Parastou Tourani, Michele Marchesi, and Roberto Tonelli. 2015. Are bullies more productive? Empirical study of affectiveness vs. issue fixing time. In Proceedings of MSR."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    292,
                    3002,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "John Pavlopoulos, Prodromos Malakasiotis, and Ion Androutsopoulos. 2017a. Deep learning for user comment moderation. In Proceedings of the Workshop on Abusive Language Online."
            },
            {
                "block_id": 14,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2193,
                    452
                ],
                "angle": 0,
                "content": "John Pavlopoulos, Prodromos Malakasiotis, and Ion Androutsopoulos. 2017b. Deeper attention to abusive user content moderation. In Proceedings of EMNLP."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    494,
                    2190,
                    634
                ],
                "angle": 0,
                "content": "Alan Ritter, Colin Cherry, and Bill Dolan. 2010. Unsupervised modeling of Twitter conversations. In Proceedings of NAACL."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    673,
                    2190,
                    768
                ],
                "angle": 0,
                "content": "Paul R Rosenbaum. 2010. Design of observational studies. Springer."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    806,
                    2190,
                    985
                ],
                "angle": 0,
                "content": "Donald B Rubin. 2007. The design versus the analysis of observational studies for causal effects: Parallels with the design of randomized trials. *Statistics in Medicine*."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1031,
                    2190,
                    1171
                ],
                "angle": 0,
                "content": "Tamara Shepherd, Alison Harvey, Tim Jordan, Sam Srauy, and Kate Miltner. 2015. Histories of hating. Social Media + Society."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1210,
                    2190,
                    1396
                ],
                "angle": 0,
                "content": "Vivek K Singh, Marie L Radford, Qianjia Huang, and Susan Furrer. 2017. \"They basically like destroyed the school one day\": On newer app features and cyberbullying in schools. In Proceedings of CSCW."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1434,
                    2190,
                    1620
                ],
                "angle": 0,
                "content": "Sara Owsley Sood, Elizabeth F Churchill, and Judd Antin. 2012. Automatic identification of personal insults on social news sites. Journal of the American Society for Information Science and Technology."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1659,
                    2190,
                    1890
                ],
                "angle": 0,
                "content": "Chenhao Tan, Vlad Niculae, Cristian Danescu-Niculescu-Mizil, and Lillian Lee. 2016. Winning arguments: Interaction dynamics and persuasion strategies in good-faith online discussions. In Proceedings of WWW."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1929,
                    2190,
                    2115
                ],
                "angle": 0,
                "content": "Yla R Tausczik and James W Pennebaker. 2010. The psychological meaning of words: LIWC and computerized text analysis methods. Journal of Language and Social Psychology."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2153,
                    2190,
                    2294
                ],
                "angle": 0,
                "content": "Kal Turnbull. 2018. \"That's Bullshit\" - Rude Enough for Removal? A Multi-Mod Perspective. Change My View Blog."
            },
            {
                "block_id": 25,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2332,
                    2193,
                    2560
                ],
                "angle": 0,
                "content": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying women's experiences with and strategies for mitigating negative effects of online harassment. In Proceedings of CSCW."
            },
            {
                "block_id": 26,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2602,
                    2190,
                    2743
                ],
                "angle": 0,
                "content": "Lu Wang and Claire Cardie. 2014. A piece of my mind: A sentiment analysis approach for online dispute detection. In Proceedings of ACL."
            },
            {
                "block_id": 27,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2781,
                    2190,
                    2922
                ],
                "angle": 0,
                "content": "William Warner and Julia Hirschberg. 2012. Detecting hate speech on the World Wide Web. In Proceedings of the Workshop on Language in Social Media."
            },
            {
                "block_id": 28,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2960,
                    2190,
                    3055
                ],
                "angle": 0,
                "content": "Wikipedia Support and Safety Team. 2015. Harassment survey. Wikipedia Foundation."
            },
            {
                "block_id": 29,
                "type": "ref_text",
                "bbox": [
                    1272,
                    3094,
                    2190,
                    3188
                ],
                "angle": 0,
                "content": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2016. Wikipedia talk labels: Toxicity."
            },
            {
                "block_id": 30,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2193,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 31,
                "type": "page_number",
                "bbox": [
                    1198,
                    3234,
                    1292,
                    3276
                ],
                "angle": 0,
                "content": "1360"
            }
        ]
    },
    {
        "page_id": 11,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1210,
                    406
                ],
                "angle": 0,
                "content": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex machina: Personal attacks seen at scale. In Proceedings of WWW."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    442,
                    1210,
                    627
                ],
                "angle": 0,
                "content": "Naomi Yamashita and Toru Ishida. 2006. Automatic prediction of misconceptions in multilingual computer-mediated communication. In Proceedings of IUI."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    663,
                    1210,
                    891
                ],
                "angle": 0,
                "content": "Dawei Yin, Zhenzhen Xue, Liangjie Hong, Brian D Davison, April Kontostathis, and Lynne Edwards. 2009. Detection of harassment on Web 2.0. In Proceedings of the Workshop on Content Analysis in the Web 2.0."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    929,
                    1210,
                    1108
                ],
                "angle": 0,
                "content": "Amy X Zhang, Bryan Culbertson, and Praveen Paritosh. 2017a. Characterizing online discussion using coarse discourse sequences. In Proceedings of ICWSM."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1147,
                    1210,
                    1333
                ],
                "angle": 0,
                "content": "Justine Zhang, Ravi Kumar, Sujith Ravi, and Cristian Danescu-Niculescu-Mizil. 2016. Conversational flow in Oxford-style debates. In Proceedings of NAACL."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1368,
                    1210,
                    1554
                ],
                "angle": 0,
                "content": "Justine Zhang, Arthur Spirling, and Cristian Danescu-Niculescu-Mizil. 2017b. Asking too much? The rhetorical role of questions in political discourse. In Proceedings of EMNLP."
            },
            {
                "block_id": 6,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1210,
                    1554
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 7,
                "type": "page_number",
                "bbox": [
                    1198,
                    3234,
                    1285,
                    3276
                ],
                "angle": 0,
                "content": "1361"
            }
        ]
    }
]