[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    396,
                    280,
                    2091,
                    417
                ],
                "angle": 0,
                "content": "DSGAN: Generative Adversarial Training for Distant Supervision Relation Extraction"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    736,
                    494,
                    1759,
                    557
                ],
                "angle": 0,
                "content": "Pengda Qin#, Weiran Xu#, William Yang Wang"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    640,
                    557,
                    1860,
                    613
                ],
                "angle": 0,
                "content": "\\(^{\\#}\\)Beijing University of Posts and Telecommunications, China"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    781,
                    617,
                    1716,
                    673
                ],
                "angle": 0,
                "content": "<sup>b</sup>University of California, Santa Barbara, USA"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    759,
                    677,
                    1741,
                    736
                ],
                "angle": 0,
                "content": "{qinpengda, xuweiran}@bupt.edu.cn"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    940,
                    736,
                    1563,
                    792
                ],
                "angle": 0,
                "content": "{william}@cs.ucsb.edu"
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    652,
                    926,
                    850,
                    978
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    354,
                    1027,
                    1143,
                    2602
                ],
                "angle": 0,
                "content": "Distant supervision can effectively label data for relation extraction, but suffers from the noise labeling problem. Recent works mainly perform soft bag-level noise reduction strategies to find the relatively better samples in a sentence bag, which is suboptimal compared with making a hard decision of false positive samples in sentence level. In this paper, we introduce an adversarial learning framework, which we named DSGAN, to learn a sentence-level true-positive generator. Inspired by Generative Adversarial Networks, we regard the positive samples generated by the generator as the negative samples to train the discriminator. The optimal generator is obtained until the discrimination ability of the discriminator has the greatest decline. We adopt the generator to filter distant supervision training dataset and redistribute the false positive instances into the negative set, in which way to provide a cleaned dataset for relation classification. The experimental results show that the proposed strategy significantly improves the performance of distant supervision relation extraction comparing to state-of-the-art systems."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    290,
                    2652,
                    650,
                    2701
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2739,
                    1218,
                    3192
                ],
                "angle": 0,
                "content": "Relation extraction is a crucial task in the field of natural language processing (NLP). It has a wide range of applications including information retrieval, question answering, and knowledge base completion. The goal of relation extraction system is to predict relation between entity pair in a sentence (Zelenko et al., 2003; Bunescu and Mooney, 2005; GuoDong et al., 2005). For exam-"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1322,
                    1076,
                    1582,
                    1108
                ],
                "angle": 0,
                "content": "DS true positive data"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1324,
                    1119,
                    1582,
                    1147
                ],
                "angle": 0,
                "content": "A DS false positive data"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1324,
                    1164,
                    1540,
                    1196
                ],
                "angle": 0,
                "content": "X DS negative data"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1324,
                    1210,
                    1595,
                    1273
                ],
                "angle": 0,
                "content": "The decision boundary of DS data"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1302,
                    1287,
                    1575,
                    1343
                ],
                "angle": 0,
                "content": "The desired decision boundary"
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    1302,
                    1076,
                    1595,
                    1343
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 17,
                "type": "image",
                "bbox": [
                    1632,
                    975,
                    2208,
                    1501
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: Illustration of the distant supervision training data distribution for one relation type."
            },
            {
                "block_id": 19,
                "type": "text",
                "bbox": [
                    1265,
                    1775,
                    2193,
                    1999
                ],
                "angle": 0,
                "content": "ple, given a sentence “The \\(\\left[\\mathit{owl}\\right]_{e1}\\) held the mouse in its \\(\\left[\\mathit{claw}\\right]_{e2}\\).”, a relation classifier should figure out the relation Component-Whole between entity owl and claw."
            },
            {
                "block_id": 20,
                "type": "text",
                "bbox": [
                    1265,
                    2006,
                    2195,
                    3195
                ],
                "angle": 0,
                "content": "With the infinite amount of facts in real world, it is extremely expensive, and almost impossible for human annotators to annotate training dataset to meet the needs of all walks of life. This problem has received increasingly attention. Few-shot learning and Zero-shot Learning (Xian et al., 2017) try to predict the unseen classes with few labeled data or even without labeled data. Differently, distant supervision (Mintz et al., 2009; Hoffmann et al., 2011; Surdeanu et al., 2012) is to efficiently generate relational data from plain text for unseen relations with distant supervision (DS). However, it naturally brings with some defects: the resulted distantly-supervised training samples are often very noisy (shown in Figure 1), which is the main problem of impeding the performance (Roth et al., 2013). Most of the current state-of-the-art methods (Zeng et al., 2015; Lin et al., 2016) make the denoising operation in the sentence bag of entity pair, and integrate this process into the distant supervision relation ex"
            },
            {
                "block_id": 21,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1285,
                    3279
                ],
                "angle": 0,
                "content": "496"
            },
            {
                "block_id": 22,
                "type": "footer",
                "bbox": [
                    327,
                    3301,
                    2151,
                    3399
                ],
                "angle": 0,
                "content": "Proceedings of the 56th Annual Meeting of the Association for Computational Linguistics (Long Papers), pages 496-505 Melbourne, Australia, July 15 - 20, 2018. ©2018 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1210,
                    712
                ],
                "angle": 0,
                "content": "traction. Indeed, these methods can filter a substantial number of noise samples; However, they overlook the case that all sentences of an entity pair are false positive, which is also the common phenomenon in distant supervision datasets. Under this consideration, an independent and accurate sentence-level noise reduction strategy is the better choice."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    715,
                    1215,
                    2290
                ],
                "angle": 0,
                "content": "In this paper, we design an adversarial learning process (Goodfellow et al., 2014; Radford et al., 2015) to obtain a sentence-level generator that can recognize the true positive samples from the noisy distant supervision dataset without any supervised information. In Figure 1, the existence of false positive samples makes the DS decision boundary suboptimal, therefore hinders the performance of relation extraction. However, in terms of quantity, the true positive samples still occupy most of the proportion; this is the prerequisite of our method. Given the discriminator that possesses the decision boundary of DS dataset (the brown decision boundary in Figure 1), the generator tries to generate true positive samples from DS positive dataset; Then, we assign the generated samples with negative label and the rest samples with positive label to challenge the discriminator. Under this adversarial setting, if the generated sample set includes more true positive samples and more false positive samples are left in the rest set, the classification ability of the discriminator will drop faster. Empirically, we show that our method has brought consistent performance gains in various deep-neural-network-based models, achieving strong performances on the widely used New York Times dataset (Riedel et al., 2010). Our contributions are three-fold:"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    337,
                    2339,
                    1205,
                    2501
                ],
                "angle": 0,
                "content": "- We are the first to consider adversarial learning to denoise the distant supervision relation extraction dataset."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    337,
                    2550,
                    1205,
                    2711
                ],
                "angle": 0,
                "content": "- Our method is sentence-level and model-agnostic, so it can be used as a plug-and-play technique for any relation extractors."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    337,
                    2760,
                    1205,
                    3027
                ],
                "angle": 0,
                "content": "- We show that our method can generate a cleaned dataset without any supervised information, in which way to boost the performance of recently proposed neural relation extractors."
            },
            {
                "block_id": 5,
                "type": "list",
                "bbox": [
                    337,
                    2339,
                    1205,
                    3027
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    287,
                    3080,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "In Section 2, we outline some related works on distant supervision relation extraction. Next, we"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2190,
                    487
                ],
                "angle": 0,
                "content": "describe our adversarial learning strategy in Section 3. In Section 4, we show the stability analyses of DSGAN and the empirical evaluation results. And finally, we conclude in Section 5."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    1267,
                    575,
                    1654,
                    627
                ],
                "angle": 0,
                "content": "2 Related Work"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    694,
                    2193,
                    1368
                ],
                "angle": 0,
                "content": "To address the above-mentioned data sparsity issue, Mintz et al. (2009) first align unlabeled text corpus with Freebase by distant supervision. However, distant supervision inevitably suffers from the wrong labeling problem. Instead of explicitly removing noisy instances, the early works intend to suppress the noise. Riedel et al. (2010) adopt multi-instance single-label learning in relation extraction; Hoffmann et al. (2011) and Surdeanu et al. (2012) model distant supervision relation extraction as a multi-instance multi-label problem."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1385,
                    2193,
                    3195
                ],
                "angle": 0,
                "content": "Recently, some deep-learning-based models (Zeng et al., 2014; Shen and Huang, 2016) have been proposed to solve relation extraction. Naturally, some works try to alleviate the wrong labeling problem with deep learning technique, and their denoising process is integrated into relation extraction. Zeng et al. (2015) select one most plausible sentence to represent the relation between entity pairs, which inevitably misses some valuable information. Lin et al. (2016) calculate a series of soft attention weights for all sentences of one entity pair and the incorrect sentences can be down-weighted; Base on the same idea, Ji et al. (2017) bring the useful entity information into the calculation of the attention weights. However, compared to these soft attention weight assignment strategies, recognizing the true positive samples from distant supervision dataset before relation extraction is a better choice. Takamatsu et al. (2012) build a noise-filtering strategy based on the linguistic features extracted from many NLP tools, including NER and dependency tree, which inevitably suffers the error propagation problem; while we just utilize word embedding as the input information. In this work, we learn a true-positive identifier (the generator) which is independent of the relation prediction of entity pairs, so it can be directly applied on top of any existing relation extraction classifiers. Then, we redistribute the false positive samples into the negative set, in which way to make full use of the distantly labeled resources."
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1205,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "497"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    287,
                    263,
                    1081,
                    378
                ],
                "angle": 0,
                "content": "3 Adversarial Learning for Distant Supervision"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    413,
                    1215,
                    1375
                ],
                "angle": 0,
                "content": "In this section, we introduce an adversarial learning pipeline to obtain a robust generator which can automatically discover the true positive samples from the noisy distantly-supervised dataset without any supervised information. The overview of our adversarial learning process is shown in Figure 2. Given a set of distantly-labeled sentences, the generator tries to generate true positive samples from it; But, these generated samples are regarded as negative samples to train the discriminator. Thus, when finishing scanning the DS positive dataset one time, the more true positive samples that the generator discovers, the sharper drop of performance the discriminator obtains. After adversarial training, we hope to obtain a robust generator that is capable of forcing discriminator into maximumly losing its classification ability."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1378,
                    1215,
                    1775
                ],
                "angle": 0,
                "content": "In the following section, we describe the adversarial training pipeline between the generator and the discriminator, including the pre-training strategy, objective functions and gradient calculation. Because the generator involves a discrete sampling step, we introduce a policy gradient method to calculate gradients for the generator."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1817,
                    833,
                    1873
                ],
                "angle": 0,
                "content": "3.1 Pre-Training Strategy"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1894,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "Both the generator and the discriminator require the pre-training process, which is the common setting for GANs (Cai and Wang, 2017; Wang et al., 2017). With the better initial parameters, the adversarial learning is prone to convergence. As presented in Figure 2, the discriminator is pre-trained with DS positive dataset \\( P \\) (label 1) and DS negative set \\( N^D \\) (label 0). After our adversarial learning process, we desire a strong generator that can, to the maximum extent, collapse the discriminator. Therefore, the more robust generator can be obtained via competing with the more robust discriminator. So we pre-train the discriminator until the accuracy reaches \\( 90\\% \\) or more. The pretraining of generator is similar to the discriminator; however, for the negative dataset, we use another completely different dataset \\( N^G \\), which makes sure the robustness of the experiment. Specifically, we let the generator overfits the DS positive dataset \\( P \\). The reason of this setting is that we hope the generator wrongly give high probabilities to all of the noisy DS positive samples at the beginning of the training process. Then, along"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2195,
                    434
                ],
                "angle": 0,
                "content": "with our adversarial learning, the generator learns to gradually decrease the probabilities of the false positive samples."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    1267,
                    466,
                    2163,
                    575
                ],
                "angle": 0,
                "content": "3.2 Generative Adversarial Training for Distant Supervision Relation Extraction"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1262,
                    596,
                    2195,
                    1213
                ],
                "angle": 0,
                "content": "The generator and the discriminator of DSGAN are both modeled by simple CNN, because CNN performs well in understanding sentence (Zeng et al., 2014), and it has less parameters than RNN-based networks. For relation extraction, the input information consists of the sentences and entity pairs; thus, as the common setting (Zeng et al., 2014; Nguyen and Grishman, 2015), we use both word embedding and position embedding to convert input instances into continuous real-valued vectors."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1262,
                    1220,
                    2195,
                    2627
                ],
                "angle": 0,
                "content": "What we desire the generator to do is to accurately recognize true positive samples. Unlike the generator applied in computer vision field (Im et al., 2016) that generates new image from the input noise, our generator just needs to discover true positive samples from the noisy DS positive dataset. Thus, it is to realize the \"sampling from a probability distribution\" process of the discrete GANs (Figure 2). For a input sentence \\( s_j \\), we define the probability of being true positive sample by generator as \\( p_G(s_j) \\). Similarly, for discriminator, the probability of being true positive sample is represented as \\( p_D(s_j) \\). We define that one epoch means that one time scanning of the entire DS positive dataset. In order to obtain more feedbacks and make the training process more efficient, we split the DS positive dataset \\( P = \\{s_1, s_2, \\ldots, s_j, \\ldots\\} \\) into \\( N \\) bags \\( B = \\{B^1, B^2, \\ldots, B^N\\} \\), and the network parameters \\( \\theta_G, \\theta_D \\) are updated when finishing processing one bag \\( B_i \\). Based on the notion of adversarial learning, we define the objectives of the generator and the discriminator as follow, and they are alternatively trained towards their respective objectives."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    2655,
                    2193,
                    2936
                ],
                "angle": 0,
                "content": "Generator Suppose that the generator produces a set of probability distribution \\(\\{p_G(s_j)\\}_{j=1\\ldots|B_i}^{}\\) for a sentence bag \\(B_i\\). Based on these probabilities, a set of sentence are sampled and we denote this set as \\(T\\)."
            },
            {
                "block_id": 10,
                "type": "equation",
                "bbox": [
                    1324,
                    3016,
                    2193,
                    3080
                ],
                "angle": 0,
                "content": "\\[\nT = \\{s _ {j} \\}, s _ {j} \\sim p _ {G} (s _ {j}), j = 1, 2, \\dots , | B _ {i} | \\quad (1)\n\\]"
            },
            {
                "block_id": 11,
                "type": "page_footnote",
                "bbox": [
                    1267,
                    3101,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "The bag here has the different definition from the sentence bag of an entity pair mentioned in the Section 1."
            },
            {
                "block_id": 12,
                "type": "page_number",
                "bbox": [
                    1203,
                    3234,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "498"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    300,
                    263,
                    2195,
                    1105
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: An overview of the DSGAN training pipeline. The generator (denoted by \\(\\mathbf{G}\\)) calculates the probability distribution over a bag of DS positive samples, and then samples according to this probability distribution. The high-confidence samples generated by \\(\\mathbf{G}\\) are regarded as true positive samples. The discriminator (denoted by \\(\\mathbf{D}\\)) receives these high-confidence samples but regards them as negative samples; conversely, the low-confidence samples are still treated as positive samples. For the generated samples, \\(\\mathbf{G}\\) maximizes the probability of being true positive; on the contrary, \\(\\mathbf{D}\\) minimizes this probability."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1673,
                    1215,
                    2125
                ],
                "angle": 0,
                "content": "This generated dataset \\( T \\) consists of the high-confidence sentences, and is regard as true positive samples by the current generator; however, it will be treated as the negative samples to train the discriminator. In order to challenge the discriminator, the objective of the generator can be formulated as maximizing the following probabilities of the generated dataset \\( T \\):"
            },
            {
                "block_id": 3,
                "type": "equation",
                "bbox": [
                    540,
                    2167,
                    1213,
                    2294
                ],
                "angle": 0,
                "content": "\\[\nL _ {G} = \\sum_ {s _ {j} \\in T} \\log p _ {D} (s _ {j}) \\qquad (2)\n\\]"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2311,
                    1213,
                    2767
                ],
                "angle": 0,
                "content": "Because \\( L_{G} \\) involves a discrete sampling step, so it cannot be directly optimized by gradient-based algorithm. We adopt a common approach: the policy-gradient-based reinforcement learning. The following section will give the detailed introduction of the setting of reinforcement learning. The parameters of the generator are continually updated until reaching the convergence condition."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2795,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": "Discriminator After the generator has generated the sample subset \\( T \\), the discriminator treats them as the negative samples; conversely, the rest part \\( F = B_{i} - T \\) is treated as positive samples. So, the objective of the discriminator can be formulated as minimizing the following cross-entropy loss function:"
            },
            {
                "block_id": 6,
                "type": "equation",
                "bbox": [
                    1431,
                    1743,
                    2193,
                    2006
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} L _ {D} = - \\left(\\sum_ {s _ {j} \\in \\left(B _ {i} - T\\right)} \\log p _ {D} \\left(s _ {j}\\right) \\right. \\tag {3} \\\\ + \\sum_ {s _ {j} \\in T} \\log (1 - p _ {D} (s _ {j}))) \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1262,
                    2059,
                    2193,
                    2283
                ],
                "angle": 0,
                "content": "The update of discriminator is identical to the common binary classification problem. Naturally, it can be simply optimized by any gradient-based algorithm."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1262,
                    2290,
                    2195,
                    3195
                ],
                "angle": 0,
                "content": "What needs to be explained is that, unlike the common setting of discriminator in previous works, our discriminator loads the same pretrained parameter set at the beginning of each epoch as shown in Figure 2. There are two reasons. First, at the end of our adversarial training, what we need is a robust generator rather than a discriminator. Second, our generator is to sample data rather than generate new data from scratch; Therefore, the discriminator is relatively easy to be collapsed. So we design this new adversarial strategy: the robustest generator is yielded when the discriminator has the largest drop of performance in one epoch. In order to create the equal condition, the bag set \\( B \\) for each epoch is identical, including the sequence and the sentences in each"
            },
            {
                "block_id": 9,
                "type": "page_number",
                "bbox": [
                    1203,
                    3234,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "499"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "code_caption",
                "bbox": [
                    290,
                    263,
                    984,
                    315
                ],
                "angle": 0,
                "content": "Algorithm 1 The DSGAN algorithm."
            },
            {
                "block_id": 1,
                "type": "algorithm",
                "bbox": [
                    287,
                    322,
                    2193,
                    1589
                ],
                "angle": 0,
                "content": "Data: DS positive set \\(P\\), DS negative set \\(N^G\\) for generator G, DS negative set \\(N^D\\) for discriminator D  \nInput: Pre-trained G with parameters \\(\\theta_G\\) on dataset \\((P, N^G)\\); Pre-trained D with parameters \\(\\theta_D\\) on dataset \\((P, N^D)\\)  \nOutput: Adversarially trained generator G  \n1: Load parameters \\(\\theta_G\\) for G  \n2: Split \\(P\\) into the bag sequence \\(P = \\{B^1, B^2, \\dots, B^i, \\dots, B^N\\}\\)  \n3: repeat  \n4: Load parameters \\(\\theta_D\\) for D  \n5: \\(G_G \\gets 0, G_D \\gets 0\\)  \n6: for \\(B_i \\in P, i = 1\\) to \\(N\\) do  \n7: Compute the probability \\(p_G(s_j)\\) for each sentence \\(s_j\\) in \\(B_i\\)  \n8: Obtain the generated part \\(T\\) by sampling according to \\(\\{p_G(s_j)\\}_{j=1\\dots|B}\\) and the rest set \\(F = B_i - T\\)  \n9: \\(G_D \\gets -\\frac{1}{|P|} \\{\\nabla_{\\theta_D} \\sum^T \\log(1 - p_D(s_j)) + \\nabla_{\\theta_D} \\sum^F \\log p_D(s_j)\\}\\)  \n10: \\(\\theta_D \\gets \\theta_D - \\alpha_D G_D\\)  \n11: Calculate the reward \\(r\\)  \n12: \\(G_G \\gets \\frac{1}{|T|} \\sum^T r \\nabla_{\\theta_G} \\log p_G(s_j)\\)  \n13: \\(\\theta_G \\gets \\theta_G + \\alpha_G G_G\\)  \n14: end for  \n15: Compute the accuracy \\(ACCD\\) on \\(N^D\\) with the current \\(\\theta_D\\)  \n16: until \\(ACCD\\) no longer drops  \n17: Save \\(\\theta_G\\)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    287,
                    1669,
                    441,
                    1725
                ],
                "angle": 0,
                "content": "bag \\(B_{i}\\)"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1757,
                    1215,
                    2378
                ],
                "angle": 0,
                "content": "Optimizing Generator The objective of the generator is similar to the objective of the one-step reinforcement learning problem: Maximizing the expectation of a given function of samples from a parametrized probability distribution. Therefore, we use a policy gradient strategy to update the generator. Corresponding to the terminology of reinforcement learning, \\( s_j \\) is the state and \\( P_G(s_j) \\) is the policy. In order to better reflect the quality of the generator, we define the reward \\( r \\) from two angles:"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    337,
                    2424,
                    1215,
                    2757
                ],
                "angle": 0,
                "content": "- As the common setting in adversarial learning, for the generated sample set, we hope the confidence of being positive samples by the discriminator becomes higher. Therefore, the first component of our reward is formulated as below:"
            },
            {
                "block_id": 5,
                "type": "equation",
                "bbox": [
                    543,
                    2820,
                    1213,
                    2957
                ],
                "angle": 0,
                "content": "\\[\nr _ {1} = \\frac {1}{| T |} \\sum_ {s _ {j} \\in T} p _ {D} \\left(s _ {j}\\right) - b _ {1} \\tag {4}\n\\]"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    374,
                    2985,
                    1213,
                    3094
                ],
                "angle": 0,
                "content": "the function of \\( b_{1} \\) is to reduce variance during reinforcement learning."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    337,
                    3136,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": "- The second component is from the average"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1359,
                    1666,
                    1915,
                    1725
                ],
                "angle": 0,
                "content": "prediction probability of \\(N^D\\),"
            },
            {
                "block_id": 9,
                "type": "equation",
                "bbox": [
                    1540,
                    1743,
                    2193,
                    1883
                ],
                "angle": 0,
                "content": "\\[\n\\tilde {p} = \\frac {1}{| N ^ {D} |} \\sum_ {s _ {j} \\in N ^ {D}} p _ {D} (s _ {j}) \\tag {5}\n\\]"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1357,
                    1911,
                    2195,
                    2420
                ],
                "angle": 0,
                "content": "\\(N^D\\) participates the pre-training process of the discriminator, but not the adversarial training process. When the classification capacity of discriminator declines, the accuracy of being predicted as negative sample on \\(N^D\\) gradually drops; thus, \\(\\tilde{p}\\) increases. In other words, the generator becomes better. Therefore, for epoch \\(k\\), after processing the bag \\(B_i\\), reward \\(r_2\\) is calculated as below,"
            },
            {
                "block_id": 11,
                "type": "equation",
                "bbox": [
                    1632,
                    2508,
                    1937,
                    2578
                ],
                "angle": 0,
                "content": "\\[\nr _ {2} = \\eta (\\tilde {p} _ {i} ^ {k} - b _ {2})\n\\]"
            },
            {
                "block_id": 12,
                "type": "equation",
                "bbox": [
                    1406,
                    2585,
                    2093,
                    2638
                ],
                "angle": 0,
                "content": "\\[\nw h e r e b _ {2} = \\max  \\{\\tilde {p} _ {i} ^ {m} \\}, m = 1 \\dots , k - 1\n\\]"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1359,
                    2662,
                    1927,
                    2718
                ],
                "angle": 0,
                "content": "\\(b_{2}\\) has the same function as \\(b_{1}\\)."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1314,
                    2746,
                    2188,
                    2799
                ],
                "angle": 0,
                "content": "The gradient of \\( L_{G} \\) can be formulated as below:"
            },
            {
                "block_id": 15,
                "type": "equation",
                "bbox": [
                    1317,
                    2869,
                    2195,
                    3195
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} \\nabla_ {\\theta_ {D}} L _ {G} = \\sum_ {s _ {j} \\in B _ {i}} \\mathbb {E} _ {s _ {j} \\sim p _ {G} (s _ {j})} r \\nabla_ {\\theta_ {G}} \\log p _ {G} (s _ {j}) \\\\ = \\frac {1}{| T |} \\sum_ {s _ {j} \\in T} r \\nabla_ {\\theta_ {G}} \\log p _ {G} (s _ {j}) \\tag {7} \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "500"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    287,
                    263,
                    1168,
                    319
                ],
                "angle": 0,
                "content": "3.3 Cleaning Noisy Dataset with Generator"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    340,
                    1215,
                    1182
                ],
                "angle": 0,
                "content": "After our adversarial learning process, we obtain one generator for one relation type; These generators possess the capability of generating true positive samples for the corresponding relation type. Thus, we can adopt the generator to filter the noise samples from distant supervision dataset. Simply and clearly, we utilize the generator as a binary classifier. In order to reach the maximum utilization of data, we develop a strategy: for an entity pair with a set of annotated sentences, if all of these sentences are determined as false negative by our generator, this entity pair will be redistributed into the negative set. Under this strategy, the scale of distant supervision training set keeps unchanged."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    287,
                    1224,
                    650,
                    1280
                ],
                "angle": 0,
                "content": "4 Experiments"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1311,
                    1215,
                    2322
                ],
                "angle": 0,
                "content": "This paper proposes an adversarial learning strategy to detect true positive samples from the noisy distant supervision dataset. Due to the absence of supervised information, we define a generator to heuristically learn to recognize true positive samples through competing with a discriminator. Therefore, our experiments are intended to demonstrate that our DSGAN method possess this capability. To this end, we first briefly introduce the dataset and the evaluation metrics. Empirically, the adversarial learning process, to some extent, has instability; Therefore, we next illustrate the convergence of our adversarial training process. Finally, we demonstrate the efficiency of our generator from two angles: the quality of the generated samples and the performance on the widely-used distant supervision relation extraction task."
            },
            {
                "block_id": 4,
                "type": "title",
                "bbox": [
                    287,
                    2364,
                    1168,
                    2417
                ],
                "angle": 0,
                "content": "4.1 Evaluation and Implementation Details"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2434,
                    1215,
                    3115
                ],
                "angle": 0,
                "content": "The Reidel dataset\\(^2\\) (Riedel et al., 2010) is a commonly-used distant supervision relation extraction dataset. Freebase is a huge knowledge base including billions of triples: the entity pair and the specific relationship between them. Given these triples, the sentences of each entity pair are selected from the New York Times corpus(NYT). Entity mentions of NYT corpus are recognized by the Stanford named entity recognizer (Finkel et al., 2005). There are 52 actual relationships and a special relation \\(NA\\) which indicates there is no relation between head and tail entities. Entity pairs of"
            },
            {
                "block_id": 6,
                "type": "table",
                "bbox": [
                    1272,
                    256,
                    2190,
                    568
                ],
                "angle": 0,
                "content": "<table><tr><td>Hyperparameter</td><td>Value</td></tr><tr><td>CNN Window cw, kernel size ck</td><td>3, 100</td></tr><tr><td>Word embedding de, |V|</td><td>50, 114042</td></tr><tr><td>Position embedding dp</td><td>5</td></tr><tr><td>Learning rate of G, D</td><td>1e-5, 1e-4</td></tr></table>",
                "caption": "Table 1: Hyperparameter settings of the generator and the discriminator."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    806,
                    2193,
                    968
                ],
                "angle": 0,
                "content": "\\(NA\\) are defined as the entity pairs that appear in the same sentence but are not related according to Freebase."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1262,
                    975,
                    2195,
                    2160
                ],
                "angle": 0,
                "content": "Due to the absence of the corresponding labeled dataset, there is not a ground-truth test dataset to evaluate the performance of distant supervision relation extraction system. Under this circumstance, the previous work adopt the held-out evaluation to evaluate their systems, which can provide an approximate measure of precision without requiring costly human evaluation. It builds a test set where entity pairs are also extracted from Freebase. Similarly, relation facts that discovered from test articles are automatically compared with those in Freebase. CNN is widely used in relation classification (Santos et al., 2015; Qin et al., 2017), thus the generator and the discriminator are both modeled as a simple CNN with the window size \\( c_{w} \\) and the kernel size \\( c_{k} \\). Word embedding is directly from the released word embedding matrix by Lin et al. (2016)<sup>3</sup>. Position embedding has the same setting with the previous works: the maximum distance of -30 and 30. Some detailed hyperparameter settings are displayed in Table 1."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1265,
                    2196,
                    1932,
                    2248
                ],
                "angle": 0,
                "content": "4.2 Training Process of DSGAN"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    2269,
                    2193,
                    3115
                ],
                "angle": 0,
                "content": "Because adversarial learning is widely regarded as an effective but unstable technique, here we illustrate some property changes during the training process, in which way to indicate the learning trend of our proposed approach. We use 3 relation types as the examples: /business/person/company, /people/person/place_lived and /location/neighborhood/neighborhood_of. Because they are from three major classes (bussiness, people, location) of Reidel dataset and they all have enough distant-supervised instances. The first row in Figure 3 shows the classification ability change of the discriminator during training. The accuracy is calculated from the negative set \\( N^{D} \\). At the beginning of adversarial learning, the"
            },
            {
                "block_id": 12,
                "type": "page_footnote",
                "bbox": [
                    342,
                    3139,
                    908,
                    3188
                ],
                "angle": 0,
                "content": "\\(^{2}\\)http://iesl.cs.umass.edu/riedel/ecml/"
            },
            {
                "block_id": 13,
                "type": "page_footnote",
                "bbox": [
                    1319,
                    3139,
                    1813,
                    3188
                ],
                "angle": 0,
                "content": "\\(^{3}\\)https://github.com/thunlp/NRE"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1275,
                    3279
                ],
                "angle": 0,
                "content": "501"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    300,
                    252,
                    913,
                    736
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 1,
                "type": "image",
                "bbox": [
                    925,
                    252,
                    1530,
                    743
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1538,
                    259,
                    2148,
                    743
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 3,
                "type": "image",
                "bbox": [
                    307,
                    750,
                    913,
                    1203
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    925,
                    750,
                    1543,
                    1210
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 5,
                "type": "image",
                "bbox": [
                    1548,
                    750,
                    2138,
                    1210
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 3: The convergence of the DSGAN training process for 3 relation types and the performance of their corresponding generators. The figures in the first row present the performance change on \\( N^D \\) in some specific epochs during processing the \\( B = \\{B^1, B^2, \\ldots, B^N\\} \\). Each curve stands for one epoch; The color of curves become darker as long as the epoch goes on. Because the discriminator reloads the pre-trained parameters at the beginning of each epoch, all curves start from the same point for each relation type; Along with the adversarial training, the generator gradually collapses the discriminator. The figures in the second row reflect the performance of generators from the view of the difficulty level of training with the positive datasets that are generated by different strategies. Based on the noisy DS positive dataset \\( P \\), DSGAN represents that the cleaned positive dataset is generated by our DSGAN generator; Random means that the positive set is randomly selected from \\( P \\); Pre-training denotes that the dataset is selected according to the prediction probability of the pre-trained generator. These three new positive datasets are in the same size."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    2038,
                    1215,
                    3171
                ],
                "angle": 0,
                "content": "discriminator performs well on \\( N^D \\); moreover, \\( N^D \\) is not used during adversarial training. Therefore, the accuracy on \\( N^D \\) is the criterion to reflect the performance of the discriminator. In the early epochs, the generated samples from the generator increases the accuracy, because it has not possessed the ability of challenging the discriminator; however, as the training epoch increases, this accuracy gradually decreases, which means the discriminator becomes weaker. It is because the generator gradually learn to generate more accurate true positive samples in each bag. After the proposed adversarial learning process, the generator is strong enough to collapse the discriminator. Figure 4 gives more intuitive display of the trend of accuracy. Note that there is a critical point of the decline of accuracy for each presented relation types. It is because that the chance we give the generator to challenge the discriminator is just one time scanning of"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    1265,
                    2038,
                    2195,
                    2434
                ],
                "angle": 0,
                "content": "the noisy dataset; this critical point is yielded when the generator has already been robust enough. Thus, we stop the training process when the model reaches this critical point. To sum up, the capability of our generator can steadily increases, which indicates that DSGAN is a robust adversarial learning strategy."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    1265,
                    2490,
                    1796,
                    2543
                ],
                "angle": 0,
                "content": "4.3 Quality of Generator"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    2571,
                    2195,
                    3192
                ],
                "angle": 0,
                "content": "Due to the absence of supervised information, we validate the quality of the generator from another angle. Combining with Figure 1, for one relation type, the true positive samples must have evidently higher relevance (the cluster of purple circles). Therefore, a positive set with more true positive samples is easier to be trained; In other words, the convergence speed is faster and the fitting degree on training set is higher. Based on this, we present the comparison tests in the second row of Figure 3. We build three positive"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "502"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    339,
                    263,
                    1104,
                    792
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 4: The performance change of the discriminator on \\( N^D \\) during the training process. Each point in the curves records the prediction accuracy on \\( N^D \\) when finishing each epoch. We stop the training process when this accuracy no longer decreases."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    1238,
                    1215,
                    2143
                ],
                "angle": 0,
                "content": "datasets from the noisy distant supervision dataset \\( P \\): the randomly-selected positive set, the positive set base on the pre-trained generator and the positive set base on the DSGAN generator. For the pre-trained generator, the positive set is selected according to the probability of being positive from high to low. These three sets have the same size and are accompanied by the same negative set. Obviously, the positive set from the DSGAN generator yields the best performance, which indicates that our adversarial learning process is able to produce a robust true-positive generator. In addition, the pre-trained generator also has a good performance; however, compared with the DSGAN generator, it cannot provide the boundary between the false positives and the true positives."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    2203,
                    1113,
                    2308
                ],
                "angle": 0,
                "content": "4.4 Performance on Distant Supervision Relation Extraction"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    2343,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "Based on the proposed adversarial learning process, we obtain a generator that can recognize the true positive samples from the noisy distant supervision dataset. Naturally, the improvement of distant supervision relation extraction can provide a intuitive evaluation of our generator. We adopt the strategy mentioned in Section 3.3 to relocate the dataset. After obtaining this redistributed dataset, we apply it to train the recent state-of-the-art models and observe whether it brings further improvement for these systems. Zeng et al. (2015) and Lin et al. (2016) are both the robust models to solve wrong labeling problem of distant supervision relation extraction. According to the comparison displayed in Figure 5 and Figure 6, all four mod"
            },
            {
                "block_id": 5,
                "type": "image",
                "bbox": [
                    1324,
                    270,
                    2133,
                    954
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 5: Aggregate PR curves of CNN-based model."
            },
            {
                "block_id": 7,
                "type": "image",
                "bbox": [
                    1322,
                    1213,
                    2128,
                    1876
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 6: Aggregate PR curves of PCNN-based model."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    2167,
                    2193,
                    2276
                ],
                "angle": 0,
                "content": "els \\((CNN+ONE, CNN+ATT, PCNN+ONE\\) and \\(PCNN+ATT)\\) achieve further improvement."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    2287,
                    2198,
                    3195
                ],
                "angle": 0,
                "content": "Even though Zeng et al. (2015) and Lin et al. (2016) are designed to alleviate the influence of false positive samples, both of them merely focus on the noise filtering in the sentence bag of entity pairs. Zeng et al. (2015) combine at-least-one multi-instance learning with deep neural network to extract only one active sentence to represent the target entity pair; Lin et al. (2016) assign soft attention weights to the representations of all sentences of one entity pair, then employ the weighted sum of these representations to predict the relation between the target entity pair. However, from our manual inspection of Riedel dataset (Riedel et al., 2010), we found another false positive case that all the sentences of a specific entity pair are wrong; but the aforementioned methods overlook"
            },
            {
                "block_id": 11,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "503"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    297,
                    256,
                    1195,
                    568
                ],
                "angle": 0,
                "content": "<table><tr><td>Model</td><td>-</td><td>+DSGAN</td><td>p-value</td></tr><tr><td>CNN+ONE</td><td>0.177</td><td>0.189</td><td>4.37e-04</td></tr><tr><td>CNN+ATT</td><td>0.219</td><td>0.226</td><td>8.36e-03</td></tr><tr><td>PCNN+ONE</td><td>0.206</td><td>0.221</td><td>2.89e-06</td></tr><tr><td>PCNN+ATT</td><td>0.253</td><td>0.264</td><td>2.34e-03</td></tr></table>",
                "caption": "Table 2: Comparison of AUC values between previous studies and our DSGAN method. The \\( p \\)-value stands for the result of t-test evaluation."
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    841,
                    1215,
                    1634
                ],
                "angle": 0,
                "content": "this case, while the proposed method can solve this problem. Our DSGAN pipeline is independent of the relation prediction of entity pairs, so we can adopt our generator as the true-positive indicator to filter the noisy distant supervision dataset before relation extraction, which explains the origin of these further improvements in Figure 5 and Figure 6. In order to give more intuitive comparison, in Table 2, we present the AUC value of each PR curve, which reflects the area size under these curves. The larger value of AUC reflects the better performance. Also, as can be seen from the result of t-test evaluation, all the p-values are less than 5e-02, so the improvements are obvious."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1673,
                    615,
                    1725
                ],
                "angle": 0,
                "content": "5 Conclusion"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1764,
                    1215,
                    2830
                ],
                "angle": 0,
                "content": "Distant supervision has become a standard method in relation extraction. However, while it brings the convenience, it also introduces noise in distantly labeled sentences. In this work, we propose the first generative adversarial training method for robust distant supervision relation extraction. More specifically, our framework has two components: a generator that generates true positives, and a discriminator that tries to classify positive and negative data samples. With adversarial training, our goal is to gradually decrease the performance of the discriminator, while the generator improves the performance for predicting true positives when reaching equilibrium. Our approach is model-agnostic, and thus can be applied to any distant supervision model. Empirically, we show that our method can significantly improve the performances of many competitive baselines on the widely used New York Time dataset."
            },
            {
                "block_id": 5,
                "type": "title",
                "bbox": [
                    287,
                    2876,
                    590,
                    2936
                ],
                "angle": 0,
                "content": "Acknowledge"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2964,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": "This work was supported by National Natural Science Foundation of China (61702047), Beijing Natural Science Foundation (4174098), the Fundamental Research Funds for the Central Univer"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    263,
                    2190,
                    375
                ],
                "angle": 0,
                "content": "sities (2017RC02) and National Natural Science Foundation of China (61703234)"
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    1270,
                    470,
                    1515,
                    522
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    1267,
                    543,
                    2193,
                    691
                ],
                "angle": 0,
                "content": "Razvan Bunescu and Raymond J Mooney. 2005. Subsequence kernels for relation extraction. In NIPS, pages 171-178."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    1270,
                    715,
                    2198,
                    859
                ],
                "angle": 0,
                "content": "Liwei Cai and William Yang Wang. 2017. Kbgan: Adversarial learning for knowledge graph embeddings. arXiv preprint arXiv:1711.04071."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    1270,
                    887,
                    2200,
                    1213
                ],
                "angle": 0,
                "content": "Jenny Rose Finkel, Trond Grenager, and Christopher Manning. 2005. Incorporating non-local information into information extraction systems by gibbs sampling. In Proceedings of the 43rd annual meeting on association for computational linguistics, pages 363-370. Association for Computational Linguistics."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1241,
                    2198,
                    1480
                ],
                "angle": 0,
                "content": "Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative adversarial nets. In Advances in neural information processing systems, pages 2672-2680."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1504,
                    2198,
                    1782
                ],
                "angle": 0,
                "content": "Zhou GuoDong, Su Jian, Zhang Jie, and Zhang Min. 2005. Exploring various knowledge in relation extraction. In Proceedings of the 43rd annual meeting on association for computational linguistics, pages 427-434. Association for Computational Linguistics."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1270,
                    1813,
                    2198,
                    2185
                ],
                "angle": 0,
                "content": "Raphael Hoffmann, Congle Zhang, Xiao Ling, Luke Zettlemoyer, and Daniel S Weld. 2011. Knowledge-based weak supervision for information extraction of overlapping relations. In Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies-Volume 1, pages 541-550. Association for Computational Linguistics."
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2213,
                    2198,
                    2399
                ],
                "angle": 0,
                "content": "Daniel Jiwoong Im, Chris Dongjoo Kim, Hui Jiang, and Roland Memisevic. 2016. Generating images with recurrent adversarial networks. arXiv preprint arXiv:1602.05110."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2431,
                    2198,
                    2620
                ],
                "angle": 0,
                "content": "Guoliang Ji, Kang Liu, Shizhu He, Jun Zhao, et al. 2017. Distant supervision for relation extraction with sentence-level attention and entity descriptions. In AAAI, pages 3060-3066."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2648,
                    2198,
                    2792
                ],
                "angle": 0,
                "content": "Yankai Lin, Shiqi Shen, Zhiyuan Liu, Huanbo Luan, and Maosong Sun. 2016. Neural relation extraction with selective attention over instances. In ACL (1)."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1270,
                    2816,
                    2198,
                    3195
                ],
                "angle": 0,
                "content": "Mike Mintz, Steven Bills, Rion Snow, and Dan Jurafsky. 2009. Distant supervision for relation extraction without labeled data. In Proceedings of the Joint Conference of the 47th Annual Meeting of the ACL and the 4th International Joint Conference on Natural Language Processing of the AFNLP: Volume 2-Volume 2, pages 1003-1011. Association for Computational Linguistics."
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    1267,
                    543,
                    2200,
                    3195
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1203,
                    3234,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "504"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "ref_text",
                "bbox": [
                    292,
                    270,
                    1208,
                    406
                ],
                "angle": 0,
                "content": "Thien Huu Nguyen and Ralph Grishman. 2015. Event detection and domain adaptation with convolutional neural networks. In ACL (2), pages 365-371."
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    292,
                    442,
                    1210,
                    670
                ],
                "angle": 0,
                "content": "Pengda Qin, Weiran Xu, and Jun Guo. 2017. Designing an adaptive attention mechanism for relation classification. In Neural Networks (IJCNN), 2017 International Joint Conference on, pages 4356-4362. IEEE."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    705,
                    1210,
                    891
                ],
                "angle": 0,
                "content": "Alec Radford, Luke Metz, and Soumith Chintala. 2015. Unsupervised representation learning with deep convolutional generative adversarial networks. arXiv preprint arXiv:1511.06434."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    926,
                    1210,
                    1157
                ],
                "angle": 0,
                "content": "Sebastian Riedel, Limin Yao, and Andrew McCallum. 2010. Modeling relations and their mentions without labeled text. In *Machine Learning and Knowledge Discovery in Databases*, pages 148-163. Springer."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    1189,
                    1215,
                    1417
                ],
                "angle": 0,
                "content": "Benjamin Roth, Tassilo Barth, Michael Wiegand, and Dietrich Klakow. 2013. A survey of noise reduction methods for distant supervision. In Proceedings of the 2013 workshop on Automated knowledge base construction, pages 73-78. ACM."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1455,
                    1210,
                    1634
                ],
                "angle": 0,
                "content": "Cicero Nogueira dos Santos, Bing Xiang, and Bowen Zhou. 2015. Classifying relations by ranking with convolutional neural networks. arXiv preprint arXiv:1504.06580."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1673,
                    1210,
                    1901
                ],
                "angle": 0,
                "content": "Yatian Shen and Xuanjing Huang. 2016. Attention-based convolutional neural network for semantic relation extraction. In Proceedings of COLING 2016, the 26th International Conference on Computational Linguistics: Technical Papers."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    1936,
                    1210,
                    2259
                ],
                "angle": 0,
                "content": "Mihai Surdeanu, Julie Tibshirani, Ramesh Nallapati, and Christopher D Manning. 2012. Multi-instance multi-label learning for relation extraction. In Proceedings of the 2012 Joint Conference on Empirical Methods in Natural Language Processing and Computational Natural Language Learning, pages 455-465. Association for Computational Linguistics."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2290,
                    1210,
                    2609
                ],
                "angle": 0,
                "content": "Shingo Takamatsu, Issei Sato, and Hiroshi Nakagawa. 2012. Reducing wrong labels in distant supervision for relation extraction. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Long Papers-Volume 1, pages 721-729. Association for Computational Linguistics."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2648,
                    1210,
                    3009
                ],
                "angle": 0,
                "content": "Jun Wang, Lantao Yu, Weinan Zhang, Yu Gong, Yinghui Xu, Benyou Wang, Peng Zhang, and Dell Zhang. 2017. *Irgan: A minimax game for unifying generative and discriminative information retrieval models*. In *Proceedings of the 40th International ACM SIGIR conference on Research and Development in Information Retrieval*, pages 515-524. ACM."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    3048,
                    1210,
                    3188
                ],
                "angle": 0,
                "content": "Yongqin Xian, Bernt Schiele, and Zeynep Akata. 2017. Zero-shot learning-the good, the bad and the ugly. arXiv preprint arXiv:1703.04394."
            },
            {
                "block_id": 11,
                "type": "list",
                "bbox": [
                    292,
                    270,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2190,
                    452
                ],
                "angle": 0,
                "content": "Dmitry Zelenko, Chinatsu Aone, and Anthony Richardella. 2003. Kernel methods for relation extraction. Journal of machine learning research, 3(Feb):1083-1106."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    1272,
                    487,
                    2190,
                    764
                ],
                "angle": 0,
                "content": "Daojian Zeng, Kang Liu, Yubo Chen, and Jun Zhao. 2015. Distant supervision for relation extraction via piecewise convolutional neural networks. In Proceedings of the 2015 Conference on Empirical Methods in Natural Language Processing (EMNLP), Lisbon, Portugal, pages 17-21."
            },
            {
                "block_id": 14,
                "type": "ref_text",
                "bbox": [
                    1272,
                    799,
                    2190,
                    985
                ],
                "angle": 0,
                "content": "Daojian Zeng, Kang Liu, Siwei Lai, Guangyou Zhou, Jun Zhao, et al. 2014. Relation classification via convolutional deep neural network. In COLING, pages 2335-2344."
            },
            {
                "block_id": 15,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2190,
                    985
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 16,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "505"
            }
        ]
    }
]