[
    {
        "page_id": 0,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    488,
                    284,
                    1999,
                    420
                ],
                "angle": 0,
                "content": "Neural News Recommendation with Long- and Short-term User Representations"
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    367,
                    473,
                    2126,
                    536
                ],
                "angle": 0,
                "content": "Mingxiao An\\(^{1,*}\\), Fangzhao Wu\\(^{2}\\), Chuhan Wu\\(^{3}\\), Kun Zhang\\(^{1}\\), Zheng Liu\\(^{2}\\), Xing Xie\\(^{2}\\)"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    543,
                    536,
                    1957,
                    592
                ],
                "angle": 0,
                "content": "<sup>1</sup>University of Science and Technology of China, Hefei 230026, China"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    746,
                    596,
                    1749,
                    652
                ],
                "angle": 0,
                "content": "\\(^{2}\\)Microsoft Research Asia, Beijing 100080, China"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    401,
                    652,
                    2096,
                    712
                ],
                "angle": 0,
                "content": "\\(^{3}\\)Department of Electronic Engineering, Tsinghua University, Beijing 100084, China"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    508,
                    715,
                    1992,
                    771
                ],
                "angle": 0,
                "content": "{anmx, zhkun}@mail.ustc.edu.cn, wufangzhao@gmail.com"
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    369,
                    775,
                    2128,
                    827
                ],
                "angle": 0,
                "content": "wuch15@mails.tsinghua.edu.cn, {zhengliu, xingx}@microsoft.com"
            },
            {
                "block_id": 7,
                "type": "title",
                "bbox": [
                    654,
                    929,
                    850,
                    978
                ],
                "angle": 0,
                "content": "Abstract"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    357,
                    1027,
                    1143,
                    2669
                ],
                "angle": 0,
                "content": "Personalized news recommendation is important to help users find their interested news and improve reading experience. A key problem in news recommendation is learning accurate user representations to capture their interests. Users usually have both long-term preferences and short-term interests. However, existing news recommendation methods usually learn single representations of users, which may be insufficient. In this paper, we propose a neural news recommendation approach which can learn both long- and short-term user representations. The core of our approach is a news encoder and a user encoder. In the news encoder, we learn representations of news from their titles and topic categories, and use attention network to select important words. In the user encoder, we propose to learn long-term user representations from the embeddings of their IDs. In addition, we propose to learn short-term user representations from their recently browsed news via GRU network. Besides, we propose two methods to combine long-term and short-term user representations. The first one is using the long-term user representation to initialize the hidden state of the GRU network in short-term user representation. The second one is concatenating both long- and short-term user representations as a unified user vector. Extensive experiments on a real-world dataset show our approach can effectively improve the performance of neural news recommendation."
            },
            {
                "block_id": 9,
                "type": "title",
                "bbox": [
                    290,
                    2722,
                    650,
                    2771
                ],
                "angle": 0,
                "content": "1 Introduction"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    2809,
                    1215,
                    2981
                ],
                "angle": 0,
                "content": "Online news platforms such as MSN News<sup>1</sup> and Google News<sup>2</sup> which aggregate news from various sources and distribute them to users have gained"
            },
            {
                "block_id": 11,
                "type": "image",
                "bbox": [
                    1285,
                    922,
                    2173,
                    1192
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 1: An illustrative example of long-term and short-term interests in news reading."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1262,
                    1434,
                    2195,
                    1939
                ],
                "angle": 0,
                "content": "huge popularity and attracted hundreds of millions of users (Das et al., 2007; Wang et al., 2018). However, massive news are generated everyday, making it impossible for users to read through all news (Lian et al., 2018). Thus, personalized news recommendation is very important for online news platforms to help users find their interested contents and alleviate information overload (Lavie et al., 2010; Zheng et al., 2018)."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    1953,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "Learning accurate user representations is critical for news recommendation (Okura et al., 2017). Existing news recommendation methods usually learn a single representation for each user (Okura et al., 2017; Lian et al., 2018; Wu et al., 2019). For example, Okura et al. (2017) proposed to learn representations of news using denoising autoencoder and learn representations of users from their browsed news using GRU network (Cho et al., 2014). However, it is very difficult for RNN networks such as GRU to capture the entire information of very long news browsing history. Wang et al. (2018) proposed to learn the representations of news using knowledge-aware convolutional neural network (CNN), and learn the representations of users from their browsed news based on the similarities between the candidate news and the browsed news. However, this method needs to store the entire browsing history of each user in the online news recommendation stage, which may bring huge challenge to the storage and may cause heavy latency."
            },
            {
                "block_id": 15,
                "type": "page_footnote",
                "bbox": [
                    287,
                    3009,
                    1210,
                    3094
                ],
                "angle": 0,
                "content": "*This work was done when the first author was an intern in Microsoft Research Asia."
            },
            {
                "block_id": 16,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3097,
                    783,
                    3143
                ],
                "angle": 0,
                "content": "<sup>1</sup>https://www.msn.com/news"
            },
            {
                "block_id": 17,
                "type": "page_footnote",
                "bbox": [
                    347,
                    3143,
                    749,
                    3188
                ],
                "angle": 0,
                "content": "\\(^{2}\\)https://news.google.com/"
            },
            {
                "block_id": 18,
                "type": "list",
                "bbox": [
                    287,
                    3009,
                    1210,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    1203,
                    3230,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "336"
            },
            {
                "block_id": 20,
                "type": "footer",
                "bbox": [
                    439,
                    3301,
                    2036,
                    3350
                ],
                "angle": 0,
                "content": "Proceedings of the 57th Annual Meeting of the Association for Computational Linguistics, pages 336-345"
            },
            {
                "block_id": 21,
                "type": "footer",
                "bbox": [
                    540,
                    3353,
                    1935,
                    3399
                ],
                "angle": 0,
                "content": "Florence, Italy, July 28 - August 2, 2019. ©2019 Association for Computational Linguistics"
            }
        ]
    },
    {
        "page_id": 1,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1223,
                    1564
                ],
                "angle": 0,
                "content": "Our work is motivated by the observation that the interests of online users in news are very diverse. Some user interests may last for a long time and are consistent for the same user (Li et al., 2014). For example, as shown in Fig. 1, if a user is a fan of \"Golden State Warriors\", this user may tend to read many basketball news about this NBA team for several years. We call this kind of user preferences as long-term interest. In addition, many user interests may evolve with time and may be triggered by specific contexts or temporal demands. For example, in Fig. 1, the browsing of the news on movie \"Bohemian Rhapsody\" causes the user reading several related news such as \"Rami Malek Wins the 2019 Oscar\" since \"Rami Malek\" is an important actor in this movie, although this user may never read news about \"Rami Malek\" before. We call this kind of user interests as short-term interest. Thus, both long-term and short-term user interests are important for personalized news recommendation, and distinguishing long-term user interests from short-term ones may help learn more accurate user representations."
            },
            {
                "block_id": 1,
                "type": "text",
                "bbox": [
                    285,
                    1613,
                    1220,
                    3195
                ],
                "angle": 0,
                "content": "In this paper, we propose a neural news recommendation approach with both long- and short-term user representations (LSTUR). Our approach contains two major components, i.e., a news encoder and a user encoder. The news encoder is used to learn representations of news articles from their titles and topic categories. We apply attention mechanism to the news encoder to learn informative news representations by selecting important words. The user encoder consists of two modules, i.e., a long-term user representation (LTUR) module and a short-term user representation (STUR) module. In STUR, we use a GRU network to learn short-term representations of users from their recently browsing news. In LTUR, we learn the long-term representations of users from the embeddings of their IDs. In addition, we propose two methods to combine the short-term and long-term user representations. The first one is using the long-term user representations to initialize the hidden state of GRU network in the STUR model. The second one is concatenating the long-tern and short-term user representations as a unified user vector. We conducted extensive experiments on a real-world dataset. The experimental results show our approach can effectively improve the performance of news recommendation and consistently outperform many baseline methods."
            },
            {
                "block_id": 2,
                "type": "title",
                "bbox": [
                    1270,
                    263,
                    1679,
                    315
                ],
                "angle": 0,
                "content": "2 Related Works"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    1262,
                    368,
                    2200,
                    1946
                ],
                "angle": 0,
                "content": "Personalized news recommendation is an important task in natural language processing field and has wide applications (Zheng et al., 2018). It is critical for news recommendation methods to learn accurate news and user representations (Wang et al., 2018). Many conventional news recommendation methods rely on manual feature engineering to build news and user representations (Phelan et al., 2009; Liu et al., 2010; Li et al., 2010; Son et al., 2013; Li et al., 2014; Bansal et al., 2015; Lian et al., 2018). For example, Liu et al. (2010) proposed to use the topic categories and interests features predicted by a Bayesian model to represent news, and use the click distribution features of news categories to represent users. Li et al. (2014) used a Latent Dirichlet Allocation (LDA) (Blei et al., 2003) model to generate topic distribution features as the news representations. They represented a session by using the topic distribution of browsed news in this session, and the representations of users were built from their session representations weighted by the time. However, these methods heavily rely on manual feature engineering, which needs massive domain knowledge to craft. In addition, the contexts and orders of words in news are not incorporated, which are important for understanding the semantic meanings of news and learning representations of news and users."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    1262,
                    1953,
                    2200,
                    3195
                ],
                "angle": 0,
                "content": "In recent years, several deep learning methods were proposed for personalized news recommendation (Wang et al., 2018; Okura et al., 2017; Zheng et al., 2018). For example, Okura et al. (2017) proposed to learn representations of news from news bodies using denoising autoencoder, and learn representations of users from the representations of their browsed news using a GRU network. Wang et al. (2018) proposed to learn representations of news from their titles via a knowledge-aware CNN network, and learn representations of users from the representations of their browsed news articles weighted by their similarities with the candidate news. Wu et al. (2019) proposed to learn news and user representations with personalized word- and news-level attention networks, which exploits the embedding of user ID to generate the query vector for the attentions. However, these methods usually learn a single representation vector for each user, and cannot distinguish the long-term preferences and short-term interests of users in reading news. Thus, the user"
            },
            {
                "block_id": 5,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "337"
            }
        ]
    },
    {
        "page_id": 2,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1215,
                    771
                ],
                "angle": 0,
                "content": "representations learned in these methods may be insufficient for news recommendation. Different from these methods, our approach can learn both long-term and short-term user representations in a unified framework to capture the diverse interests of users for personalized neural new commendation. Extensive experiments on the real-world dataset validate the effectiveness of our approach and the advantage over many baseline methods."
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    287,
                    813,
                    692,
                    869
                ],
                "angle": 0,
                "content": "3 Our Approach"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    901,
                    1210,
                    1294
                ],
                "angle": 0,
                "content": "In this section, we present our neural news recommendation approach with long- and short-term user representations (LSTUR). Our approach contains two major components, i.e., a news encoder to learn representations of news and a user encoder to learn representations of users. Next, we introduce each component in detail."
            },
            {
                "block_id": 3,
                "type": "title",
                "bbox": [
                    287,
                    1333,
                    684,
                    1382
                ],
                "angle": 0,
                "content": "3.1 News Encoder"
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    285,
                    1406,
                    1213,
                    1743
                ],
                "angle": 0,
                "content": "The news encoder is used to learn representations of news from their titles, topic and subtopic categories. The architecture of the news encoder in our approach is illustrated in Fig. 2. There are two sub-modules in the news encoder, i.e., a title encoder and a topic encoder."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1746,
                    1213,
                    2252
                ],
                "angle": 0,
                "content": "The title encoder is used to learn news representations from titles. There are three layers in the title encoder. The first layer is word embedding, which is used to convert a news title from a word sequence into a sequence of dense semantic vectors. Denote the word sequence in a news title \\( t \\) as \\( t = [w_1, w_2, \\ldots, w_N] \\), where \\( N \\) is the length of this title. It is transformed into \\( [\\pmb{w}_1, \\pmb{w}_2, \\ldots, \\pmb{w}_N] \\) via a word embedding matrix."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2255,
                    1213,
                    2929
                ],
                "angle": 0,
                "content": "The second layer in title encoder is a convolutional neural network (CNN) (LeCun et al., 2015). Local contexts are very useful for understanding the semantic meaning of news titles. For example, in the news title \"Next season of super bowl games\", the local contexts of \"bowl\" such as \"super\" and \"games\" are very important for inferring that it belongs to a sports event name. Thus, we apply a CNN network to learn contextual word representations by capturing the local context information. Denote the contextual representation of \\( w_{i} \\) as \\( c_{i} \\), which is computed as follows:"
            },
            {
                "block_id": 7,
                "type": "equation",
                "bbox": [
                    411,
                    2978,
                    1210,
                    3037
                ],
                "angle": 0,
                "content": "\\[\n\\boldsymbol {c} _ {i} = \\operatorname {R e L U} \\left(\\boldsymbol {C} \\times \\boldsymbol {w} _ {[ i - M: i + M ]} + \\boldsymbol {b}\\right), \\tag {1}\n\\]"
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    287,
                    3080,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": "where \\(\\pmb{w}_{[i - M:i + M]}\\) is the concatenation of the embeddings of words between position \\(i - M\\) and"
            },
            {
                "block_id": 9,
                "type": "image",
                "bbox": [
                    1275,
                    270,
                    2190,
                    771
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 2: The framework of the news encoder."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    957,
                    2190,
                    1066
                ],
                "angle": 0,
                "content": "\\(i + M\\). \\(C\\) and \\(\\pmb{b}\\) are the parameters of the convolutional filters in CNN, and \\(M\\) is the window size."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1262,
                    1069,
                    2193,
                    1799
                ],
                "angle": 0,
                "content": "The third layer is an attention network (Bahdanau et al., 2015). Different words in the same news title may have different informativeness for representing news. For instance, in the news title \"The best NBA moments in 2018\", the word \"NBA\" is very informative for representing this news since it is an important indication of sports news, while the word \"2018\" is less informative. Thus, we employ a word-level attention network to select important words in news titles to learn more informative news representations. The attention weight \\(\\alpha_{i}\\) of the \\(i\\)-th word is formulated as follows:"
            },
            {
                "block_id": 13,
                "type": "equation",
                "bbox": [
                    1498,
                    1834,
                    1967,
                    1894
                ],
                "angle": 0,
                "content": "\\[\na _ {i} = \\tanh (\\pmb {v} \\times \\pmb {c} _ {i} + v _ {b}),\n\\]"
            },
            {
                "block_id": 14,
                "type": "equation",
                "bbox": [
                    1498,
                    1901,
                    2190,
                    2038
                ],
                "angle": 0,
                "content": "\\[\n\\alpha_ {i} = \\frac {\\exp (a _ {i})}{\\sum_ {j = 1} ^ {N} \\exp (a _ {j})}, \\tag {2}\n\\]"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    2073,
                    2193,
                    2297
                ],
                "angle": 0,
                "content": "where \\(\\pmb{v}\\) and \\(v_{b}\\) are the trainable parameters. The final representation of a news title \\(t\\) is the summation of its contextual word representations weighted by their attention weights as follows:"
            },
            {
                "block_id": 16,
                "type": "equation",
                "bbox": [
                    1590,
                    2329,
                    2190,
                    2480
                ],
                "angle": 0,
                "content": "\\[\n\\boldsymbol {e} _ {t} = \\sum_ {i = 1} ^ {N} \\alpha_ {i} \\boldsymbol {c} _ {i}. \\tag {3}\n\\]"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1265,
                    2515,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": "The topic encoder module is used to learn news representations from its topics and subtopics. On many online news platforms such as MSN news, news articles are usually labeled with a topic category (e.g., \"Sports\") and a subtopic category (e.g., \"Football NFL\") to help target user interests. The topic and subtopic categories of news are also informative for learning representations of news and users. They can reveal the general and detailed topics of the news, and reflect the preferences of users. For example, if a user browsed many news articles with the \"Sports\" topic category, then we"
            },
            {
                "block_id": 18,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "338"
            }
        ]
    },
    {
        "page_id": 3,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    327,
                    249,
                    1223,
                    785
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) LSTUR-ini."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1265,
                    249,
                    2138,
                    785
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) LSTUR-con."
            },
            {
                "block_id": 4,
                "type": "image_caption",
                "bbox": [
                    764,
                    891,
                    1716,
                    943
                ],
                "angle": 0,
                "content": "Figure 3: The two frameworks of our LSTUR approach."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    1031,
                    1215,
                    1652
                ],
                "angle": 0,
                "content": "can infer this user is probably interested in sports, and it may be effective to recommend candidate news in the \"Sports\" topic category to this user. To incorporate the topic and subtopic information into news representation, we propose to learn the representations of topics and subtopics from the embeddings of their IDs, as shown in Fig. 2. Denote \\( e_v \\) and \\( e_{sv} \\) as the representations of topic and subtopic. The final representation of a news article is the concatenation of the representations of its title, topic and subtopic, i.e., \\( e = [e_t, e_v, e_{sv}] \\)."
            },
            {
                "block_id": 6,
                "type": "title",
                "bbox": [
                    287,
                    1701,
                    672,
                    1750
                ],
                "angle": 0,
                "content": "3.2 User Encoder"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1778,
                    1215,
                    2171
                ],
                "angle": 0,
                "content": "The user encoder is used to learn representations of users from the history of their browsed news. It contains two modules, i.e., a short-term user representation model (STUR) to capture user's temporal interests, and a long-term user representation model (LTUR) to capture user's consistent preferences. Next, we introduce them in detail."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    287,
                    2217,
                    1076,
                    2269
                ],
                "angle": 0,
                "content": "3.2.1 Short-Term User Representation"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2290,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "Online users may have dynamic short-term interests in reading news articles, which may be influenced by specific contexts or temporal information demands. For example, if a user just reads a news article about \"Mission: Impossible 6 - Fallout\", and she may want to know more about the actor \"Tom Cruise\" in this movie and click news articles related to \"Tom Cruise\", although she is not his fan and may never read his news before. We propose to learn the short-term representations of users from their recent browsing history to capture their temporal interests, and use gated recurrent networks (GRU) (Cho et al., 2014) network to capture the sequential news reading patterns (Okura et al., 2017). Denote news browsing sequence from a user sorted by timestamp in ascending or-"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1262,
                    1031,
                    2195,
                    1311
                ],
                "angle": 0,
                "content": "der as \\(\\mathcal{C} = \\{c_1, c_2, \\ldots, c_k\\}\\), where \\(k\\) is the length of this sequence. We apply the news encoder to obtain the representations of these browsed articles, denoted as \\(\\{e_1, e_2, \\ldots, e_k\\}\\). The short-term user representation is computed as follows:"
            },
            {
                "block_id": 11,
                "type": "equation",
                "bbox": [
                    1429,
                    1357,
                    2188,
                    1638
                ],
                "angle": 0,
                "content": "\\[\n\\begin{array}{l} \\boldsymbol {r} _ {t} = \\sigma (\\boldsymbol {W} _ {r} [ \\boldsymbol {h} _ {t - 1}, \\boldsymbol {e} _ {t} ]), \\\\ \\boldsymbol {z} _ {t} = \\sigma (\\boldsymbol {W} _ {z} [ \\boldsymbol {h} _ {t - 1}, \\boldsymbol {e} _ {t} ]), \\\\ \\tilde {\\boldsymbol {h}} _ {t} = \\tanh  \\left(\\boldsymbol {W} _ {\\tilde {h}} \\left[ \\boldsymbol {r} _ {t} \\odot \\boldsymbol {h} _ {t - 1}, \\boldsymbol {e} _ {t} \\right]\\right), \\tag {4} \\\\ \\pmb {h} _ {t} = \\pmb {z} _ {t} \\odot \\pmb {h} _ {t} + (\\pmb {1} - \\pmb {z} _ {t}) \\odot \\tilde {\\pmb {h}} _ {t}, \\\\ \\end{array}\n\\]"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1262,
                    1683,
                    2193,
                    1964
                ],
                "angle": 0,
                "content": "where \\(\\sigma\\) is the sigmoid function, \\(\\odot\\) is the item-wise product, \\(W_{r}, W_{z}\\) and \\(W_{\\tilde{h}}\\) are the parameters of the GRU network. The short-term user representation is the last hidden state of the GRU network, i.e., \\(\\boldsymbol{u}_{s} = \\boldsymbol{h}_{k}\\)."
            },
            {
                "block_id": 13,
                "type": "title",
                "bbox": [
                    1265,
                    2003,
                    2069,
                    2059
                ],
                "angle": 0,
                "content": "3.2.2 Long-Term User Representations"
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1262,
                    2073,
                    2195,
                    2806
                ],
                "angle": 0,
                "content": "Besides the temporal interests, online users may also have long-term interests in reading news. For example, a basketball fan may tend to browse many sports news related to NBA in several years. Thus, we propose to learn long-term representations of users to capture their consistent preferences. In our approach the long-term user representations are learned from the embeddings of the user IDs, which are randomly initialized and fine-tuned during model training. Denote \\( u \\) as the ID of a user and \\( W_{u} \\) as the look-up table for long-term user representation, the long-term user representation of this user is \\( u_{l} = W_{u}[u] \\)."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1265,
                    2841,
                    1964,
                    2950
                ],
                "angle": 0,
                "content": "3.2.3 Long- and Short-Term User Representation"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1262,
                    2967,
                    2193,
                    3195
                ],
                "angle": 0,
                "content": "In this section, we introduce two methods to combine the long-term and short-term user presentations for unified user representation, which are shown in Fig. 3."
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1203,
                    3234,
                    1280,
                    3279
                ],
                "angle": 0,
                "content": "339"
            }
        ]
    },
    {
        "page_id": 4,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1223,
                    834
                ],
                "angle": 0,
                "content": "The first method is using the long-term user representation to initialize the hidden state of the GRU network in the short-term user representation model, as shown in Fig. 3a. We denote this method as LSTUR-ini. We use the last hidden state of the GRU network as the final user representation. The second method is concatenating the long-term user representation with the short-term user representation as the final user representation, as shown in Fig. 3b. We denote this method as LSTUR-con."
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    287,
                    880,
                    714,
                    936
                ],
                "angle": 0,
                "content": "3.3 Model Training"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    961,
                    1215,
                    1525
                ],
                "angle": 0,
                "content": "For online news recommendation services where user and news representations can be computed in advance, the scoring function should be as simple as possible to reduce latency. Motivated by (Okura et al., 2017), we use the simple dot production to compute the news click probability score. Denote the representation of a user \\( u \\) as \\( \\boldsymbol{u} \\) and the representation of a candidate news article \\( e_x \\) as \\( e_x \\), the probability score \\( s(u, c_x) \\) of this user clicking this news is computed as \\( s(u, c_x) = \\boldsymbol{u}^\\top \\boldsymbol{e}_x \\)."
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    285,
                    1529,
                    1215,
                    2318
                ],
                "angle": 0,
                "content": "Motivated by (Huang et al., 2013) and (Zhai et al., 2016), we propose to use the negative sampling technique for model training. For each news browsed by a user (regarded as a positive sample), we randomly sample \\( K \\) news articles from the same impression which are not clicked by this user as negative samples. Our model will jointly predict the click probability scores of the positive news and the \\( K \\) negative news. In this way, the news click prediction problem is reformulated as a pseudo \\( K + 1 \\)-way classification task. We minimize the summation of the negative log-likelihood of all positive samples during training, which can be formulated as follows:"
            },
            {
                "block_id": 4,
                "type": "equation",
                "bbox": [
                    292,
                    2364,
                    1215,
                    2571
                ],
                "angle": 0,
                "content": "\\[\n- \\sum_ {i = 1} ^ {P} \\log \\frac {\\exp (s (u , c _ {i} ^ {p}))}{\\exp (s (u , c _ {i} ^ {p})) + \\sum_ {k = 1} ^ {K} \\exp (s (u , c _ {i , k} ^ {n}))}, \\tag {5}\n\\]"
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    285,
                    2623,
                    1213,
                    2795
                ],
                "angle": 0,
                "content": "where \\(P\\) is the number of positive training samples, and \\(c_{i,k}^{n}\\) is the \\(k\\)-th negative sample in the same session with the \\(i\\)-th positive sample."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    2799,
                    1215,
                    3195
                ],
                "angle": 0,
                "content": "Since not all users can be incorporated in news recommendation model training (e.g., the new coming users), it is not appropriate to assume all users have long-term representations in our models in the prediction stage. In order to handle this problem, in the model training stage, we randomly mask the long-term representations of users with"
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2195,
                    491
                ],
                "angle": 0,
                "content": "a certain probability \\( p \\). When we mask the long-term representations, all the dimensions are set to zero. Thus, the long-term user representation in our LSTUR approach can be reformulated as:"
            },
            {
                "block_id": 8,
                "type": "equation",
                "bbox": [
                    1384,
                    536,
                    2193,
                    599
                ],
                "angle": 0,
                "content": "\\[\n\\pmb {u} _ {l} = M \\cdot \\pmb {W} _ {u} [ u ], M \\sim B (1, 1 - p), \\quad (6)\n\\]"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    1265,
                    641,
                    2195,
                    869
                ],
                "angle": 0,
                "content": "where \\( B \\) is Bernoulli distribution, and \\( M \\) is a random variable that subject to \\( B(1, 1 - p) \\). We find in experiments that this trick for model training can improve the performance of our approach."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    912,
                    1634,
                    971
                ],
                "angle": 0,
                "content": "4 Experiments"
            },
            {
                "block_id": 11,
                "type": "title",
                "bbox": [
                    1265,
                    1006,
                    2061,
                    1062
                ],
                "angle": 0,
                "content": "4.1 Dataset and Experimental Settings"
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    1080,
                    2195,
                    1701
                ],
                "angle": 0,
                "content": "Since there is no off-the-shelf dataset for news recommendation, we built one by ourselves through collecting logs from MSN News<sup>3</sup> in four weeks from December 23rd, 2018 to January 19th, 2019. We used the logs in the first three weeks for model training, and those in the last week for test. We also randomly sampled \\(10\\%\\) of logs from the training set as the validation data. For each sample, we collected the browsing history in last 7 days to learn short-term user representations. The detailed dataset statistics are summarized in Table 1."
            },
            {
                "block_id": 13,
                "type": "table",
                "bbox": [
                    1282,
                    1729,
                    2183,
                    1922
                ],
                "angle": 0,
                "content": "<table><tr><td># of users</td><td>25,000</td><td># of users in training set</td><td>22,938</td></tr><tr><td># of news</td><td>38,501</td><td>Avg. # of words per title</td><td>9.98</td></tr><tr><td># of imPRS</td><td>393,191</td><td># of positive samples</td><td>492,185</td></tr><tr><td>NP ratio4</td><td>18.74</td><td># of negative samples</td><td>9,224,537</td></tr></table>",
                "caption": "Table 1: Statistics of the dataset in our experiments."
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1265,
                    2076,
                    2195,
                    2978
                ],
                "angle": 0,
                "content": "In our experiments, we used the pretrained GloVe embedding<sup>5</sup> (Pennington et al., 2014) as the initialization of word embeddings. The word embedding dimension is 200. The number of filters in CNN network is 300, and the window size of the filters in CNN network is set to 3. We applied dropout (Srivastava et al., 2014) to each layer in our approach to mitigate overfitting. The dropout rate is 0.2. The default value of long-term user representation masking probability \\( p \\) for model training is 0.5. We used Adam (Kingma and Ba, 2014) to optimize the model, and the learning rate was 0.01. The batch size is set to 400. The number of negative samples for each positive sample is 4. These hyper-parameters were all selected according to the results on validation set. We used"
            },
            {
                "block_id": 16,
                "type": "page_footnote",
                "bbox": [
                    1329,
                    3009,
                    1858,
                    3055
                ],
                "angle": 0,
                "content": "3https://www.msn.com/en-us/news"
            },
            {
                "block_id": 17,
                "type": "page_footnote",
                "bbox": [
                    1275,
                    3055,
                    2193,
                    3139
                ],
                "angle": 0,
                "content": "4The ratio of the negative sample number to the positive sample number."
            },
            {
                "block_id": 18,
                "type": "page_footnote",
                "bbox": [
                    1329,
                    3139,
                    2076,
                    3192
                ],
                "angle": 0,
                "content": "<sup>5</sup>http://nlp.stanford.edu/data/glove.840B.300d.zip"
            },
            {
                "block_id": 19,
                "type": "list",
                "bbox": [
                    1275,
                    3009,
                    2193,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 20,
                "type": "page_number",
                "bbox": [
                    1203,
                    3234,
                    1285,
                    3279
                ],
                "angle": 0,
                "content": "340"
            }
        ]
    },
    {
        "page_id": 5,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "text",
                "bbox": [
                    285,
                    266,
                    1215,
                    659
                ],
                "angle": 0,
                "content": "impression-based ranking metrics to evaluate the performance, including area under the ROC curve (AUC), mean reciprocal rank (MRR), and normalized discounted cumulative gain (nDCG). We repeated each experiment for 10 times independently, and reported the average results with 0.95 confidence probability."
            },
            {
                "block_id": 1,
                "type": "title",
                "bbox": [
                    287,
                    694,
                    880,
                    747
                ],
                "angle": 0,
                "content": "4.2 Performance Evaluation"
            },
            {
                "block_id": 2,
                "type": "text",
                "bbox": [
                    285,
                    768,
                    1215,
                    933
                ],
                "angle": 0,
                "content": "We evaluate the performance of our approach by comparing it with several baseline methods, including:"
            },
            {
                "block_id": 3,
                "type": "text",
                "bbox": [
                    344,
                    961,
                    1220,
                    1641
                ],
                "angle": 0,
                "content": "- LibFM (Rendle, 2012), a state-of-the-art matrix factorization method which is widely used in recommendation. In our experiments, the user features are the concatenation of TF-IDF features extracted from the browsed news titles, and the normalized count features from the topics and subtopics of the browsed news. The features for news consists of TF-IDF features from its title, and one-hot vectors of its topic and subtopic. The input to LibFM is the concatenation of user features and features of candidate news."
            },
            {
                "block_id": 4,
                "type": "text",
                "bbox": [
                    344,
                    1673,
                    1215,
                    1897
                ],
                "angle": 0,
                "content": "- DeepFM (Guo et al., 2017), a widely used method that combines factorization machines and deep neural networks. We use the same features as LibFM."
            },
            {
                "block_id": 5,
                "type": "text",
                "bbox": [
                    344,
                    1932,
                    1215,
                    2213
                ],
                "angle": 0,
                "content": "- Wide & Deep (Cheng et al., 2016), another deep learning based recommendation method that combines a wide channel and a deep channel. Again, the same features with LibFM are used for both channels."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    344,
                    2245,
                    1215,
                    2473
                ],
                "angle": 0,
                "content": "- DSSM (Huang et al., 2013), deep structured semantic model. The inputs are hashed words via character trigram, where all the browsed news titles are merged as query document."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    344,
                    2504,
                    1215,
                    2729
                ],
                "angle": 0,
                "content": "- CNN (Kim, 2014), using CNN with max pooling to learn news representations from the titles of browsed news by keeping the most salient features."
            },
            {
                "block_id": 8,
                "type": "text",
                "bbox": [
                    344,
                    2764,
                    1215,
                    2988
                ],
                "angle": 0,
                "content": "- DKN (Wang et al., 2018), a deep news recommendation model which contains CNN and candidate-aware attention on the news browsing histories."
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    344,
                    3023,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "- GRU (Okura et al., 2017), learning news representations by a denoising autoencoder and user representations by a GRU network."
            },
            {
                "block_id": 10,
                "type": "list",
                "bbox": [
                    344,
                    961,
                    1220,
                    3192
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    266,
                    2193,
                    375
                ],
                "angle": 0,
                "content": "The results of comparing different methods are summarized in Table 2."
            },
            {
                "block_id": 12,
                "type": "text",
                "bbox": [
                    1265,
                    385,
                    2195,
                    1059
                ],
                "angle": 0,
                "content": "We have obtained observations from Table 2. First, the news recommendation methods (e.g. CNN, DKN and LSTUR) which use neural networks to learn news and user representations can significantly outperform the methods using manual feature engineering (e.g. LibFM, DeepFM, Wide & Deep, and DSSM). This is probably because handcrafted features are usually not optimal, and neural networks can capture both global and local semantic contexts in news, which are useful for learning more accurate news and user representations for news recommendation."
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    1066,
                    2193,
                    1743
                ],
                "angle": 0,
                "content": "Second, our LSTUR approach outperforms all baseline methods compared here, including deep learning models such as CNN, GRU and DKN. Our LSTUR approach can capture both the long-term preferences and short-term interests to capture the complex and diverse user interests in news reading, while the baseline methods only learn a single representation for each user, which is insufficient. In addition, our LSTUR approach uses attention mechanism in the news encoder to select important words, which can help learn more informative news representations."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    1265,
                    1754,
                    2193,
                    2652
                ],
                "angle": 0,
                "content": "Third, our proposed two methods to learn long- and short-term user representations, i.e., LSTUR-ini and LSTUR-con, can achieve comparable performance and both outperform baseline methods, which validate the effectiveness of these methods. In addition, the performance of LSTUR-con is more stable than LSTUR-ini, which indicates that using the concatenation of both short-term and long-term user representations is capable of retaining all the information. We also conducted experiments to explore the performance of combining both LSTUR-con and LSTUR-ini in the same model, but the performance improvement is very limited, implying that each of them can fully capture the long- and short-term user interests for news recommendation."
            },
            {
                "block_id": 15,
                "type": "title",
                "bbox": [
                    1267,
                    2711,
                    2141,
                    2827
                ],
                "angle": 0,
                "content": "4.3 Effectiveness of Long- and Short-Term User Representation"
            },
            {
                "block_id": 16,
                "type": "text",
                "bbox": [
                    1265,
                    2855,
                    2193,
                    3195
                ],
                "angle": 0,
                "content": "In this section, we conducted several experiments to explore the effectiveness of our approach in learning both long-term and short-term user representations. We compare the performance of our LSTUR methods with the long-term user representation model LTUR and the short-term user rep"
            },
            {
                "block_id": 17,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1275,
                    3279
                ],
                "angle": 0,
                "content": "341"
            }
        ]
    },
    {
        "page_id": 6,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "table",
                "bbox": [
                    508,
                    252,
                    1979,
                    862
                ],
                "angle": 0,
                "content": "<table><tr><td>Methods</td><td>AUC</td><td>MRR</td><td>nDCG@5</td><td>nDCG@10</td></tr><tr><td>LibFM</td><td>56.52 ± 1.31</td><td>25.53 ± 0.81</td><td>26.66 ± 1.04</td><td>34.72 ± 0.95</td></tr><tr><td>DeepFM</td><td>58.13 ± 1.69</td><td>27.01 ± 0.20</td><td>28.37 ± 0.57</td><td>36.78 ± 0.62</td></tr><tr><td>Wide &amp; Deep</td><td>58.07 ± 0.55</td><td>27.07 ± 0.37</td><td>28.51 ± 0.45</td><td>36.93 ± 0.43</td></tr><tr><td>DSSM</td><td>58.43 ± 0.58</td><td>27.25 ± 0.49</td><td>28.31 ± 0.60</td><td>36.91 ± 0.54</td></tr><tr><td>CNN</td><td>61.13 ± 0.77</td><td>29.44 ± 0.73</td><td>31.44 ± 0.87</td><td>39.51 ± 0.74</td></tr><tr><td>DKN</td><td>61.25 ± 0.78</td><td>29.47 ± 0.64</td><td>31.54 ± 0.79</td><td>39.59 ± 0.67</td></tr><tr><td>GRU</td><td>62.69 ± 0.16</td><td>30.24 ± 0.13</td><td>32.56 ± 0.17</td><td>40.55 ± 0.13</td></tr><tr><td>LSTUR-con</td><td>63.47 ± 0.10</td><td>30.94 ± 0.14</td><td>33.43 ± 0.13</td><td>41.34 ± 0.13</td></tr><tr><td>LSTUR-ini</td><td>63.56 ± 0.42</td><td>30.98 ± 0.32</td><td>33.45 ± 0.39</td><td>41.37 ± 0.36</td></tr></table>",
                "caption": "Table 2: The performance of different methods on news recommendation."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    332,
                    1003,
                    1193,
                    1469
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 4: The effectiveness of incorporating long-term user representations (LTUR) and short-term user representations (STUR)."
            },
            {
                "block_id": 4,
                "type": "image",
                "bbox": [
                    1285,
                    1003,
                    2153,
                    1473
                ],
                "angle": 0,
                "content": null,
                "caption": "Figure 5: The comparisons of different methods in learning short-term user representations from recently browsed news articles."
            },
            {
                "block_id": 6,
                "type": "text",
                "bbox": [
                    285,
                    1757,
                    1205,
                    1869
                ],
                "angle": 0,
                "content": "resentation model STUR. The results are summarized in Fig. 4."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1876,
                    1213,
                    2718
                ],
                "angle": 0,
                "content": "From the results we find both LTUR and STUR are useful for news recommendation, and the STUR model can outperform the LTUR model. According to the statistics in Table 1, the long-term representations of many users in test data are unavailable, which leads to relative weak performance of LTUR on these users. In addition, combining STUR and LTUR using our two long- and short-term user representation methods, i.e., LSTUR-ini and LSTUR-con, can effectively improve the performance. This result validates that incorporating both long-term and short-term user representations is useful to capture the diverse user interests more accurately and is beneficial for news recommendation."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    287,
                    2771,
                    1195,
                    2823
                ],
                "angle": 0,
                "content": "4.4 Effectiveness of News Encoders in STUR"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2852,
                    1213,
                    3192
                ],
                "angle": 0,
                "content": "In our STUR model, GRU is used to learn short-term user representations from the recent browsing news. We explore the effectiveness of GRU in encoding news by replacing it with several other encoders, including: 1) Average: using the average of all the news representations in recent browsing"
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    1265,
                    1757,
                    2190,
                    2038
                ],
                "angle": 0,
                "content": "history; 2) Attention: the summation of news representations weighted by their attention weights; 3) LSTM (Hochreiter and Schmidhuber, 1997), replacing GRU with LSTM. The results are summarized in Fig. 5."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1265,
                    2045,
                    2193,
                    2662
                ],
                "angle": 0,
                "content": "According to Fig. 5, the sequence-based encoders (e.g., GRU, LSTM) outperform the Average and Attention based encoders. This is probably because the sequence-based encoders can capture the sequential new reading patterns to learn short-term representations of users, which is difficult for Average and Attention based encoders. In addition, GRU achieves better performance than LSTM. This may be because GRU contains fewer parameters and has lower risk of overfitting. Thus, we select GRU as the news encoder in STUR."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1267,
                    2718,
                    2096,
                    2767
                ],
                "angle": 0,
                "content": "4.5 Effectiveness of News Title Encoders"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    2799,
                    2193,
                    3188
                ],
                "angle": 0,
                "content": "In this section, we conduct experiments to compare different news title encoders. In our approach, the news encoder is a combination of CNN network and an attention network (denoted as \\(\\mathrm{CNN + Att}\\)). We compare it with several variants, i.e., CNN, LSTM, and LSTM with attention (LSTM+Att), to validate the effectiveness of our"
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "342"
            }
        ]
    },
    {
        "page_id": 7,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    362,
                    263,
                    1203,
                    792
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) AUC"
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1277,
                    263,
                    2113,
                    792
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) nDCG@10"
            },
            {
                "block_id": 5,
                "type": "image",
                "bbox": [
                    362,
                    1066,
                    1200,
                    1596
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) AUC"
            },
            {
                "block_id": 7,
                "type": "image",
                "bbox": [
                    1277,
                    1066,
                    2116,
                    1596
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) nDCG@10"
            },
            {
                "block_id": 9,
                "type": "image_caption",
                "bbox": [
                    329,
                    1711,
                    2146,
                    1764
                ],
                "angle": 0,
                "content": "Figure 7: The effectiveness of incorporating news topic and subtopic information for news recommendation."
            },
            {
                "block_id": 10,
                "type": "text",
                "bbox": [
                    285,
                    1852,
                    1171,
                    1908
                ],
                "angle": 0,
                "content": "approach. The results are summarized in Fig. 6."
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    285,
                    1911,
                    1213,
                    2417
                ],
                "angle": 0,
                "content": "According to Fig. 6, using attention mechanism in both encoders based on CNN and LSTM can achieve better performance. This is probably because the attention network can select important words, which can learn more informative news representations. In addition, encoders using CNN outperform those using LSTM. This may be because local contexts in news titles are more important for learning news representations."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    285,
                    2448,
                    977,
                    2504
                ],
                "angle": 0,
                "content": "4.5.1 Effectiveness of News Topic"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    285,
                    2515,
                    1213,
                    2852
                ],
                "angle": 0,
                "content": "In this section, we conduct experiments to validate the effectiveness of incorporating topic and subtopic of news in the news encoder. We compare the performance of our approach with its variants without topic and/or subtopics. The results are shown in Fig. 7."
            },
            {
                "block_id": 14,
                "type": "text",
                "bbox": [
                    285,
                    2855,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "According to Fig. 7, incorporating either topics or subtopics can effectively improve the performance of our approach. In addition, the news encoder with subtopics outperforms the news encoder with topics. This is probably because subtopics can provide more fine-grained topic in-"
            },
            {
                "block_id": 15,
                "type": "text",
                "bbox": [
                    1262,
                    1852,
                    2193,
                    2301
                ],
                "angle": 0,
                "content": "formation which is more helpful for news recommendation. Thus, the model with subtopics can achieve better news recommendation performance. Moreover, combining topics and subtopics can further improve the performance of our approach. These results validate the effectiveness of our approach in exploiting topic information for news recommendation."
            },
            {
                "block_id": 16,
                "type": "title",
                "bbox": [
                    1265,
                    2336,
                    2059,
                    2392
                ],
                "angle": 0,
                "content": "4.5.2 Influence of Masking Probability"
            },
            {
                "block_id": 17,
                "type": "text",
                "bbox": [
                    1262,
                    2402,
                    2193,
                    2736
                ],
                "angle": 0,
                "content": "In this section, we explore the influence of the probability \\( p \\) in Eq. (6) for randomly masking long-term user representation in model training. We vary the value of \\( p \\) from 0.0 to 0.9 with a step of 0.1 for both LSTUR-ini and LSTUR-con. The results are summarized in Fig. 8."
            },
            {
                "block_id": 18,
                "type": "text",
                "bbox": [
                    1262,
                    2739,
                    2195,
                    3192
                ],
                "angle": 0,
                "content": "According to Fig. 8, the results of LSTUR-ini and LSTUR-con have similar patterns. The performance of both methods improves when \\( p \\) increases from 0. When \\( p \\) is too small, the model will tend to overfit on the LTUR, since LTUR has many parameters. Thus, the performance is not optimal. However, when \\( p \\) is too large, the performance of both methods starts to decline. This may be be"
            },
            {
                "block_id": 19,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "343"
            }
        ]
    },
    {
        "page_id": 8,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "image",
                "bbox": [
                    327,
                    249,
                    1235,
                    1076
                ],
                "angle": 0,
                "content": null,
                "caption": "(a) LSTUR-ini."
            },
            {
                "block_id": 2,
                "type": "image",
                "bbox": [
                    1262,
                    252,
                    2170,
                    1076
                ],
                "angle": 0,
                "content": null,
                "caption": "(b) LSTUR-con."
            },
            {
                "block_id": 4,
                "type": "image_caption",
                "bbox": [
                    543,
                    1192,
                    1935,
                    1245
                ],
                "angle": 0,
                "content": "Figure 8: The influence of mask probability \\( p \\) on the performance of our approach."
            },
            {
                "block_id": 5,
                "type": "image_caption",
                "bbox": [
                    320,
                    1340,
                    1185,
                    1585
                ],
                "angle": 0,
                "content": "2019 CES Highlights : Innovations in Enviro-Sensing for Robocars  \nCalifornia dries off after storm batter state for days  \n15 Recipes Inspired By Vintage Movies  \nTexas State Rep . Dennis Bonnen Elected As House Speaker  \nShould You Buy American Express Stock After Earnings ?  \nHow Meghan Markle Has Changed Prince Harry Considerably"
            },
            {
                "block_id": 6,
                "type": "image_caption",
                "bbox": [
                    315,
                    1620,
                    1185,
                    1669
                ],
                "angle": 0,
                "content": "Figure 9: Visualization of the word-level attentions."
            },
            {
                "block_id": 7,
                "type": "text",
                "bbox": [
                    285,
                    1789,
                    1215,
                    2129
                ],
                "angle": 0,
                "content": "cause the useful information in LTUR cannot be effectively incorporated. Thus, the performance is also not optimal. A moderate choice on \\( p \\) (e.g., 0.5) is most appropriate for both LSTUR-ini and LSTUR-con methods, which can properly balance the learning of LTUR and STUR."
            },
            {
                "block_id": 8,
                "type": "title",
                "bbox": [
                    287,
                    2220,
                    1111,
                    2280
                ],
                "angle": 0,
                "content": "5 Visualization of Attention Weights"
            },
            {
                "block_id": 9,
                "type": "text",
                "bbox": [
                    285,
                    2343,
                    1215,
                    3192
                ],
                "angle": 0,
                "content": "In this section, we visually explore the effectiveness of the word-level attention network in the news encoder. The attention weights in several example news titles are shown in Fig. 9. From the results, we find our approach can effectively recognize important words to learn more informative news representations. For example, the words \"Enviro-Sensing\" and \"Robocars\" in the first news title are assigned high attention weights because these words are indications of news on technologies, while the words \"2019\" and \"for\" are assigned low attention weights by our approach since they are less informative. These results validate the effectiveness of the attention network in the news encoder."
            },
            {
                "block_id": 10,
                "type": "title",
                "bbox": [
                    1267,
                    1329,
                    1597,
                    1382
                ],
                "angle": 0,
                "content": "6 Conclusion"
            },
            {
                "block_id": 11,
                "type": "text",
                "bbox": [
                    1262,
                    1424,
                    2198,
                    2662
                ],
                "angle": 0,
                "content": "In this paper, we propose a neural news recommendation approach which can learn both long- and short-term user representations. The core of our model is a news encoder and a user encoder. In the news encoder, we learn representations of news from their titles and topic categories, and use an attention network to highlight important words for informative representation learning. In the user encoder, we propose to learn long-term representations of users from the embeddings of their IDs. In addition, we learn short-term representations of users from their recently browsed news via a GRU network. Besides, we propose two methods to fuse long- and short-term user representations, i.e., using long-term user representation to initialize the hidden state of the GRU network in short-term user representation, or concatenating both long- and short-term user representations as a unified user vector. Extensive experiments on a real-world dataset collected from MSN news show our approach can effectively improve the performance of news recommendation."
            },
            {
                "block_id": 12,
                "type": "title",
                "bbox": [
                    1267,
                    2708,
                    1679,
                    2767
                ],
                "angle": 0,
                "content": "Acknowledgement"
            },
            {
                "block_id": 13,
                "type": "text",
                "bbox": [
                    1265,
                    2795,
                    2195,
                    3139
                ],
                "angle": 0,
                "content": "The authors would like to thank Microsoft News for providing technical support and data in the experiments, and Jiun-Hung Chen (Microsoft News) and Ying Qiao (Microsoft News) for their support and discussions. We also want to thank Jianqiang Huang for his help in the experiments."
            },
            {
                "block_id": 14,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1282,
                    3279
                ],
                "angle": 0,
                "content": "344"
            }
        ]
    },
    {
        "page_id": 9,
        "ocr_results": [
            {
                "block_id": 0,
                "type": "title",
                "bbox": [
                    292,
                    263,
                    535,
                    315
                ],
                "angle": 0,
                "content": "References"
            },
            {
                "block_id": 1,
                "type": "ref_text",
                "bbox": [
                    295,
                    347,
                    1213,
                    491
                ],
                "angle": 0,
                "content": "Dzmitry Bahdanau, Kyunghyun Cho, and Yoshua Bengio. 2015. Neural machine translation by jointly learning to align and translate. In ICLR."
            },
            {
                "block_id": 2,
                "type": "ref_text",
                "bbox": [
                    292,
                    529,
                    1215,
                    719
                ],
                "angle": 0,
                "content": "Trapit Bansal, Mrinal Das, and Chiranjib Bhattacharyya. 2015. Content driven user profiling for comment-worthy recommendations of news and blog articles. In RecSys, pages 195-202."
            },
            {
                "block_id": 3,
                "type": "ref_text",
                "bbox": [
                    292,
                    757,
                    1213,
                    901
                ],
                "angle": 0,
                "content": "David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of Machine Learning Research, 3(Jan):993-1022."
            },
            {
                "block_id": 4,
                "type": "ref_text",
                "bbox": [
                    292,
                    940,
                    1215,
                    1269
                ],
                "angle": 0,
                "content": "Heng-Tze Cheng, Mustafa Ispir, Rohan Anil, Zakaria Haque, Lichan Hong, Vihan Jain, Xiaobing Liu, Hemal Shah, Levent Koc, Jeremiah Harmsen, Tal Shaked, Tushar Chandra, Hrishi Aradhye, Glen Anderson, Greg Corrado, and Wei Chai. 2016. Wide & deep learning for recommender systems. In DLRS, pages 7-10."
            },
            {
                "block_id": 5,
                "type": "ref_text",
                "bbox": [
                    292,
                    1308,
                    1213,
                    1582
                ],
                "angle": 0,
                "content": "Kyunghyun Cho, Bart van Merrienboer, Caglar Gulcehre, Dzmitry Bahdanau, Fethi Bougares, Holger Schwenk, and Yoshua Bengio. 2014. Learning phrase representations using RNN encoder-decoder for statistical machine translation. In EMNLP, pages 1724-1734."
            },
            {
                "block_id": 6,
                "type": "ref_text",
                "bbox": [
                    292,
                    1627,
                    1213,
                    1813
                ],
                "angle": 0,
                "content": "Abhinandan S. Das, Mayur Datar, Ashutosh Garg, and Shyam Rajaram. 2007. Google news personalization: scalable online collaborative filtering. In WWW, pages 271-280."
            },
            {
                "block_id": 7,
                "type": "ref_text",
                "bbox": [
                    292,
                    1855,
                    1213,
                    2045
                ],
                "angle": 0,
                "content": "Huifeng Guo, Ruiming TANG, Yunming Ye, Zhen-guo Li, and Xiuqiang He. 2017. DeepFM: A factorization-machine based neural network for CTR prediction. In *IJCAI*, pages 1725-1731."
            },
            {
                "block_id": 8,
                "type": "ref_text",
                "bbox": [
                    292,
                    2083,
                    1213,
                    2227
                ],
                "angle": 0,
                "content": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural Computation, 9(8):1735-1780."
            },
            {
                "block_id": 9,
                "type": "ref_text",
                "bbox": [
                    292,
                    2269,
                    1213,
                    2455
                ],
                "angle": 0,
                "content": "Po-Sen Huang, Xiaodong He, Jianfeng Gao, Li Deng, Alex Acero, and Larry Heck. 2013. Learning deep structured semantic models for web search using clickthrough data. In CIKM, pages 2333-2338."
            },
            {
                "block_id": 10,
                "type": "ref_text",
                "bbox": [
                    292,
                    2497,
                    1213,
                    2634
                ],
                "angle": 0,
                "content": "Yoon Kim. 2014. Convolutional neural networks for sentence classification. In EMNLP, pages 1746-1751."
            },
            {
                "block_id": 11,
                "type": "ref_text",
                "bbox": [
                    292,
                    2680,
                    1213,
                    2820
                ],
                "angle": 0,
                "content": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980."
            },
            {
                "block_id": 12,
                "type": "ref_text",
                "bbox": [
                    292,
                    2862,
                    1213,
                    3051
                ],
                "angle": 0,
                "content": "Talia Lavie, Michal Sela, Ilit Oppenheim, Ohad Inbar, and Joachim Meyer. 2010. User attitudes towards news content personalization. International Journal of Human-Computer Studies, 68(8):483-495."
            },
            {
                "block_id": 13,
                "type": "ref_text",
                "bbox": [
                    292,
                    3094,
                    1213,
                    3188
                ],
                "angle": 0,
                "content": "Yann LeCun, Yoshua Bengio, and Geoffrey Hinton. 2015. Deep learning. Nature, 521(7553):436-444."
            },
            {
                "block_id": 14,
                "type": "list",
                "bbox": [
                    292,
                    347,
                    1215,
                    3188
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 15,
                "type": "ref_text",
                "bbox": [
                    1272,
                    270,
                    2190,
                    452
                ],
                "angle": 0,
                "content": "Lei Li, Li Zheng, Fan Yang, and Tao Li. 2014. Modeling and broadening temporal user interest in personalized news recommendation. *Expert Systems with Applications*, 41(7):3168-3177."
            },
            {
                "block_id": 16,
                "type": "ref_text",
                "bbox": [
                    1272,
                    480,
                    2190,
                    666
                ],
                "angle": 0,
                "content": "Lihong Li, Wei Chu, John Langford, and Robert E. Schapire. 2010. A contextual-bandit approach to personalized news article recommendation. In WWW, pages 661-670."
            },
            {
                "block_id": 17,
                "type": "ref_text",
                "bbox": [
                    1272,
                    691,
                    2190,
                    922
                ],
                "angle": 0,
                "content": "Jianxun Lian, Fuzheng Zhang, Xing Xie, and Guangzhong Sun. 2018. Towards better representation learning for personalized news recommendation: a multi-channel deep fusion approach. In *IJ-CAI*, pages 3805–3811."
            },
            {
                "block_id": 18,
                "type": "ref_text",
                "bbox": [
                    1272,
                    950,
                    2190,
                    1090
                ],
                "angle": 0,
                "content": "Jiahui Liu, Peter Dolan, and Elin Rønby Pedersen. 2010. Personalized news recommendation based on click behavior. In IUI, pages 31-40."
            },
            {
                "block_id": 19,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1115,
                    2190,
                    1297
                ],
                "angle": 0,
                "content": "Shumpei Okura, Yukihiro Tagami, Shingo Ono, and Akira Tajima. 2017. Embedding-based news recommendation for millions of users. In KDD, pages 1933-1942."
            },
            {
                "block_id": 20,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1326,
                    2190,
                    1469
                ],
                "angle": 0,
                "content": "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In EMNLP, pages 1532-1543."
            },
            {
                "block_id": 21,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1494,
                    2190,
                    1634
                ],
                "angle": 0,
                "content": "Owen Phelan, Kevin McCarthy, and Barry Smyth. 2009. Using twitter to recommend real-time topical news. In *RecSys*, pages 385-388."
            },
            {
                "block_id": 22,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1659,
                    2190,
                    1799
                ],
                "angle": 0,
                "content": "Steffen Rendle. 2012. Factorization machines with libFM. ACM Transactions on Intelligent Systems and Technology, 3(3):1-22."
            },
            {
                "block_id": 23,
                "type": "ref_text",
                "bbox": [
                    1272,
                    1824,
                    2190,
                    2013
                ],
                "angle": 0,
                "content": "Jeong-Woo Son, A-Yeong Kim, and Seong-Bae Park. 2013. A location-based news article recommendation with explicit localized semantic analysis. In SI-GIR, pages 293-302."
            },
            {
                "block_id": 24,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2038,
                    2190,
                    2269
                ],
                "angle": 0,
                "content": "Nitish Srivastava, Geoffrey E. Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: a simple way to prevent neural networks from overfitting. Journal of Machine Learning Research, 15(1):1929-1958."
            },
            {
                "block_id": 25,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2294,
                    2190,
                    2476
                ],
                "angle": 0,
                "content": "Hongwei Wang, Fuzheng Zhang, Xing Xie, and Minyi Guo. 2018. DKN: Deep knowledge-aware network for news recommendation. In WWW, pages 1835-1844."
            },
            {
                "block_id": 26,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2504,
                    2190,
                    2690
                ],
                "angle": 0,
                "content": "Chuhan Wu, Fangzhao Wu, Mingxiao An, Jianqiang Huang, Yongfeng Huang, and Xing Xie. 2019. NPA: Neural news recommendation with personalized attention. In KDD."
            },
            {
                "block_id": 27,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2715,
                    2190,
                    2904
                ],
                "angle": 0,
                "content": "Shuangfei Zhai, Keng hao Chang, Ruofei Zhang, and Zhongfei Mark Zhang. 2016. Deepintent: Learning attentions for online advertising with recurrent neural networks. In KDD, pages 1295-1304."
            },
            {
                "block_id": 28,
                "type": "ref_text",
                "bbox": [
                    1272,
                    2929,
                    2190,
                    3164
                ],
                "angle": 0,
                "content": "Guanjie Zheng, Fuzheng Zhang, Zihan Zheng, Yang Xiang, Nicholas Jing Yuan, Xing Xie, and Zhenhui Li. 2018. DRN: A deep reinforcement learning framework for news recommendation. In WWW, pages 167-176."
            },
            {
                "block_id": 29,
                "type": "list",
                "bbox": [
                    1272,
                    270,
                    2190,
                    3164
                ],
                "angle": 0,
                "content": null
            },
            {
                "block_id": 30,
                "type": "page_number",
                "bbox": [
                    1205,
                    3234,
                    1280,
                    3276
                ],
                "angle": 0,
                "content": "345"
            }
        ]
    }
]